[
  {
    "productBrand": "Scott ComfortPlus",
    "productName": "Toilet Paper, Big Rolls Big Roll",
    "listPrice": "$500",
    "description": "\n12 Big Rolls of Scott ComfortPlus Toilet Paper, 187 sheets per roll-packaging may vary from images shown. \n3x stronger than the leading bargain brand, Scott ComfortPlus 1-ply toilet paper breaks down 6x faster* and is sewer-safe, septic-safe and clog-free. \nFree of perfumes or scents, so no need to worry about allergies or irritation. \nSustainably sourced from responsibly managed forests and manufactured with 100% Wind Powered Manufacturing (US Manufacturing off-setting 100% purchased electricity with power generated at US wind farms)\nDiscover comfort and clean you can trust with Scott ComfortPlus toilet tissue rolls: 1-layer toilet paper that offers everyday comfort plus reliable strength. With Scott ComfortPlus Toilet Paper, you get 12 Big Rolls of 187 sheets, so you have plenty of toilet paper for you and your loved ones. 3x stronger than the leading bargain brand, Scott ComfortPlus breaks down 6x faster vs the leading brand one ply and is sewer-safe, septic-safe and clog-free. And here's one more reason why Scott ComfortPlus toilet paper is the perfect addition to your household supplies: Our 1-ply toilet tissue paper combines just the right amount of softness and strength by featuring thick and plush sheets for a trusted, comforting clean. We've been trusted for generations: Scott bathroom tissue is sustainably sourced from responsibly managed forests, features recyclable packaging and is a 100% biodegradable tissue. Keep life rolling by ordering Scott ComfortPlus in bulk online! * vs the leading brand one plyMade in United States(from domestic and imported material) ©Kimberly-Clark Corporation",
    "productDimensions": "Product in inches (LxWxH): 4.18x 12.54x 15.28",
    "imageUrls": "https://pics.drugstore.com/prodimg/616910/900.jpg",
    "productUPC": "UPC: 05400051437",
    "sourceURL": "https://www.walgreens.com/store/c/scott-comfortplus-toilet-paper,-big-rolls-big-roll/ID=300395785-product"
  },
  {
    "productBrand": "Big Roll",
    "productName": "Bathroom Tissue",
    "listPrice": "10/$600 or 1/$079",
    "description": "\nClog-Free   \nSafe for standard septic systems  \nSafe for use in RVs  \n1 roll - 1000 1-ply sheets per roll  \n4.1 in x 3.7 in, 105,34 total sq. ft.  \nLong lasting value.\nCompare to Scott 1000 sheets.*\nFSC: Mix - Paper supporting responsible forestry.fsc.org.\nRainforest Alliance certified.\nwalgreens.com.Questions or comments? 1-800-925-4733.\n*Scott is a registered trademark of Kimberly-Clark Worldwide, Inc. This product is not manufactured or distributed by Kimberly-Clark Worldwide Inc.Made in USA © 2022 Walgreens Co.",
    "productDimensions": "Product in inches (LxWxH): 4.46x 4.47x 4.1",
    "imageUrls": "https://pics.drugstore.com/prodimg/652391/900.jpg",
    "productUPC": "UPC: 19560205822",
    "sourceURL": "https://www.walgreens.com/store/c/big-roll-bathroom-tissue/ID=300430721-product"
  },
  {
    "productBrand": "Complete Home",
    "productName": "Soft Toilet Paper 9 Roll",
    "listPrice": "$399",
    "description": "Complete Home Soft Bathroom Tissue \nEnjoy the simple, plush comfort of Complete Home Soft Bathroom Tissue. \nDouble-sized rolls\nSeptic-safe\n\n9 double rolls = 18 regular rolls\n Each sheet 4 x 4 \n Complete Home Soft \n Septic Safe \n FSC Mix \nRainforest Alliance Certified \n Compare to Angel SoftMade in United States 100% satisfaction guaranteed © 2019 Walgreen Co.",
    "productDimensions": "Product in inches (LxWxH): 13.14x 4.38x 12.0",
    "imageUrls": "https://pics.drugstore.com/prodimg/623099/900.jpg",
    "productUPC": "UPC: 04902252709",
    "sourceURL": "https://www.walgreens.com/store/c/complete-home-soft-toilet-paper-9-roll/ID=300401623-product"
  },
  {
    "productBrand": "Walgreens",
    "productName": "Mega Super Soft Bathroom Tissue",
    "listPrice": "2/$1000 or 1/$600",
    "description": "Walgreens Super Soft Bath Tissue is soft and plush for total comfort at a great value.  These long-lasting Mega Size rolls are the smart solution to complete your home.\n\nSeptic Safe\nFSC Certified\n353.4 total sq ft (32.8 sq m).\n372 - 2-ply sheets per roll.\nEach sheet 3.8 in x 4 in (9.70 cm x 10.20 cm).\n9 mega = 41 regular rolls.*\nCompare vs Quilted Northern ultra soft & strong.T\nRainforest Alliance Certified.\nFSC: Mix - Paper from responsible sources.fsc.org.\nwalgreens.com. how2recycle.info. \n*Compared to Quilted Northern regular size roll at 82 sheets per roll.\nTQuilted Northern Ultra Soft 8 Strong and Quilted Northern are registered trademarks of Georgia-Pacific Consumer Products LP. This product is not manufactured or distributed by Georgia-Pacific Consumer Products LP.Made in United States(with domestic and imported materials) © 2021 Walgreen Co.",
    "productDimensions": "Product in inches (LxWxH): 5.0x 14.76x 11.46",
    "imageUrls": "https://pics.drugstore.com/prodimg/653776/900.jpg",
    "productUPC": "UPC: 19560202946",
    "sourceURL": "https://www.walgreens.com/store/c/walgreens-mega-super-soft-bathroom-tissue/ID=300432171-product"
  },
  {
    "productBrand": "Angel Soft",
    "productName": "Mega Roll 2 Ply Bathroom Tissue",
    "listPrice": "$749",
    "description": "An Ideal Balance of Softness and Strength. At a price that always fits your budget. Now delivers even more of what you love with 20% thicker sheets for a difference you can feel! Each Mega Roll is equal to 4 Angel Soft Regular Rolls, so you can change the roll less often. Soft, strong, septic safe in standard, well-maintained sewer and septic systems and made from sustainably sourced trees. Each pack contains 6 Mega Rolls with 320 2-ply sheets per rollMade in the United States ©Angel Soft",
    "productDimensions": "Product in inches (LxWxH): 5.13x 10.0x 11.4",
    "imageUrls": "https://pics.drugstore.com/prodimg/650779/900.jpg",
    "productUPC": "UPC: 03040079393",
    "sourceURL": "https://www.walgreens.com/store/c/angel-soft-mega-roll-2-ply-bathroom-tissue/ID=300429082-product"
  },
  {
    "productBrand": "Big Roll",
    "productName": "Bathroom Tissue",
    "listPrice": "2/$500 or 1/$300",
    "description": "Big stands for big savings!\n\nClog-Free  \nSafe for standard septic systems   \nSafe for use in RVs   \n4 rolls - 1000 1-ply sheets per roll   \n4.1 in x 3.7 in, 421.38 total sq. ft.   \nLong lasting value.\nCompare to Scott 1000 sheets.*\nFSC: Mix - Paper Supporting responsible forestry.fsc.org.\nRainforest Alliance certified.\nwalgreens.com.how2recycle.info.Questions or Comments? 1-800-925-4733. \n*Scott is a registered trademark of Kimberly-Clark Worldwide, Inc. This product is not manufactured or distributed by Kimberly-Clark Worldwide Inc.Made in USA © 2022 Walgreens Co.",
    "productDimensions": "Product in inches (LxWxH): 8.93x 4.46x 8.2",
    "imageUrls": "https://pics.drugstore.com/prodimg/652392/900.jpg",
    "productUPC": "UPC: 19560205824",
    "sourceURL": "https://www.walgreens.com/store/c/big-roll-bathroom-tissue/ID=300430722-product"
  },
  {
    "productBrand": "Cottonelle",
    "productName": "Ultra Comfort Toilet Paper, Strong Bath Tissue 4 Mega Rolls (4 Mega Rolls is 16 regular rolls)",
    "listPrice": "$749",
    "description": "\n4 Mega Rolls of Cottonelle Ultra Comfort Toilet Paper (4 Mega Rolls = 16 regular rolls*), 268 sheets per roll-packaging may vary from what is shown. \nSoft, strong and effective toilet paper that uses Soft Cleaning Ripples Texture for our ultimate in comfort vs. the leading national value brand. \nOur soft, premium 2-ply toilet paper is free of added perfumes and dyes, so no need to worry about allergies or irritation. \nSustainable solutions-made with plant-based fibers and FSC-certified, meaning we source materials that meet strict standards to protect forests and the animals and people that depend on them. \nEach Mega Roll lasts 4x longer than the leading brand's regular roll, so you don't have to change rolls as often. \nDiscover the power of all day fresh feeling with Cottonelle Ultra Comfort Toilet Paper. With Cottonelle Ultra Comfort Toilet Paper, you get 4 Mega Rolls of 268 sheets, so you have plenty of toilet paper for you and your loved ones. Our septic-safe, 2-ply toilet tissue paper is 3x more absorbent** and 3x thicker*** for a superior clean***. Our toilet tissue rolls are even conveniently designed to fit standard roll holders and each Mega Roll lasts 4x longer than the leading brand's regular roll. Plus, our softest, most absorbent and thickest bath tissue toilet paper is free of added perfumes and dyes and paraben-free. Use with Cottonelle Flushable Wipes to feel shower fresh! Wondering if our bathroom toilet paper is sustainable? Good news! Our biodegradable bathroom tissue paper is sourced from responsibly managed forests and made with water and renewable plant-based fibers, so you can feel ahhh-mazing whenever you buy Cottonelle. *vs. leading value brand regular rolls **vs. leading value brand ***per sheet vs. leading value brandMade in United States ©Kimberly-Clark Corporation",
    "productDimensions": "Product in inches (LxWxH): 5.13x 10.26x 7.64",
    "imageUrls": "https://pics.drugstore.com/prodimg/647768/900.jpg",
    "productUPC": "UPC: 03600054168",
    "sourceURL": "https://www.walgreens.com/store/c/cottonelle-ultra-comfort-toilet-paper,-strong-bath-tissue-4-mega-rolls-(4-mega-rolls-is-16-regular-rolls)/ID=300426176-product"
  },
  {
    "productBrand": "Angel Soft",
    "productName": "Mega Roll 2-ply Bathroom Tissue",
    "listPrice": "$679",
    "description": "An Ideal Balance of Softness and Strength. At a price that always fits your budget. Now delivers even more of what you love with 20% thicker sheets for a difference you can feel! Each Mega Roll is equal to 4 Angel Soft Regular Rolls, so you can change the roll less often. Soft, strong, septic safe in standard, well-maintained sewer and septic systems and made from sustainably sourced trees. Each pack contains 9 Mega Rolls with 320 2-ply sheets per roll.Made in the USA ©Angel Soft",
    "productDimensions": "Product in inches (LxWxH): 5.13x 15.63x 11.4",
    "imageUrls": "https://pics.drugstore.com/prodimg/651641/900.jpg",
    "productUPC": "UPC: 03040079395",
    "sourceURL": "https://www.walgreens.com/store/c/angel-soft-mega-roll-2-ply-bathroom-tissue/ID=300429954-product"
  },
  {
    "productBrand": "Charmin",
    "productName": "Ultra Soft Toilet Paper",
    "listPrice": "2/$2500 or 1/$1299",
    "description": "Get more irresistible cush for your tush with Charmin Ultra Soft. It's the most gentle toilet paper we've ever made and packed with extra cushiony softness you can see and feel, to comfort where you need it most. And each sheet of toilet paper is 2X more absorbent so you can use less (vs. the leading USA 1-ply bargain brand). We made it MEGA in size, so you get mega value. That's right, our Charmin Ultra Soft Mega Roll is way bigger and equals 4 regular rolls (based on number of sheets in Charmin Regular Roll bath tissue). It's more bang for your behind AND you'll be running back to the store less and less. Our Charmin Ultra Soft toilet paper is also 2-ply and designed to be clog-safe and septic-safe so you can flush worry-free. We all go, why not Enjoy The Go with America's favorite toilet paper*.\n*Charmin Brand based on sales. Source: Neilsen 2021 dollar sales.\nMade in United States of America(from domestic and imported materials.) ©©Procter & Gamble",
    "productDimensions": "Product in inches (LxWxH): 14.96x 5.19x 11.85",
    "imageUrls": "https://pics.drugstore.com/prodimg/645867/900.jpg",
    "productUPC": "UPC: 03077201518",
    "sourceURL": "https://www.walgreens.com/store/c/charmin-ultra-soft-toilet-paper/ID=300424323-product"
  },
  {
    "productBrand": "Angel Soft",
    "productName": "Mega Roll 2-ply Bathroom Tissue",
    "listPrice": "$1499",
    "description": "An Ideal Balance of Softness and Strength. At a price that always fits your budget. Now delivers even more of what you love with 20% thicker sheets for a difference you can feel!* Each Mega Roll is equal to 4 Angel Soft Regular Rolls, so you can change the roll less often. Soft, strong, septic safe in standard, well-maintained sewer and septic systems and made from sustainably sourced trees. Each pack contains 16 Mega Rolls with 320 2-ply sheets per roll.Made in USA ©Angel Soft",
    "productDimensions": "Product in inches (LxWxH): 10.25x 19.63x 7.6",
    "imageUrls": "https://pics.drugstore.com/prodimg/651642/900.jpg",
    "productUPC": "UPC: 03040079423",
    "sourceURL": "https://www.walgreens.com/store/c/angel-soft-mega-roll-2-ply-bathroom-tissue/ID=300429955-product"
  },
  {
    "productBrand": "Seventh Generation",
    "productName": "Toilet Paper",
    "listPrice": "$1999",
    "description": "100% recycled bathroom tissueNo added dyes, inks or fragrancesSafe for septic systemsAside from a clean bum, buying toilet paper may not seem like a choice that can make a great impact. But together our choices add up, and we can make a difference by using 100% recycled paper* bath tissue. If every household in the U.S. replaced one 24-pack of 240-sheet virgin fiber bathroom tissue with this product, we could help save over 4,900,00 trees**. Pretty remarkable, right? But just because you care about the environment doesn't mean the products you use have to work any less. Seventh Generation 100% Recycled Paper* Bath Tissue is an extra strong and soft 2-ply toilet paper whitened without chlorine bleach. It's gentle on the environment, septic-safe and RV-friendly, too. For more than 25 years, Seventh Generation has been thoughtfully formulating safe and effective plant-based products that work. Really well. Seventh Generation Free & Clear 100% recycled* white toilet paper, unbleached toilet paper and bathroom paper towels are made with no added dyes, inks, or fragrances. Our Free & Clear 2 ply toilet paper is Forest Stewardship Council certified as FSC Recycled* (FSC C115279). We'll always need toilet paper, and we'll always need trees; we're here to help with both. *Minimum 50% post consumer recycled paper. **FSC is not responsible for the environmental savings calculations.\n\nSeventh Generation 2-ply bathroom tissue designed for softness and strength \nChlorine free made with 100% Recycled Paper*, no added dyes, inks, or fragrances \nEco friendly toilet paper whitened without chlorine bleach \nSeptic-safe and bath tissue compatible with low-flow toilets in RVs and campers \nCaring today for the next seven generations; try our paper towels, napkins, and other household productsMade in United States ©Unilever",
    "productDimensions": "Product in inches (LxWxH): 13.2x 8.8x 16.0",
    "imageUrls": "https://pics.drugstore.com/prodimg/485226/900.jpg",
    "productUPC": "UPC: 73291313738",
    "sourceURL": "https://www.walgreens.com/store/c/seventh-generation-toilet-paper/ID=prod6198663-product"
  },
  {
    "productBrand": "Walgreens",
    "productName": "Mega Super Soft Bathroom Tissue 24 Rolls, 372 sheets, 942.2 sq ft",
    "listPrice": "$1449",
    "description": "Walgreens Super Soft Bath Tissue is soft and plush for total comfort at a great value.  These long-lasting Mega Size rolls are the smart solution to complete your home.\n\nSafe for Standard Septic Systems \nFSC Certified \nEach sheet 3.8 in x 4 in (9.70 cm x 10.20 cm). \n\n942.4 total sq ft (87.55 sq m). \n372 - 2-ply sheet per roll.\n24 Mega = 109 Regular Rolls.* \nCompare vs. Quilted Northern Ultra Soft & Strong.T \nRainforest Alliance certified.\nFSC: Mix - Paper from responsible sources.fsc.org.walgreens.com.how2recycle.info.\n*Compared to Quilted Northern regular size roll at 82 sheets per roll.\nTQuilted Northern Ultra Soft & Strong and Quilted Northern are registered trademarks of Georgia-Pacific Consumer Products LP. This product is not manufactured or distributed by Georgia-Pacific Consumer Products LP.Made in United States(with domestic & imported materials) © 2021 Walgreen Co.",
    "productDimensions": "Product in inches (LxWxH): 10.08x 14.76x 15.28",
    "imageUrls": "https://pics.drugstore.com/prodimg/654216/900.jpg",
    "productUPC": "UPC: 19560200037",
    "sourceURL": "https://www.walgreens.com/store/c/walgreens-mega-super-soft-bathroom-tissue-24-rolls,-372-sheets,-942.2-sq-ft/ID=300432595-product"
  },
  {
    "productBrand": "Scott",
    "productName": "Toilet Paper, Regular Rolls, Septic-Safe, 1-Ply",
    "listPrice": "$1399",
    "description": "1000 sheets in every toilet paper roll = America’s longest lasting roll of all national brands.Breaks up four times faster than the average bathroom tissueSewer-safe and septic-safe 1-ply toilet tissueBathroom tissue paper safe for use in RVs and boatsFSC (Forest Stewardship Council) Certified from responsible sources Packaging may vary from image shown\n12 regular rolls of Scott 1000 Toilet Paper-packaging may vary from images shown. \nFor generations, you’ve trusted Scott-our septic-safe toilet paper uses clog-free technology, lasts longer and dissolves faster* and breaks down 10x faster**. \nAmerica’s #1 long lasting brand and you always get 1000 sheets per roll for fewer roll changes. \nFree of perfumes or scents, so no need to worry about allergies or irritation. \nSustainably sourced from responsibly managed forests and manufactured with 100% Wind Powered Manufacturing (US Manufacturing off-setting 100% purchased electricity with power generated at US wind farms) and made in the USA from domestic and imported materials. \nScott 1000 Toilet Paper helps you spend time on what matters most with fewer roll changes and more value. With Scott 1000 Toilet Paper, you get 12 regular rolls of 1,000 sheets, so you have plenty of toilet paper for you and your loved ones. Plus, each roll of Scott 1000 bathroom tissue helps you get the job done with 1000 durable 1-layer sheets and lasts longer, dissolves faster* and breaks down 10x faster**. Scott 1000 1-ply toilet paper even dissolves quickly, so it’s kinder to your plumbing, sewer-safe and septic-safe. We’ve been trusted for generations: Scott bathroom tissue is sustainably sourced from responsibly managed forests, features recyclable packaging and is a 100% biodegradable tissue. *vs the leading brand mega roll **vs the leading brand one ply\nMade in UNITED STATES ©Kimberly-Clark Corporation",
    "productDimensions": "Product in inches (LxWxH): 8.2x 13.5x 8.2",
    "imageUrls": "https://pics.drugstore.com/prodimg/307668/900.jpg",
    "productUPC": "UPC: 05400010060",
    "sourceURL": "https://www.walgreens.com/store/c/scott-toilet-paper,-regular-rolls,-septic-safe,-1-ply/ID=prod6047135-product"
  },
  {
    "productBrand": "Cottonelle",
    "productName": "Toilet Paper, Strong Bath Tissue, 312 Sheets per Roll Mega Rolls",
    "listPrice": "$749",
    "description": "\n  4 Mega Rolls of Cottonelle Ultra Clean Toilet Paper (4 Mega Rolls = 16 regular rolls*), 312 sheets per roll-packaging may vary from what is shown.\n  Strong, soft and effective toilet paper that uses Strong Cleaning Ripples Texture to help clean more and leave you feeling fresh by removing more at once vs. the leading national value brand.\n  Our soft, premium 1-ply toilet paper is free of added perfumes and dyes, so no need to worry about allergies or irritation.\n  Sustainable solutions-made with plant-based fibers and FSC-certified, meaning we source materials that meet strict standards to protect forests and the animals and people that depend on them.\n  Each Mega Roll lasts 4x longer than the leading brand's regular roll, so you don't have to change rolls as often.\n\nDiscover the power of all day fresh feeling with Cottonelle Ultra Clean Toilet Paper. With Cottonelle Ultra Clean Toilet Paper, you get 4 Mega Rolls of 312 sheets, so you have plenty of toilet paper for you and your loved ones. Our septic-safe, 1-ply toilet tissue paper is 3x stronger** and 2x more absorbent** for a superior clean***. Our toilet tissue rolls are even conveniently designed to fit standard roll holders and each Mega Roll lasts 4x longer than the leading brand's regular roll. Plus, our bath tissue toilet paper is free of added perfumes and dyes and paraben-free. Use with Cottonelle Flushable Wipes to feel shower fresh! Wondering if our bathroom toilet paper is sustainable? Good news! Our biodegradable bathroom tissue paper is sourced from responsibly managed forests and made with water and renewable plant-based fibers, so you can feel ahhh-mazing whenever you buy Cottonelle. *vs. leading value brand regular rolls **vs. leading value brand ***per sheet vs. leading value brandMade in United States ©Kimberly-Clark Corporation",
    "productDimensions": "Product in inches (LxWxH): 5.13x 10.26x 7.64",
    "imageUrls": "https://pics.drugstore.com/prodimg/650301/900.jpg",
    "productUPC": "UPC: 03600054154",
    "sourceURL": "https://www.walgreens.com/store/c/cottonelle-toilet-paper,-strong-bath-tissue,-312-sheets-per-roll-mega-rolls/ID=300428632-product"
  },
  {
    "productBrand": "Cottonelle",
    "productName": "Ultra Comfort Toilet Paper",
    "listPrice": "$1000",
    "description": "\n9 Mega Rolls of Cottonelle Ultra Comfort Toilet Paper (9 Mega Rolls = 36 regular rolls*), 268 sheets per roll-packaging may vary from what is shown. \nSoft, strong and effective toilet paper that uses Soft Cleaning Ripples Texture for our ultimate in comfort vs. the leading national value brand. \nOur soft, premium 2-ply toilet paper is free of added perfumes and dyes, so no need to worry about allergies or irritation. \nSustainable solutions-made with plant-based fibers and FSC-certified, meaning we source materials that meet strict standards to protect forests and the animals and people that depend on them. \nEach Mega Roll lasts 4x longer than the leading brand's regular roll, so you don't have to change rolls as often.\nDiscover the power of all day fresh feeling with Cottonelle Ultra Comfort Toilet Paper. With Cottonelle Ultra Comfort Toilet Paper, you get 9 Mega Rolls of 268 sheets, so you have plenty of toilet paper for you and your loved ones. Our septic-safe, 2-ply toilet tissue paper is 3x more absorbent** and 3x thicker*** for a superior clean***. Our toilet tissue rolls are even conveniently designed to fit standard roll holders and each Mega Roll lasts 4x longer than the leading brand's regular roll. Plus, our softest, most absorbent and thickest bath tissue toilet paper is free of added perfumes and dyes and paraben-free. Use with Cottonelle Flushable Wipes to feel shower fresh! Wondering if our bathroom toilet paper is sustainable? Good news! Our biodegradable bathroom tissue paper is sourced from responsibly managed forests and made with water and renewable plant-based fibers, so you can feel ahhh-mazing whenever you buy Cottonelle. *vs. leading value brand regular rolls **vs. leading value brand ***per sheet vs. leading value brand Made in United States ©Kimberly-Clark Corporation",
    "productDimensions": "Product in inches (LxWxH): 5.13x 15.39x 11.46",
    "imageUrls": "https://pics.drugstore.com/prodimg/647234/900.jpg",
    "productUPC": "UPC: 03600054579",
    "sourceURL": "https://www.walgreens.com/store/c/cottonelle-ultra-comfort-toilet-paper/ID=300425663-product"
  },
  {
    "productBrand": "Scott",
    "productName": "Toilet Paper, Regular Rolls, Septic-Safe, 1-Ply (Actual Item May Vary)",
    "listPrice": "$499",
    "description": "1000 sheets in every toilet paper roll = America’s longest lasting roll of all national brands.Breaks up four times faster than the average bathroom tissueSewer-safe and septic-safe 1-ply toilet tissueBathroom tissue paper safe for use in RVs and boatsFSC (Forest Stewardship Council) Certified from responsible sources Packaging may vary from image shown\n4 regular rolls of Scott 1000 Toilet Paper-packaging may vary from images shown. \nFor generations, you've trusted Scott-our septic-safe toilet paper uses clog-free technology, lasts longer and dissolves faster* and breaks down 10x faster**. \nAmerica's #1 long lasting brand and you always get 1000 sheets per roll for fewer roll changes. \nFree of perfumes or scents, so no need to worry about allergies or irritation. \nSustainably sourced from responsibly managed forests and manufactured with 100% Wind Powered Manufacturing (US Manufacturing off-setting 100% purchased electricity with power generated at US wind farms)\nScott 1000 Toilet Paper helps you spend time on what matters most with fewer roll changes and more value. With Scott 1000 Toilet Paper, you get 4 regular rolls of 1,000 sheets, so you have plenty of toilet paper for you and your loved ones. Plus, each roll of Scott 1000 bathroom tissue helps you get the job done with 1000 durable 1-layer sheets and lasts longer, dissolves faster* and breaks down 10x faster**. Scott 1000 1-ply toilet paper even dissolves quickly, so it's kinder to your plumbing, sewer-safe and septic-safe. We've been trusted for generations: Scott bathroom tissue is sustainably sourced from responsibly managed forests, features recyclable packaging and is a 100% biodegradable tissue. *vs the leading brand mega roll. **vs the leading brand one ply\nMade in UNITED STATES ©Kimberly Clark Global Sales, LLC",
    "productDimensions": "Product in inches (LxWxH): 8.2x 9.3x 8.2",
    "imageUrls": "https://pics.drugstore.com/prodimg/307667/900.jpg",
    "productUPC": "UPC: 05400010183",
    "sourceURL": "https://www.walgreens.com/store/c/scott-toilet-paper,-regular-rolls,-septic-safe,-1-ply/ID=prod6047134-product"
  },
  {
    "productBrand": "Cottonelle",
    "productName": "Fresh Care Flushable Wet Wipes",
    "listPrice": "$649",
    "description": "\n2 flip-top packs (42 wipes per pack) of Cottonelle Fresh Care Flushable Wet Wipes, 84 total wipes-packaging may vary from what is shown. \nThe #1 septic-safe wipes brand among national brands. \nFeel shower-fresh with adult wet wipes that wash away odor-causing mess-wipes are hypoallergenic and safe for sensitive skin. \nDesigned for toilets, tested with plumbers, our adult wet wipes break down like toilet paper by losing the majority of strength within 30 minutes of flushing and 4x faster than national brands based on strength loss testing. \nSustainable solutions-made with plant-based fibers and FSC-certified, meaning we source materials that meet strict standards to protect forests and the animals and people that depend on them. \nFreshen up with hypoallergenic and plastic-free Cottonelle Fresh Care Flushable Wet Wipes, the #1 septic-safe wipes brand* and official wipes of pipes. With Cottonelle Fresh Care Flushable Wet Wipes, you get 2 packs of adult wipes, so you have plenty of body wipes for you and your loved ones. And you can count on keeping those pipes unclogged-our flushable travel wipes break down like toilet paper** and 4x faster*** than other flushable wipes. Plus, Cottonelle Flushable Wipes are compliant with IWSFG 2020, designed for toilets and tested with plumbers. Our wipes are even free of parabens, alcohol and MIT and have no harsh chemicals, dyes or plastic fibers, so your comfort is truly worry-free. Get more out of a wipe that’s safe for sensitive skin and washes away odor-causing mess by using with Cottonelle Toilet Paper for the ultimate in fresh and clean feeling^! Wondering if our bathroom flushable wipes are sustainable? Good news! Our eco-friendly^^ plastic-free flushable wipes use 100% biodegradable fibers and meet strict standards to protect forests and the animals and people that depend on them, so you can feel ahhh-mazing whenever you buy Cottonelle. *among national brands **loses majority of strength within 30 minutes of flushing ***vs. national leading brands based on strength loss testing ^using dry + moist together vs. dry alone ^^Fibers 100% biodegradableMade in United States ©Kimberly Clark Corp",
    "productDimensions": "Product in inches (LxWxH): 3.1x 3.5x 5.5",
    "imageUrls": "https://pics.drugstore.com/prodimg/491837/900.jpg",
    "productUPC": "UPC: 03600035970",
    "sourceURL": "https://www.walgreens.com/store/c/cottonelle-fresh-care-flushable-wet-wipes/ID=prod6203047-product"
  },
  {
    "productBrand": "Charmin",
    "productName": "Ultra Soft Toilet Paper, Mega Rolls",
    "listPrice": "$899",
    "description": "Get more irresistible cush for your tush with Charmin Ultra Soft. It's the most gentle toilet paper we've ever made and packed with extra cushiony softness you can see and feel, to comfort where you need it most. And each sheet of toilet paper is 2X more absorbent so you can use less (vs. the leading USA 1-ply bargain brand). We made it MEGA in size, so you get mega value. That's right, our Charmin Ultra Soft Mega Roll is way bigger and equals 4 regular rolls (based on number of sheets in Charmin Regular Roll bath tissue). It's more bang for your behind AND you'll be running back to the store less and less. Our Charmin Ultra Soft toilet paper is also 2-ply and designed to be clog-safe and septic-safe so you can flush worry-free. We all go, why not Enjoy The Go with Americas favorite toilet paper*.\n*Charmin Brand based on sales. Source: Neilsen 2021 dollar sales. Made in United States of America(from domestic and imported materials.) ©Procter & Gamble",
    "productDimensions": "Product in inches (LxWxH): 9.96x 5.19x 11.85",
    "imageUrls": "https://pics.drugstore.com/prodimg/645869/900.jpg",
    "productUPC": "UPC: 03077201467",
    "sourceURL": "https://www.walgreens.com/store/c/charmin-ultra-soft-toilet-paper,-mega-rolls/ID=300424325-product"
  },
  {
    "productBrand": "Charmin",
    "productName": "Essentials Soft Toilet Paper Mega Rolls 6 Mega Rolls",
    "listPrice": "2/$1100 or 1/$629",
    "description": "After TP that's big on softness, small on cost? That's why we made Charmin Essentials Soft. With 2-ply comfort for your booty, its thicker and more absorbent than the leading USA 1-ply bargain brand. And we made sure it strikes the perfect balance of softness and value making it good for your butt and your budget. Its MEGA so its long lasting for you and your family. Its also Roto-Rooter approved so you can roll Soft and flush confidently knowing its clog-safe and septic-safe. \n\nPack contains 6 Mega Rolls (330 sheets per roll) of Charmin Essentials Soft toilet paper  \nSoft 2-ply toilet paper  \nBig on softness, small on cost  \nCharmin Essentials Soft is thicker vs. the leading USA 1-ply bargain brand  \nClog-safe and septic-safe; Roto-Rooter approved  \nCharmin Essentials Soft is long lasting  \nCharmin Essentials Soft is more Absorbent vs. the leading USA 1-ply bargain brand  \nCharmin Essentials Soft has the perfect balance of softness and value Made in United States of America  ©Procter & Gamble",
    "productDimensions": "Product in inches (LxWxH): 9.96x 5.19x 11.85",
    "imageUrls": "https://pics.drugstore.com/prodimg/653419/900.jpg",
    "productUPC": "UPC: 03077204537",
    "sourceURL": "https://www.walgreens.com/store/c/charmin-essentials-soft-toilet-paper-mega-rolls-6-mega-rolls/ID=300431796-product"
  },
  {
    "productBrand": "Charmin",
    "productName": "Ultra Soft Toilet Paper 4 Mega Rolls",
    "listPrice": "2/$1200 or 1/$649",
    "description": "Get more irresistible cush for your tush with Charmin Ultra Soft. Its the most gentle toilet paper we've ever made and packed with extra cushiony softness you can see and feel to comfort where you need it most. And each sheet of toilet paper is 2X more absorbent so you can use less (vs. the leading USA 1-ply bargain brand). We made it MEGA in size, so you get mega value. That's right, our Charmin Ultra Soft Mega Roll is way bigger and equals 4 regular rolls (based on number of sheets in Charmin Regular Roll bath tissue). Its more bang for your behind AND you'll be running back to the store less and less. Our Charmin Ultra Soft toilet paper is also 2-ply and designed to be clog-safe and septic-safe so you can flush worry-free. We all go, why not Enjoy The Go with Americas favorite toilet paper.*\n*Charmin Brand based on sales. Source: Neilsen 2021 dollar sales.\n\nPack contains 4 Mega Rolls (244 Sheets Per Roll) of Charmin Ultra Soft Toilet Paper\nCushiony soft without compromising strength\nHolds up so your hands and behind keep clean while you go\nIrresistible softness you can see and feel\nMore 'gos' per pack with Charmin's plush Ultra Soft Mega Rolls\n2X more absorbent so you can use less and rolls last you longer vs. the leading USA 1-ply bargain brand\n1 Mega Roll = 4 Regular Rolls* so you never run out\n\n(*based on number of sheets in Charmin Regular Roll bath tissue)\nMore absorbent means you can use less* so it's better value for your behind\n\n(*vs. the leading USA 1-ply bargain brand)Made in United States of America(from domestic and imported materials.) ©Procter & Gamble",
    "productDimensions": "Product in inches (LxWxH): 9.96x 5.19x 7.91",
    "imageUrls": "https://pics.drugstore.com/prodimg/645868/900.jpg",
    "productUPC": "UPC: 03077201517",
    "sourceURL": "https://www.walgreens.com/store/c/charmin-ultra-soft-toilet-paper-4-mega-rolls/ID=300424324-product"
  },
  {
    "productBrand": "Cottonelle",
    "productName": "Gentle Plus Flushable Wet Wipes with Aloe & Vitamin E",
    "listPrice": "$649",
    "description": "\n2 flip-top packs of Cottonelle GentlePlus Flushable Wet Wipes with Aloe & Vitamin E, 84 total wipes-packaging may vary from what is shown. \nFeel shower-fresh with adult wet wipes that wash away odor-causing mess-wipes are hypoallergenic and safe for sensitive skin. \n2x more gentle vs. leading value brand, 95% pure water and aloe and vitamin E. \nDesigned for toilets, tested with plumbers, our adult wet wipes break down like toilet paper by losing the majority of strength within 30 minutes of flushing and 4x faster than national brands based on strength loss testing. \nSustainable solutions-made with plant-based fibers and FSC-certified, meaning we source materials that meet strict standards to protect forests and the animals and people that depend on them. \nFreshen up with hypoallergenic and plastic-free Cottonelle GentlePlus Flushable Wet Wipes with Aloe & Vitamin E, the #1 Septic-Safe Wipes brand* and official wipes of pipes. With Cottonelle GentlePlus Flushable Wet Wipes with Aloe & Vitamin E, you get 2 packs of adlt wipes, so you have plenty of body wipes for you and your loved ones. And you can count on keeping those pipes unclogged-our flushable travel wipes break down like toilet paper** and 4x faster*** than other flushable wipes. Plus, Cottonelle Flushable Wipes are compliant with IWSFG 2020, designed for toilets and tested with plumbers. Our wipes are even free of parabens, alcohol and MIT and have no harsh chemicals, dyes or plastic fibers, so your comfort is truly worry-free. Get more out of a wipe that’s safe for sensitive skin and washes away odor-causing mess by using with Cottonelle Toilet Paper to feel shower fresh! Refresh and renew with a gentle clean: Dermatologically tested Cottonelle GentlePlus Flushable Wet Wipes with Aloe & Vitamin E are safe for sensitive skin, 2x more gentle than the leading value brand, and 95% pure water, plus aloe and vitamin E. Wondering if our bathroom flushable wipes are sustainable? Good news! Our eco-friendly^ plastic-free flushable wipes use 100% biodegradable fibers and meet strict standards to protect forests and the animals and people that depend on them, so you can feel ahhh-mazing whenever you buy Cottonelle. *among national brands **loses majority of strength within 30 minutes of flushing ***vs. national leading brands based on strength loss testing ^Fibers 100% biodegradableMade in United States ©Cottonelle",
    "productDimensions": "Product in inches (LxWxH): 3.1x 3.5x 5.5",
    "imageUrls": "https://pics.drugstore.com/prodimg/622608/900.jpg",
    "productUPC": "UPC: 03600048985",
    "sourceURL": "https://www.walgreens.com/store/c/cottonelle-gentle-plus-flushable-wet-wipes-with-aloe-%26-vitamin-e/ID=300401193-product"
  },
  {
    "productBrand": "Quilted Northern Ultra Soft & Strong",
    "productName": "Mega Rolls",
    "listPrice": "$679",
    "description": "\nPremium & sustainable bath tissue that provides a comfortable clean with less environmental impact. \n3 trees are planted for each 1 used -1 by suppliers, 2 by our partners at the Arbor Day Foundation. \n2-ply toilet paper that has soft, durable layers that flex and hold up. \nFlushable and septic-safe for standard septic and sewer systems. \n6 Rolls / 207.7 SQ FT (19m2) / 328 2-PLY SHEETS PER ROLL / 3.8IN X 4IN (9.6 cm X 10.1 cm)  Made in USA ©Quilted Northern Ultra Soft & Strong",
    "productDimensions": "Product in inches (LxWxH): 10.31x 5.1x 11.4",
    "imageUrls": "https://pics.drugstore.com/prodimg/621733/900.jpg",
    "productUPC": "UPC: 04200094429",
    "sourceURL": "https://www.walgreens.com/store/c/quilted-northern-ultra-soft-%26-strong-mega-rolls/ID=300400355-product"
  },
  {
    "productBrand": "Cottonelle",
    "productName": "Ultra Clean Toilet Paper",
    "listPrice": "$1000",
    "description": "\n9 Mega Rolls of Cottonelle Ultra Clean Toilet Paper (9 Mega Rolls = 36 regular rolls*), 312 sheets per roll-packaging may vary from what is shown. \nStrong, soft and effective toilet paper that uses Strong Cleaning Ripples Texture to help clean more and leave you feeling fresh by removing more at once vs. the leading national value brand. \nOur soft, premium 1-ply toilet paper is free of added perfumes and dyes, so no need to worry about allergies or irritation. \nSustainable solutions-made with plant-based fibers and FSC-certified, meaning we source materials that meet strict standards to protect forests and the animals and people that depend on them. \nEach Mega Roll lasts 4x longer than the leading brand's regular roll, so you don't have to change rolls as often. \nDiscover the power of all day fresh feeling with Cottonelle Ultra Clean Toilet Paper. With Cottonelle Ultra Clean Toilet Paper, you get 9 Mega Rolls of 312 sheets, so you have plenty of toilet paper for you and your loved ones. Our septic-safe, 1-ply toilet tissue paper is 3x stronger** and 2x more absorbent** for a superior clean***. Our toilet tissue rolls are even conveniently designed to fit standard roll holders and each Mega Roll lasts 4x longer than the leading brand's regular roll. Plus, our bath tissue toilet paper is free of added perfumes and dyes and paraben-free. Use with Cottonelle Flushable Wipes to feel shower fresh! Wondering if our bathroom toilet paper is sustainable? Good news! Our biodegradable bathroom tissue paper is sourced from responsibly managed forests and made with water and renewable plant-based fibers, so you can feel ahhh-mazing whenever you buy Cottonelle. *vs. leading value brand regular rolls **vs. leading value brand ***per sheet vs. leading value brandMade in United States ©Kimberly-Clark Corporation",
    "productDimensions": "Product in inches (LxWxH): 5.13x 15.39x 11.46",
    "imageUrls": "https://pics.drugstore.com/prodimg/647233/900.jpg",
    "productUPC": "UPC: 03600054577",
    "sourceURL": "https://www.walgreens.com/store/c/cottonelle-ultra-clean-toilet-paper/ID=300425662-product"
  },
  {
    "productBrand": "Cottonelle",
    "productName": "Fresh Care On-the-Go Flushable Wet Wipes",
    "listPrice": "$149",
    "description": "\n1 peel & reseal pack of Cottonelle Fresh Care On-the-Go Flushable Wet Wipes, 14 total wipes-packaging may vary from what is shown. \nFeel shower-fresh with adult wet wipes that wash away odor-causing mess-wipes are hypoallergenic and safe for sensitive skin. \nDesigned for toilets, tested with plumbers, our adult wet wipes break down like toilet paper by losing the majority of strength within 30 minutes of flushing and 4x faster than national brands based on strength loss testing. \nSustainable solutions-made with plant-based fibers and FSC-certified, meaning we source materials that meet strict standards to protect forests and the animals and people that depend on them. \nFits in a small bag or pocket (3.5\" x 6.13\") and perfect for short or long trips and on-the-go activity. \nWhether you're at the gym, commuting, using a public restroom, cycling or running, you can freshen up on the go with hypoallergenic and plastic-free Cottonelle Fresh Care On-the-Go Flushable Wet Wipes, the #1 Septic-Safe Wipes brand* and the official wipes of pipes. With Cottonelle Fresh Care On-the-Go Flushable Wet Wipes, you get 1 pack of 14 adult wipes, so you have plenty of body wipes for you and your loved ones. And you can count on keeping those pipes unclogged-our flushable travel wipes break down like toilet paper** and 4x faster*** than other flushable wipes. Plus, Cottonelle Flushable Wipes are compliant with IWSFG 2020, designed for toilets and tested with plumbers. Our wipes are even free of parabens, alcohol and MIT and have no harsh chemicals, dyes or plastic fibers, so your comfort is truly worry-free. Get more out of a wipe that’s safe for sensitive skin and washes away odor-causing mess by using with Cottonelle Toilet Paper for the ultimate in fresh and clean feeling^! Wondering if our bathroom flushable wipes are sustainable? Good news! Our plastic-free flushable wipes use 100% biodegradable fibers and meet strict standards to protect forests and the animals and people that depend on them, so you can feel ahhh-mazing whenever you buy Cottonelle. *among national brands **loses majority of strength within 30 minutes of flushing ***vs. national leading brands based on strength loss testing ^using dry + moist together vs. dry aloneMade in United States ©Cottonelle",
    "productDimensions": "Product in inches (LxWxH): 0.69x 3.5x 6.13",
    "imageUrls": "https://pics.drugstore.com/prodimg/623540/900.jpg",
    "productUPC": "UPC: 03600051756",
    "sourceURL": "https://www.walgreens.com/store/c/cottonelle-fresh-care-on-the-go-flushable-wet-wipes/ID=300402172-product"
  },
  {
    "productBrand": "Charmin",
    "productName": "Ultra Strong Toilet Paper, Mega Rolls",
    "listPrice": "$899",
    "description": "Get sparkly clean with Charmin Ultra Strong. It's 4X stronger when wet* and has a diamond weave texture. It's woven like a washcloth and holds up when you wipe. It even cleans better so you can use less* and go longer without changing the roll**. We also made it MEGA in size, so you get mega value. That's right, our Charmin Ultra Strong Mega Roll is way bigger, equals 4 regular rolls, and it's more bang for your behind so you'll be running back to the store less and less (based on number of sheets in Charmin Regular Roll bath tissue). Our Charmin Ultra Strong toilet paper is also 2-ply and designed to be clog-safe and septic-safe so you can flush confidentially and keep clean. We all go, why not Enjoy The Go with Americas favorite toilet paper***.\n*vs. leading USA 1-ply bargain brand\n** vs. Charmin Regular Roll\n***Charmin Brand based on sales. Source: Nielsen 2021 dollar sales. Made in United States of America(from domestic and imported materials) ©Procter & Gamble",
    "productDimensions": "Product in inches (LxWxH): 9.96x 5.19x 11.85",
    "imageUrls": "https://pics.drugstore.com/prodimg/653186/900.jpg",
    "productUPC": "UPC: 03077204176",
    "sourceURL": "https://www.walgreens.com/store/c/charmin-ultra-strong-toilet-paper,-mega-rolls/ID=300431574-product"
  },
  {
    "productBrand": "Charmin",
    "productName": "Essentials Strong Toilet Paper Mega Rolls 6 Mega Rolls",
    "listPrice": "2/$1200 or 1/$679",
    "description": "Looking for TP that's big on strength, small on cost? Charmin Essentials Strong Mega Roll has you covered. Its 3x stronger when wet* so it holds up while you clean. And we made sure it strikes the perfect balance of strength and value making it good for your butt and your budget. Its MEGA so its long lasting for you and your family. Its also Roto-Rooter approved so you can roll Strong and flush confidently knowing its clog-safe and septic-safe.*vs. the leading USA 1-ply bargain brand. \n\n  Pack contains 6 Mega Rolls (429 sheets per roll) of Charmin Essentials Strong Toilet Paper \n  Charmin's strongest 1-ply toilet paper \n  Big on strength, small on cost \n  3X stronger when wet vs. the leading USA 1-ply bargain brand \n  Clog-safe and septic-safe; Roto-Rooter approved Charmin Essentials Strong is long lasting \n  Charmin Essentials Strong holds up better when wet vs. the leading USA 1-ply bargain brand \n  Perfect balance of strength and value\nMade in United States of America  ©Procter & Gamble  ",
    "productDimensions": "Product in inches (LxWxH): 9.96x 5.19x 11.85",
    "imageUrls": "https://pics.drugstore.com/prodimg/653418/900.jpg",
    "productUPC": "UPC: 03077204515",
    "sourceURL": "https://www.walgreens.com/store/c/charmin-essentials-strong-toilet-paper-mega-rolls-6-mega-rolls/ID=300431795-product"
  },
  {
    "productBrand": "Walgreens",
    "productName": "Flushable Wipes with Aloe & Vitamin E Light Fresh, 84 Sheets",
    "listPrice": "2/$900 or 1/$479",
    "description": "\nWith Aloe and Vitamin E\nCleans and Freshens\nHypoallergenic\nDermatologist Tested\nMade with Advanced Flushable Technology\nCompare to Cottonelle Flushable Wipes\nMade from plant based materials\nThey are safe for well maintained sewers and septics\nUltra SoftMade in USA(of domestic and imported materials) ©Advanced Flushable Technology",
    "productDimensions": "Product in inches (LxWxH): 6.62x 4.12x 2.37",
    "imageUrls": "https://pics.drugstore.com/prodimg/653458/900.jpg",
    "productUPC": "UPC: 04902208093",
    "sourceURL": "https://www.walgreens.com/store/c/walgreens-flushable-wipes-with-aloe-%26-vitamin-e-light-fresh/ID=300431890-product?skuId=400653458"
  },
  {
    "productBrand": "Cottonelle",
    "productName": "Fresh Care Flushable Wet Wipes",
    "listPrice": "2/$800 or 1/$429",
    "description": "Provide the ultimate cleanSewer & septic safeAlcohol free\n1 tub pack of Cottonelle Fresh Care Flushable Wet Wipes, 42 total wipes-packaging may vary from what is shown. \nThe #1 septic-safe wipes brand among national brands. \nFeel shower-fresh with adult wet wipes that wash away odor-causing mess-wipes are hypoallergenic and safe for sensitive skin. \nDesigned for toilets, tested with plumbers, our adult wet wipes break down like toilet paper by losing the majority of strength within 30 minutes of flushing and 4x faster than national brands based on strength loss testing. \nSustainable solutions-made with plant-based fibers and FSC-certified, meaning we source materials that meet strict standards to protect forests and the animals and people that depend on them. \nFreshen up with hypoallergenic and plastic-free Cottonelle Fresh Care Flushable Wet Wipes, the #1 septic-safe wipes brand* and official wipes of pipes. With Cottonelle Fresh Care Flushable Wet Wipes, you get 1 pack of 42 adult wipes, so you have plenty of body wipes for you and your loved ones. And you can count on keeping those pipes unclogged-our flushable travel wipes break down like toilet paper** and 4x faster*** than other flushable wipes. Plus, Cottonelle Flushable Wipes are compliant with IWSFG 2020, designed for toilets and tested with plumbers. Our wipes are even free of parabens, alcohol and MIT and have no harsh chemicals, dyes or plastic fibers, so your comfort is truly worry-free. Get more out of a wipe that’s safe for sensitive skin and washes away odor-causing mess by using with Cottonelle Toilet Paper for the ultimate in fresh and clean feeling^! Wondering if our bathroom flushable wipes are sustainable? Good news! Our eco-friendly^^ plastic-free flushable wipes use 100% biodegradable fibers and meet strict standards to protect forests and the animals and people that depend on them, so you can feel ahhh-mazing whenever you buy Cottonelle. *among national brands **loses majority of strength within 30 minutes of flushing ***vs. national leading brands based on strength loss testing ^using dry + moist together vs. dry alone ^^Fibers 100% biodegradableMade in United States For best results, flush only one or two wipes at a time.  Close dispenser firmly after each use to retain moisture. ©Kimberly Clark Corp",
    "productDimensions": "Product in inches (LxWxH): 2.83x 6.56x 4.87",
    "imageUrls": "https://pics.drugstore.com/prodimg/157237/900.jpg",
    "productUPC": "UPC: 03600072442",
    "sourceURL": "https://www.walgreens.com/store/c/cottonelle-fresh-care-flushable-wet-wipes/ID=prod6019002-product"
  },
  {
    "productBrand": "Cottonelle",
    "productName": "Ultra Comfort Toilet Paper, Strong Bath Tissue 6 Mega Rolls (6 Mega Rolls is 24 regular rolls)",
    "listPrice": "$799",
    "description": "\n  6 Mega Rolls of Cottonelle Ultra Comfort Toilet Paper (6 Mega Rolls = 24 regular rolls*), 268 sheets per roll-packaging may vary from what is shown.\n  Soft, strong and effective toilet paper that uses Soft Cleaning Ripples Texture for our ultimate in comfort vs. the leading national value brand.\n  Our soft, premium 2-ply toilet paper is free of added perfumes and dyes, so no need to worry about allergies or irritation.\n  Sustainable solutions-made with plant-based fibers and FSC-certified, meaning we source materials that meet strict standards to protect forests and the animals and people that depend on them.\n  Each Mega Roll lasts 4x longer than the leading brand's regular roll, so you don't have to change rolls as often.\n\nDiscover the power of all day fresh feeling with Cottonelle Ultra Comfort Toilet Paper. With Cottonelle Ultra Comfort Toilet Paper, you get 6 Mega Rolls of 268 sheets, so you have plenty of toilet paper for you and your loved ones. Our septic-safe, 2-ply toilet tissue paper is 3x more absorbent** and 3x thicker*** for a superior clean***. Our toilet tissue rolls are even conveniently designed to fit standard roll holders and each Mega Roll lasts 4x longer than the leading brand's regular roll. Plus, our softest, most absorbent and thickest bath tissue toilet paper is free of added perfumes and dyes and paraben-free. Use with Cottonelle Flushable Wipes to feel shower fresh! Wondering if our bathroom toilet paper is sustainable? Good news! Our biodegradable bathroom tissue paper is sourced from responsibly managed forests and made with water and renewable plant-based fibers, so you can feel ahhh-mazing whenever you buy Cottonelle. *vs. leading value brand regular rolls **vs. leading value brand ***per sheet vs. leading value brandMade in United States ©Kimberly-Clark Corporation",
    "productDimensions": "Product in inches (LxWxH): 5.13x 10.26x 11.46",
    "imageUrls": "https://pics.drugstore.com/prodimg/647769/900.jpg",
    "productUPC": "UPC: 03600054167",
    "sourceURL": "https://www.walgreens.com/store/c/cottonelle-ultra-comfort-toilet-paper,-strong-bath-tissue-6-mega-rolls-(6-mega-rolls-is-24-regular-rolls)/ID=300426177-product"
  },
  {
    "productBrand": "Charmin",
    "productName": "Ultra Strong Toilet Paper Mega Rolls",
    "listPrice": "2/$1200 or 1/$679",
    "description": "Get sparkly clean with Charmin Ultra Strong. Its 4X stronger when wet* and has a diamond weave texture. It's woven like a washcloth and holds up when you wipe. It even cleans better so you can use less* and go longer without changing the roll.** We also made it MEGA in size, so you get mega value. That's right, our Charmin Ultra Strong Mega Roll is way bigger, equals 4 regular rolls, and it's more bang for your behind so you'll be running back to the store less and less (based on number of sheets in Charmin Regular Roll bath tissue). Our Charmin Ultra Strong toilet paper is also 2-ply and designed to be clog-safe and septic-safe so you can flush confidentially and keep clean. We all go, why not Enjoy The Go with America's favorite toilet paper.***\n*vs. leading USA 1-ply bargain brand** vs. Charmin Regular Roll***Charmin Brand based on sales. Source: Nielsen 2021 dollar sales.\n\nPack contains 4 Mega Rolls (242 Sheets Per Roll) of Charmin Ultra Strong Toilet Paper\nCharmin Ultra Strong has washcloth like texture\n4X stronger when wet* to keep your hands and hiney clean\n\n(*vs leading USA 1-ply bargain brand)\nMade with a diamond weave texture\nClog-safe and septic-safe; Roto-Rooter approved\nCleans Better with fewer sheets and less effort*\n\n(*vs. leading USA 1-ply bargain brand)\n1 Mega Roll = 4 Regular Rolls*\n\n(*based on number of sheets in Charmin Regular Roll bath tissue)\nCleans better so you can use less*\n\n(*vs. the leading USA 1-ply bargain brand)Made in United States of America ©Procter & Gamble",
    "productDimensions": "Product in inches (LxWxH): 9.96x 5.19x 7.91",
    "imageUrls": "https://pics.drugstore.com/prodimg/653108/900.jpg",
    "productUPC": "UPC: 03077204177",
    "sourceURL": "https://www.walgreens.com/store/c/charmin-ultra-strong-toilet-paper-mega-rolls/ID=300431473-product"
  },
  {
    "productBrand": "Charmin",
    "productName": "Ultra Strong Toilet Paper",
    "listPrice": "2/$1200 or 1/$649",
    "description": "Charmin Ultra Strong is woven like a washcloth and just cleans better than the leading bargain brand, so you can be Charmin clean and proud of it. Its 4X stronger* and you can use less versus the leading bargain brand. When you buy Charmin Ultra Strong Mega Roll toilet paper, you get a big, long-lasting roll because one Charmin Mega Roll equals 4 Regular Rolls**. We all go to the bathroom, those who go with Charmin Ultra Strong Mega Roll toilet paper really Enjoy the Go! (*when wet vs. the leading bargain brand; **Based on number of sheets in Charmin Regular Roll bath tissue)Made in United States ©Procter & Gamble",
    "productDimensions": "Product in inches (LxWxH): 9.97x 5.19x 7.91",
    "imageUrls": "https://pics.drugstore.com/prodimg/630772/900.jpg",
    "productUPC": "UPC: 03700061134",
    "sourceURL": "https://www.walgreens.com/store/c/charmin-ultra-strong-toilet-paper/ID=300409606-product"
  },
  {
    "productBrand": "Scott",
    "productName": "1000 Toilet Paper, Septic-Safe, 1-Ply",
    "listPrice": "$2799",
    "description": "\n32 regular rolls of Scott 1000 Toilet Paper-packaging may vary from images shown. \nFor generations, you’ve trusted Scott-our septic-safe toilet paper uses clog-free technology, lasts longer and dissolves faster* and breaks down 10x faster**. \nAmerica’s #1 long lasting brand and you always get 1000 sheets per roll for fewer roll changes. \nFree of perfumes or scents, so no need to worry about allergies or irritation. \nSustainably sourced from responsibly managed forests and manufactured with 100% Wind Powered Manufacturing (US Manufacturing off-setting 100% purchased electricity with power generated at US wind farms)\nScott 1000 Toilet Paper helps you spend time on what matters most with fewer roll changes and more value. With Scott 1000 Toilet Paper, you get 32 regular rolls of 1,000 sheets, so you have plenty of toilet paper for you and your loved ones. Plus, each roll of Scott 1000 bathroom tissue helps you get the job done with 1000 durable 1-layer sheets and lasts longer, dissolves faster* and breaks down 10x faster**. Scott 1000 1-ply toilet paper even dissolves quickly, so it’s kinder to your plumbing, sewer-safe and septic-safe. We’ve been trusted for generations: Scott bathroom tissue is sustainably sourced from responsibly managed forests, features recyclable packaging and is a 100% biodegradable tissue. *vs the leading brand mega roll **vs the leading brand one plyMade in United States ©Kimberly-Clark Corporation",
    "productDimensions": "Product in inches (LxWxH): 18.38x 9.81x 17.19",
    "imageUrls": "https://pics.drugstore.com/prodimg/636977/900.jpg",
    "productUPC": "UPC: 05400049209",
    "sourceURL": "https://www.walgreens.com/store/c/scott-1000-toilet-paper,-septic-safe,-1-ply/ID=300415947-product"
  },
  {
    "productBrand": "Charmin",
    "productName": "Ultra Soft Toilet Paper",
    "listPrice": "$1699",
    "description": "Charmin Ultra Soft is our softest toilet paper ever so it is harder than ever to resist! It is 2X more absorbent versus the leading bargain brand. When you buy Charmin Ultra Soft Mega Roll toilet paper you get a big, long-lasting roll because one Charmin Mega Roll equals 4 Regular Rolls*. Also, Charmin Ultra Soft bath tissue is 2-ply and septic-safe. We all go to the bathroom, those who go with Charmin Ultra Soft toilet paper really Enjoy the Go!(*based on number of sheets in Charmin regular roll bath tissue)Made in United States (from domestic and imported materials) ©Procter & Gamble",
    "productDimensions": "Product in inches (LxWxH): 14.97x 5.2x 15.79",
    "imageUrls": "https://pics.drugstore.com/prodimg/620690/900.jpg",
    "productUPC": "UPC: 03700079546",
    "sourceURL": "https://www.walgreens.com/store/c/charmin-ultra-soft-toilet-paper/ID=300399351-product"
  },
  {
    "productBrand": "Charmin",
    "productName": "Ultra Soft Toilet Paper",
    "listPrice": "$1699",
    "description": "Charmin Ultra Soft is our softest toilet paper ever, so it is harder than ever to resist! It is 2X more absorbent versus the leading bargain brand. When you buy Charmin Ultra Soft Mega Roll toilet paper you get a big, long-lasting roll because one Charmin Mega Roll equals 4 Regular Rolls*. Also, Charmin Ultra Soft bath tissue is 2-ply and septic-safe. We all go to the bathroom, those who go with Charmin Ultra Soft toilet paper really Enjoy the Go! (*based on number of sheets in Charmin regular roll bath tissue).\n\nPack contains 12 Rolls (244 sheets per roll) of Charmin Ultra Soft Toilet Paper.\n1 Charmin Mega Roll = 4 Regular Rolls based on number of sheets in Charmin Regular Roll bath tissue.\nCharmin's softest 2-ply toilet paper ever made.\nIrresistibly soft toilet paper.\nMore absorbent so you can use less vs. the leading bargain brand.\nClog-safe and septic-safe; Roto-Rooter approved.\nA softer way to get clean and use less vs. the leading bargain brand.\nWe all go to the bathroom, those who go with Charmin Ultra Soft toilet paper really Enjoy the Go!  Made in United States of America(from domestic and imported materials.) ©Procter & Gamble",
    "productDimensions": "Product in inches (LxWxH): 15.27x 9.88x 7.91",
    "imageUrls": "https://pics.drugstore.com/prodimg/646603/900.jpg",
    "productUPC": "UPC: 03077201533",
    "sourceURL": "https://www.walgreens.com/store/c/charmin-ultra-soft-toilet-paper/ID=300425048-product"
  },
  {
    "productBrand": "Quilted Northern Ultra Plush",
    "productName": "Bathroom Tissue Mega Rolls",
    "listPrice": "$629",
    "description": "Silky, smooth, and soft, Quilted Northern Ultra Plush toilet paper offers 3 cushiony and absorbent layers of comfort for the clean feel you expect and the luxurious feel you desire.\n\nOur patented technology delivers the softness you want while cutting down on what you do not  (lint!).\n\nQuilted Northern Ultra Plush toilet paper is flushable and septic safe for standard sewer and septic systems. Quilted Northern toilet paper is Sustainable Forestry Initiative (SFI) certified.\n\nFor more than 100 years, Quilted Northern bathroom tissue has stood for softness, strength, and overall quality and comfort.\n\nEach roll has 284 premium, 3-ply sheets.\n\n1 Quilted Northern Ultra Plush Mega Roll = 4 Quilted Northern Ultra Plush Regular RollsMade in USA ©Quilted Northern Ultra Plush",
    "productDimensions": "Product in inches (LxWxH): 10.31x 5.1x 7.6",
    "imageUrls": "https://pics.drugstore.com/prodimg/626699/900.jpg",
    "productUPC": "UPC: 04200087454",
    "sourceURL": "https://www.walgreens.com/store/c/quilted-northern-ultra-plush-bathroom-tissue-mega-rolls/ID=300405404-product"
  },
  {
    "productBrand": "Cottonelle",
    "productName": "Ultra Clean Toilet Paper, Strong Bath Tissue 6 Mega Rolls (6 Mega Rolls is 24 regular rolls)",
    "listPrice": "$799",
    "description": "\n6 Mega Rolls of Cottonelle Ultra Clean Toilet Paper (6 Mega Rolls = 24 regular rolls*), 312 sheets per roll-packaging may vary from what is shown. \nStrong, soft and effective toilet paper that uses Strong Cleaning Ripples Texture to help clean more and leave you feeling fresh by removing more at once vs. the leading national value brand. \nOur soft, premium 1-ply toilet paper is free of added perfumes and dyes, so no need to worry about allergies or irritation. \nSustainable solutions-made with plant-based fibers and FSC-certified, meaning we source materials that meet strict standards to protect forests and the animals and people that depend on them. \nEach Mega Roll lasts 4x longer than the leading brand's regular roll, so you don't have to change rolls as often. \nDiscover the power of all day fresh feeling with Cottonelle Ultra Clean Toilet Paper. With Cottonelle Ultra Clean Toilet Paper, you get 6 Mega Rolls of 312 sheets, so you have plenty of toilet paper for you and your loved ones. Our septic-safe, 1-ply toilet tissue paper is 3x stronger** and 2x more absorbent** for a superior clean***. Our toilet tissue rolls are even conveniently designed to fit standard roll holders and each Mega Roll lasts 4x longer than the leading brand's regular roll. Plus, our bath tissue toilet paper is free of added perfumes and dyes and paraben-free. Use with Cottonelle Flushable Wipes to feel shower fresh! Wondering if our bathroom toilet paper is sustainable? Good news! Our biodegradable bathroom tissue paper is sourced from responsibly managed forests and made with water and renewable plant-based fibers, so you can feel ahhh-mazing whenever you buy Cottonelle. *vs. leading value brand regular rolls **vs. leading value brand ***per sheet vs. leading value brandMade in United States ©Kimberly-Clark Corporation",
    "productDimensions": "Product in inches (LxWxH): 5.13x 10.26x 11.46",
    "imageUrls": "https://pics.drugstore.com/prodimg/647767/900.jpg",
    "productUPC": "UPC: 03600054150",
    "sourceURL": "https://www.walgreens.com/store/c/cottonelle-ultra-clean-toilet-paper,-strong-bath-tissue-6-mega-rolls-(6-mega-rolls-is-24-regular-rolls)/ID=300426175-product"
  },
  {
    "productBrand": "Scott",
    "productName": "Rapid-Dissolving Toilet Paper",
    "listPrice": "$799",
    "description": "You've been around and so have we-Scott Rapid-Dissolving toilet paper is the #1 choice made for RVs, boats, buses, campers and more. With Scott Rapid-Dissolving Toilet Paper, you get 8 regular rolls of 231 sheets, so you have plenty of septic-safe toilet paper that breaks down after use. And our toilet papers are perfect for sensitive plumbing systems and get the job done but are soft and gentle on skin. You won't even have to worry about clogged pipes: Scott Rapid-Dissolving RV toilet paper is Clog Clinic tested and made of 100% biodegradable tissues. When you're ready to hit the road, take the septic-safe toilet paper you can trust to help protect your plumbing with our camper toilet paper. We've been trusted for generations: Each roll of Scott Rapid-Dissolving Toilet Paper features FSC-certified fiber and is made in the USA from domestic and imported materials. \n\nSeptic-safe, 1-ply toilet paper that dissolves quickly to prevent clogs and breaks down 10x faster*. \n#1 choice made for RVs and Boats and flushes with ease. \n1-layer bath tissue that's free of perfumes or scents, so no need to worry about allergies or irritation. \nSustainable sources-Sustainably sourced from responsibly managed forests and manufactured with 100% Wind Powered Manufacturing (US Manufacturing off-setting 100% purchased electricity with power generated at US wind farms) and made in the USA from domestic and imported materials. \n*vs the leading brand one ply\nMade in United States ©Kimberly-Clark Corporation",
    "productDimensions": "Product in inches (LxWxH): 4.18x 16.72x 7.64",
    "imageUrls": "https://pics.drugstore.com/prodimg/637015/900.jpg",
    "productUPC": "UPC: 05400049775",
    "sourceURL": "https://www.walgreens.com/store/c/scott-rapid-dissolving-toilet-paper/ID=300415985-product"
  },
  {
    "productBrand": "Cottonelle",
    "productName": "Ultra Clean Toilet Paper, Mega Rolls, Strong Bath Tissue 30 Mega Rolls equals 120 Regular Rolls",
    "listPrice": "$2499",
    "description": "\n30 Mega Rolls of Cottonelle Ultra Clean Toilet Paper (30 Mega Rolls = 120 regular rolls*), 312 sheets per roll-packaging may vary from what is shown. \nStrong, soft and effective toilet paper that uses Strong Cleaning Ripples Texture to help clean more and leave you feeling fresh by removing more at once vs. the leading national value brand. \nOur soft, premium 1-ply toilet paper is free of added perfumes and dyes, so no need to worry about allergies or irritation. \nSustainable solutions-made with plant-based fibers and FSC-certified, meaning we source materials that meet strict standards to protect forests and the animals and people that depend on them. \nSave big and get more with bulk toilet paper-each Mega Roll lasts 4x longer than the leading brand’s regular roll, so you don’t have to change rolls as often. \nDiscover the power of all day fresh feeling with Cottonelle Ultra Clean Toilet Paper. With Cottonelle Ultra Clean Toilet Paper, you get 30 Mega Rolls of 312 sheets, so you have plenty of toilet paper for you and your loved ones. Our septic-safe, 1-ply toilet tissue paper is 3x stronger** and 2x more absorbent** for a superior clean***. Our toilet tissue rolls are even conveniently designed to fit standard roll holders and each Mega Roll lasts 4x longer than the leading brand’s regular roll. Plus, our bath tissue toilet paper is free of added perfumes and dyes and paraben-free. Use with Cottonelle Flushable Wipes to feel shower fresh! If you love how Cottonelle delivers a confident clean, this is the size for you: Stock up and save with Cottonelle bulk toilet paper. Wondering if our bathroom toilet paper is sustainable? Good news! Our biodegradable bathroom tissue paper is sourced from responsibly managed forests and made with water and renewable plant-based fibers, so you can feel ahhh-mazing whenever you buy Cottonelle. *vs. leading value brand regular rolls **vs. leading value brand ***per sheet vs. leading value brandMade in United States ©Kimberly-Clark",
    "productDimensions": "Product in inches (LxWxH): 10.26x 15.39x 19.1",
    "imageUrls": "https://pics.drugstore.com/prodimg/647786/900.jpg",
    "productUPC": "UPC: 03600054157",
    "sourceURL": "https://www.walgreens.com/store/c/cottonelle-ultra-clean-toilet-paper,-mega-rolls,-strong-bath-tissue-30-mega-rolls-equals-120-regular-rolls/ID=300426194-product"
  },
  {
    "productBrand": "Cottonelle",
    "productName": "Ultra Comfort Toilet Paper, Mega Rolls, Strong Bath Tissue 30 Mega Rolls equals 120 Regular Rolls",
    "listPrice": "$2499",
    "description": "\n30 Mega Rolls of Cottonelle Ultra Comfort Toilet Paper (30 Mega Rolls = 120 regular rolls*), 268 sheets per roll-packaging may vary from what is shown. \nSoft, strong and effective toilet paper that uses Soft CleaningRipples Texture for our ultimate in comfort vs. the leading national value brand. \nOur soft, premium 2-ply toilet paper is free of added perfumes and dyes, so no need to worry about allergies or irritation. \nSustainable solutions-made with plant-based fibers and FSC-certified, meaning we source materials that meet strict standards to protect forests and the animals and people that depend on them. \nSave big and get more with bulk toilet paper-each Mega Roll lasts 4x longer than the leading brand’s regular roll, so you don’t have to change rolls as often. \nDiscover the power of all day fresh feeling with Cottonelle Ultra Comfort Toilet Paper. With Cottonelle Ultra Comfort Toilet Paper, you get 30 Mega Rolls of 268 sheets, so you have plenty of toilet paper for you and your loved ones. Our septic-safe, 2-ply toilet tissue paper is 3x more absorbent** and 3x thicker*** for a superior clean***. Our toilet tissue rolls are even conveniently designed to fit standard roll holders and each Mega Roll lasts 4x longer than the leading brand’s regular roll. Plus, our softest, most absorbent and thickest bath tissue toilet paper is free of added perfumes and dyes and paraben-free. Use with Cottonelle Flushable Wipes to feel shower fresh! If you love how Cottonelle delivers a confident clean, this is the size for you: Stock up and save with Cottonelle bulk toilet paper. Wondering if our bathroom toilet paper is sustainable? Good news! Our biodegradable bathroom tissue paper is sourced from responsibly managed forests and made with water and renewable plant-based fibers, so you can feel ahhh-mazing whenever you buy Cottonelle. *vs. leading value brand regular rolls **vs. leading value brand ***per sheet vs. leading value brand\nMade in United States ©Kimberly-Clark",
    "productDimensions": "Product in inches (LxWxH): 10.26x 15.39x 19.1",
    "imageUrls": "https://pics.drugstore.com/prodimg/647787/900.jpg",
    "productUPC": "UPC: 03600054170",
    "sourceURL": "https://www.walgreens.com/store/c/cottonelle-ultra-comfort-toilet-paper,-mega-rolls,-strong-bath-tissue-30-mega-rolls-equals-120-regular-rolls/ID=300426195-product"
  },
  {
    "productBrand": "Scott ComfortPlus",
    "productName": "Toilet Paper, Septic Safe, 1 Ply",
    "listPrice": "$3299",
    "description": "\n36 Mega Rolls of Scott ComfortPlus Toilet Paper, 425 sheets per roll-packaging may vary from images shown. \n3x stronger than the leading bargain brand, Scott ComfortPlus 1-ply toilet paper breaks down 6x faster* and is sewer-safe, septic-safe and clog-free. \n60% More Sheets vs Bear Brand Mega Roll, so you can change rolls less often. \nFree of perfumes or scents, so no need to worry about allergies or irritation. \nSustainably sourced from responsibly managed forests and manufactured with 100% Wind Powered Manufacturing (US Manufacturing off-setting 100% purchased electricity with power generated at US wind farms) and made in the USA from domestic and imported materials. \nDiscover comfort and clean you can trust with Scott ComfortPlus toilet tissue rolls: 1-layer toilet paper that offers everyday comfort plus reliable strength. With Scott ComfortPlus Toilet Paper, you get 36 Mega Rolls of 425 sheets, so you have plenty of toilet paper for you and your loved ones. 3x stronger than the leading bargain brand, Scott ComfortPlus breaks down 6x faster vs the leading brand one ply and is sewer-safe, septic-safe and clog-free. And here’s one more reason why Scott ComfortPlus toilet paper is the perfect addition to your household supplies: Our 1-ply toilet tissue paper combines just the right amount of softness and strength by featuring thick and plush sheets for a trusted, comforting clean. We’ve been trusted for generations: Scott bathroom tissue is sustainably sourced from responsibly managed forests, features recyclable packaging and is a 100% biodegradable tissue. Keep life rolling by ordering Scott ComfortPlus in bulk online! * vs the leading brand one plyMade in United States ©Kimberly-Clark",
    "productDimensions": "Product in inches (LxWxH): 16.0x 20.75x 12.25",
    "imageUrls": "https://pics.drugstore.com/prodimg/645870/900.jpg",
    "productUPC": "UPC: 05400054262",
    "sourceURL": "https://www.walgreens.com/store/c/scott-comfortplus-toilet-paper,-septic-safe,-1-ply/ID=300424326-product"
  },
  {
    "productBrand": "Charmin",
    "productName": "Ultra Strong Toilet Paper",
    "listPrice": "2/$2500 or 1/$1299",
    "description": "Charmin Ultra Strong is woven like a washcloth and just cleans better than the leading bargain brand, so you can be Charmin clean and proud of it. It's 4X stronger* and you can use less versus the leading bargain brand. When you buy Charmin Ultra Strong Mega Roll toilet paper, you get a long-lasting roll because one Charmin Mega Roll equals 4 Regular Rolls**. We all go to the bathroom, those who go with Charmin Ultra Strong Mega Roll toilet paper really Enjoy the Go! (*when wet vs. the leading bargain brand; **Based on number of sheets in Charmin Regular Roll bath tissue)Made in United States ©Procter & Gamble",
    "productDimensions": "Product in inches (LxWxH): 14.97x 5.19x 11.85",
    "imageUrls": "https://pics.drugstore.com/prodimg/630768/900.jpg",
    "productUPC": "UPC: 03700056804",
    "sourceURL": "https://www.walgreens.com/store/c/charmin-ultra-strong-toilet-paper/ID=300409602-product"
  },
  {
    "productBrand": "Quilted Northern Ultra Soft & Strong",
    "productName": "2-Ply Mega Roll Bathroom Tissue",
    "listPrice": "$1249",
    "description": "\nQuilted Northern Ultra Soft & Strong toilet paper is soft, strong & made sustainably for a comfy, reliable clean\nEach Mega Roll has 328 2-ply sheets that are 4X stronger & more durable than the leading value brand of toilet paper when wet\nThree trees are planted for each tree used-one through our suppliers & two more through our partnership with Arbor Day Foundation!\nWe use energy-efficient manufacturing to save 30% more water & use 30% less energy vs. other Ultra national 2-ply brands in the drying process on a per sheet basis\nTrees to make our bath tissue are sourced from well-managed, FSC certified forests, and other responsible sources\nEach pack contains 9 Mega Rolls of Quilted Northern Ultra Soft & Strong toilet paper  Made in USA ©Quilted Northern Ultra Soft & Strong",
    "productDimensions": "Product in inches (LxWxH): 5.1x 15.37x 11.4",
    "imageUrls": "https://pics.drugstore.com/prodimg/653426/900.jpg",
    "productUPC": "UPC: 04200094431",
    "sourceURL": "https://www.walgreens.com/store/c/quilted-northern-ultra-soft-%26-strong-2-ply-mega-roll-bathroom-tissue/ID=300431803-product"
  },
  {
    "productBrand": "Quilted Northern Ultra Plush",
    "productName": "Mega Roll 3-ply Bathroom Tissue",
    "listPrice": "$1249",
    "description": "Designed with more fiber in every sheet to create our softest, most plush premium toilet paper ever for a more luxurious experience. Each Mega Roll has 284 3-ply sheets and is equal to 4 Quilted Northern Regular Rolls, so you can change the roll less often. 3X thicker and 3X more absorbent than the leading value brand toilet paper. Pamper yourself with 3 cushiony-soft layers in every roll of our premium toilet paper. Each pack contains 9 Mega Rolls and is equal to 36 Regular Rolls.Made in USA ©Quilted Northern Ultra Plush.",
    "productDimensions": "Product in inches (LxWxH): 5.15x 14.88x 11.4",
    "imageUrls": "https://pics.drugstore.com/prodimg/650780/900.jpg",
    "productUPC": "UPC: 04200087446",
    "sourceURL": "https://www.walgreens.com/store/c/quilted-northern-ultra-plush-mega-roll-3-ply-bathroom-tissue/ID=300429083-product"
  },
  {
    "productBrand": "Charmin",
    "productName": "Ultra Strong Mega Roll Toilet Paper",
    "listPrice": "$899",
    "description": "Charmin Ultra Strong is woven like a washcloth and just cleans better than the leading bargain brand, so you can be Charmin clean and proud of it. Its 4X stronger* and you can use less versus the leading bargain brand. When you buy Charmin Ultra Strong Mega Roll toilet paper, you get a long-lasting roll because one Charmin Mega Roll equals 4 Regular Rolls**. We all go to the bathroom, those who go with Charmin Ultra Strong Mega Roll toilet paper really Enjoy the Go! (*when wet vs. the leading bargain brand; **Based on number of sheets in Charmin Regular Roll bath tissue)Made in United States ©Procter & Gamble",
    "productDimensions": "Product in inches (LxWxH): 9.96x 5.19x 11.85",
    "imageUrls": "https://pics.drugstore.com/prodimg/630771/900.jpg",
    "productUPC": "UPC: 03700061111",
    "sourceURL": "https://www.walgreens.com/store/c/charmin-ultra-strong-mega-roll-toilet-paper/ID=300409605-product"
  },
  {
    "productBrand": "Angel Soft",
    "productName": "Mega Roll 2 Ply Bathroom Tissue Fresh Lavender Scented Tube",
    "listPrice": "$749",
    "description": "The softness and strength you already love, with the added value of lavender scent on the tube! Now scented tube Mega Rolls deliver even more of what you love with 20% thicker sheets, for a difference you can feel! Each Mega Roll is equal to 4 Angel Soft Regular Rolls, so you can change the roll less often. Soft, strong, septic safe in standard, well-maintained sewer and septic systems and made from sustainably sourced trees. Each pack contains 8 Mega Rolls with 320 2-ply sheets per roll.Made in USA ©Angel Soft",
    "productDimensions": "Product in inches (LxWxH): 10.0x 10.25x 7.6",
    "imageUrls": "https://pics.drugstore.com/prodimg/651640/900.jpg",
    "productUPC": "UPC: 03040079435",
    "sourceURL": "https://www.walgreens.com/store/c/angel-soft-mega-roll-2-ply-bathroom-tissue-fresh-lavender-scented-tube/ID=300429953-product"
  },
  {
    "productBrand": "Quilted Northern Ultra Soft & Strong",
    "productName": "Bathroom Tissue Mega Rolls",
    "listPrice": "$629",
    "description": "Quilted Northern Ultra Soft & Strong toilet paper offers a comfortable clean you can count on with its signature 2-ply softness and flexible strength.\n\nIt has two soft and durable layers that flex and hold up - because you should not have to choose between comfort and strength.\n\nQuilted Northern Ultra Soft & Strong is biodegradable - it's flushable and septic safe for standard sewer and septic systems. Quilted Northern toilet paper is Sustainable Forestry Initiative (SFI) certified.\n\nFor more than 100 years, Quilted Northern bathroom tissue has stood for softness, strength, and overall quality and comfort.\n\nEach roll has 328 premium, 2-ply sheets.\n\n1 Quilted Northern Ultra Soft & Strong Mega Roll = 4 Quilted Northern Ultra Soft & Strong Regular RollsMade in USA ©Quilted Northern Ultra Soft & Strong",
    "productDimensions": "Product in inches (LxWxH): 10.31x 5.1x 7.6",
    "imageUrls": "https://pics.drugstore.com/prodimg/626698/900.jpg",
    "productUPC": "UPC: 04200094427",
    "sourceURL": "https://www.walgreens.com/store/c/quilted-northern-ultra-soft-%26-strong-bathroom-tissue-mega-rolls/ID=300405403-product"
  },
  {
    "productBrand": "Charmin",
    "productName": "Ultra Gentle Toilet Paper",
    "listPrice": "$1099",
    "description": "Goodbye ouchy toilet paper, hello soothed bottom thanks to Charmin Ultra Gentle! It's made with the softness you already love with a touch of soothing lotion to clean irritated skin. And we made sure Charmin Ultra Gentle is dermatologist tested so you know your skin will be protected with every use. When you buy Charmin Ultra Gentle Mega Rolls, you also get MEGA value because one Charmin Mega Roll equals four Regular rolls*. We all go to the bathroom, those who go with Charmin Ultra Gentle toilet paper really Enjoy the Go!\n*Based on number of sheets in Charmin Regular Roll bath tissue.\n\nPack contains 6 Rolls (286 sheets per roll) of Charmin Ultra Gentle Toilet Paper\n6 Mega Rolls = 24 Regular Rolls Helps protect skin after each use\nGently cleans even irritated skin\nDermatologist tested\n2-ply toilet paper with a touch of soothing lotion\nClog-safe, septic-safe, and Roto-Rooter approved\nGoodbye any ouches, hello soothing touchMade in United States of America ©Procter & Gamble",
    "productDimensions": "Product in inches (LxWxH): 9.96x 5.19x 11.85",
    "imageUrls": "https://pics.drugstore.com/prodimg/621210/900.jpg",
    "productUPC": "UPC: 03700054140",
    "sourceURL": "https://www.walgreens.com/store/c/charmin-ultra-gentle-toilet-paper/ID=300399769-product"
  },
  {
    "productBrand": "Charmin",
    "productName": "Ultra Strong Toilet Paper, Super Mega Rolls",
    "listPrice": "2/$2500 or 1/$1299",
    "description": "Get sparkly clean with Charmin Ultra Strong. It's 4X stronger when wet* and has a diamond weave texture. It's woven like a washcloth and it holds up when you wipe. It even cleans better so you can use less* and go longer without changing the roll**. We also made it SUPER MEGA in size, so you get super mega value. That's right, our Charmin Ultra Strong Super Mega Roll is way bigger, equals 6 regular rolls, and it's more bang for your behind so you'll be running back to the store less and less (based on number of sheets in Charmin Regular Roll bath tissue). Our Charmin Ultra Strong toilet paper is also 2-ply and designed to be clog-safe and septic-safe so you can flush confidentially and keep clean. We all go, why not Enjoy The Go with Americas favorite toilet paper***.\n*vs. leading USA 1-ply bargain brand\n** vs. Charmin Regular Roll\n***Charmin Brand based on sales. Source: Nielsen 2021 dollar sales. Made in United States of America(from domestic and imported materials) ©Procter & Gamble",
    "productDimensions": "Product in inches (LxWxH): 10.59x 5.51x 11.85",
    "imageUrls": "https://pics.drugstore.com/prodimg/653187/900.jpg",
    "productUPC": "UPC: 03077201569",
    "sourceURL": "https://www.walgreens.com/store/c/charmin-ultra-strong-toilet-paper,-super-mega-rolls/ID=300431575-product"
  },
  {
    "productBrand": "Seventh Generation",
    "productName": "White Toilet Paper 4 pk",
    "listPrice": "$499",
    "description": "Does not contain chlorine2 ply rollsGentle on the skinAside  from a clean bum, buying toilet paper may not seem like a choice that can  make a great impact. But together our choices add up, and we can make a difference by using 100% recycled paper* bath tissue. If every household in the U.S. replaced one 24-pack of 240-sheet virgin fiber bathroom tissue with this product, we could help save over 4,900,00 trees**. Pretty remarkable, right? But just because you care about the environment, doesn't mean the products you use have to work any less. Seventh Generation 100% RecycledPaper* Bath Tissue is an extra strong and soft 2-ply toilet paper whitened without chlorine bleach. It's gentle on the environment, septic-safe and RV-friendly, too.For more than 25 years, Seventh Generation has been thoughtfully formulating safe and effective plant-based products that work. Really well. Seventh Generation Free & Clear 100% recycled* toilet paper and paper towels are made with no added dyes, inks, or fragrances. Our Free & Clear paper is Forest Stewardship Council certified as FSC Recycled* (FSC C115279).  We'll always need toilet paper, and we'll always need trees - we're here to help with both.   *Minimum 50% post consumer recycled paper   **FSC is not responsible for the environmental savings calculations  2-ply bathroom tissue designed for softness and strength  Made with 100% Recycled Paper*, no added dyes, inks, or fragrances\nSeptic-safeCompatible with low-flow toilets in RVs and campersShipment includes 4-roll pack, 240 sheets per rollCaring today for the next seven generationsMade in United States ©Unilever",
    "productDimensions": "Product in inches (LxWxH): 8.8x 4.4x 8.0",
    "imageUrls": "https://pics.drugstore.com/prodimg/326857/900.jpg",
    "productUPC": "UPC: 73291313732",
    "sourceURL": "https://www.walgreens.com/store/c/seventh-generation-white-toilet-paper-4-pk/ID=prod6146759-product"
  },
  {
    "productBrand": "Charmin",
    "productName": "Ultra Strong Toilet Paper",
    "listPrice": "2/$2500 or 1/$1299",
    "description": "Charmin Ultra Strong toilet paper is woven like a washcloth and just cleans better than the leading bargain brand, so you can be Charmin clean and proud of it. It's 4X stronger* and you can use less versus the leading bargain brand. When you buy Charmin Ultra Strong Super Mega Roll toilet paper, you get our longest lasting roll because one Charmin Super Mega Roll equals 6 Regular Rolls**. We all go to the bathroom, those who go with Charmin Ultra Strong Super Mega Roll toilet paper really Enjoy the Go! (*when wet vs. the leading bargain brand; **Based on number of sheets in Charmin Regular Roll bath tissue).Made in United States ©Procter & Gamble",
    "productDimensions": "Product in inches (LxWxH): 10.83x 5.63x 12.79",
    "imageUrls": "https://pics.drugstore.com/prodimg/630769/900.jpg",
    "productUPC": "UPC: 03700060821",
    "sourceURL": "https://www.walgreens.com/store/c/charmin-ultra-strong-toilet-paper/ID=300409603-product"
  },
  {
    "productBrand": "Kroger",
    "productName": "Bath Tissue",
    "listPrice": "$679",
    "description": "Our 1000 Sheets 1-ply bathroom tissue provides the softness you expect while offering the perfect balance of price and performance. This unique bathroom tissue is a great value-long-lasting roll life provides fewer changes and the tissue is septic safe. Contains no inks, dyes, or perfumes.\nBath Tissue Features:\n\nLong lasting roll\nSeptic safe performanceMade in United States ©Kroger",
    "productDimensions": "Product in inches (LxWxH): 2.98x 13.1x 8.3",
    "imageUrls": "https://pics.drugstore.com/prodimg/633333/900.jpg",
    "productUPC": "UPC: 01111080051",
    "sourceURL": "https://www.walgreens.com/store/c/kroger-bath-tissue/ID=300412167-product"
  },
  {
    "productBrand": "Walgreens",
    "productName": "Super Premium Ultra Soft Bath Tissue",
    "listPrice": "$499",
    "description": "Walgreens Ultra Soft Super Premium Bath Tissue is soft and cushiony for total comfort at a great value. These long-lasting mega sizes rolls are the smart solution to complete your home.\n\nSoft, Comfortable & Absorbent\nUltimate Clean\nSafe for standard septic systems.\nFSC Certified\nEach sheet 4 in x 3.9 in (10.1 cm x 9.9 cm).\n\n123.1 total sq ft (11.4 sq m).\n284 2-ply sheets per roll.\n4 mega = 17 regular rolls.*\nCompare vs Charmin Ultra Soft.T\nRainforest Alliance Certified.\nFSC: Mix - Paper from responsible sources.fsc.org.\nwalgreens.com.how2recycle.info.\n*Based on number of sheets in Charmin Regular Roll.TThis product is not manufactured or distributed by The Procter & Gamble Company, owner of the registered trademark Charmin Ultra Soft.Made in United States(with domestic & imported materials) ",
    "productDimensions": "Product in inches (LxWxH): 5.0x 9.65x 7.95",
    "imageUrls": "https://pics.drugstore.com/prodimg/654214/900.jpg",
    "productUPC": "UPC: 19560202844",
    "sourceURL": "https://www.walgreens.com/store/c/walgreens-super-premium-ultra-soft-bath-tissue/ID=300432593-product"
  },
  {
    "productBrand": "Dollar Shave Club",
    "productName": "One Wipe Charlies, Flushable Wipes Fresh & Tingly Peppermint",
    "listPrice": "$399",
    "description": "Dollar Shave Club's Minty Tingle One Wipe Charlies flushable butt wipes (50ct) are bathroom wipes that are the number 1 way to clean up after number 2. Your butt is a major part of your life, and it deserves the same level of care and service as the rest of you. Plus, there are certain occasions when it makes sense to mop up after you sweep. That's why One Wipe Charlies butt wipes for men have a gentle, peppermint scent and minty tingle to keep things feeling clean and fresh. Made from a flushable cellulose, these disposable wipes are perfect for guys wanting the confidence of knowing they're clean everywhere. And they couldn't be easier to use. Just pull back the label and unfold a wipe, gently wipe the desired area, then flush. Because let's face it, sometimes you really do need to mop up after you sweep in order to give your tush the TLC it deserves. Now pull up your pants and get on with your life with confidence. Want to make sure the rest of your body is taken care of now that you've got your backside situation cleaned up? Be sure to check out our full range of deodorants and body wipes for men.Made in United States None ©Unilever",
    "productDimensions": "Product in inches (LxWxH): 2.0x 5.0x 7.12",
    "imageUrls": "https://pics.drugstore.com/prodimg/652810/900.jpg",
    "productUPC": "UPC: 81134602074",
    "sourceURL": "https://www.walgreens.com/store/c/dollar-shave-club-one-wipe-charlies,-flushable-wipes-fresh-%26-tingly-peppermint/ID=300431196-product"
  },
  {
    "productBrand": "Walgreens",
    "productName": "Super Premium Ultra Strong Bath Tissue",
    "listPrice": "$499",
    "description": "Walgreens Ultra Strong Super Premium Bath Tissue with the right balance of soft sheets with strong and absorbent performance. These long-lasting mega size rolls are the smart solution to complete your home.\n\nUltimate Clean\nSeptic for standard septic systems.\nFSC Certified\nEach sheet 4 in x 3.9 in (10.1 cm x 9.9 cm).\n\n123.9 total sq ft (11.5 sq m).\n286 - 2-ply sheets per roll.\n4 mega = 17 regular rolls.*\nCompare vs Charmin Ultra Strong.T\nRainforest Alliance Certified.\nFSC: Mix - Paper from responsible sources.fsc.org.\nwalgreens.com.how2recycle.info.\n*Based on number of sheets in Charmin Regular Roll.TThis product is not manufactured or distributed by The Procter & Gamble Company, owner of the registered trademark Charmin Ultra Strong.Made in United States(with domestic & imported materials) © 2021 Walgreens Co.",
    "productDimensions": "Product in inches (LxWxH): 5.0x 9.65x 7.95",
    "imageUrls": "https://pics.drugstore.com/prodimg/654215/900.jpg",
    "productUPC": "UPC: 19560202845",
    "sourceURL": "https://www.walgreens.com/store/c/walgreens-super-premium-ultra-strong-bath-tissue/ID=300432594-product"
  },
  {
    "productBrand": "Charmin",
    "productName": "Ultra Soft Toilet Paper, Super Mega Rolls",
    "listPrice": "$1249",
    "description": "Get more irresistible cush for your tush with Charmin Ultra Soft. It's the most gentle toilet paper we've ever made and packed with extra cushiony softness you can see and feel to comfort where you need it most. And each sheet of toilet paper is 2X more absorbent so you can use less (vs. the leading USA 1-ply bargain brand). We made it SUPER MEGA in size, so you get super mega value. That's right, our Charmin Ultra Soft Super Mega Roll is our biggest, longer lasting roll, and equals 6 Regular Rolls (based on number of sheets in Charmin Regular Roll bath tissue)! It's way more bang for your behind AND you'll be running back to the store less and less. Our Charmin Ultra Soft toilet paper is also 2-ply and designed to be clog-safe and septic-safe so you can flush worry-free. We all go, why not Enjoy The Go with Americas favorite toilet paper*.\n*Charmin Brand based on sales. Source: Neilson 2021 dollar sales. Made in United States of America(from domestic and imported materials.) ©Procter & Gamble",
    "productDimensions": "Product in inches (LxWxH): 10.59x 5.51x 11.85",
    "imageUrls": "https://pics.drugstore.com/prodimg/645866/900.jpg",
    "productUPC": "UPC: 03700061790",
    "sourceURL": "https://www.walgreens.com/store/c/charmin-ultra-soft-toilet-paper,-super-mega-rolls/ID=300424322-product"
  },
  {
    "productBrand": "Kroger",
    "productName": "Bath Tissue Long Lasting Roll Package",
    "listPrice": "$379",
    "description": "Our 1000 Sheets 1-ply bathroom tissue provides the softness you expect while offering the perfect balance of price and performance. This unique bathroom tissue is a great value-long-lasting roll life provides fewer changes and the tissue is septic safe. Contains no inks, dyes, or perfumes.\nBath Tissue Features:\n\nLong Lasting Roll\nSeptic Safe PerformanceMade in United States ©Kroger",
    "productDimensions": "Product in inches (LxWxH): 4.77x 8.8x 8.3",
    "imageUrls": "https://pics.drugstore.com/prodimg/633495/900.jpg",
    "productUPC": "UPC: 01111080050",
    "sourceURL": "https://www.walgreens.com/store/c/kroger-bath-tissue-long-lasting-roll-package/ID=300412329-product"
  },
  {
    "productBrand": "Angel Soft",
    "productName": "Bathroom Tissue",
    "listPrice": "$499",
    "description": "Try Our Thickest Angel Soft Toilet Paper Ever!\nDesigned with both softness and strength at a price that you'll love\nLong lasting rolls with 425+ 2-ply sheets per roll\n4 mega rolls = 16 regular rolls\nFlushable and safe for standard septic and sewer systems\nAngel Soft Toilet Paper is certified to the Sustainable Forestry Initiative (SFI) sourcing standards.\nMade in USA ©Angel Soft",
    "productDimensions": "Product in inches (LxWxH): 10.26x 5.13x 7.6",
    "imageUrls": "https://pics.drugstore.com/prodimg/626697/900.jpg",
    "productUPC": "UPC: 03040079299",
    "sourceURL": "https://www.walgreens.com/store/c/angel-soft-bathroom-tissue/ID=300405402-product"
  },
  {
    "productBrand": "Quilted Northern Ultra Plush",
    "productName": "Mega Rolls",
    "listPrice": "$679",
    "description": "\nSilky, smooth, and soft, Quilted Northern Ultra Plush toilet paper offers 3 cushiony and absorbent layers of comfort for the clean feel you expect and the luxurious feel you desire. \nOur patented technology delivers the softness you want while cutting down on what you do not  (lint!). \nQuilted Northern Ultra Plush toilet paper is flushable and septic safe for standard sewer and septic systems. Quilted Northern toilet paper is Sustainable Forestry Initiative (SFI) certified. \nFor more than 100 years, Quilted Northern bathroom tissue has stood for softness, strength, and overall quality and comfort. \nEach roll has 284 premium, 3-ply sheets. \n1 Quilted Northern Ultra Plush Mega Roll = 4 Quilted Northern Ultra Plush Regular Rolls  Made in USA ©Quilted Northern Ultra Plush",
    "productDimensions": "Product in inches (LxWxH): 10.31x 5.1x 11.4",
    "imageUrls": "https://pics.drugstore.com/prodimg/621731/900.jpg",
    "productUPC": "UPC: 04200087444",
    "sourceURL": "https://www.walgreens.com/store/c/quilted-northern-ultra-plush-mega-rolls/ID=300400353-product"
  },
  {
    "productBrand": "Scott",
    "productName": "1000 Toilet Paper, Regular Rolls, 1-Ply",
    "listPrice": "$2099",
    "description": "1000 sheets in every toilet paper roll = America’s longest lasting roll of all national brands.Breaks up four times faster than the average bathroom tissueSewer-safe and septic-safe 1-ply toilet tissueBathroom tissue paper safe for use in RVs and boatsFSC (Forest Stewardship Council) Certified from responsible sources Packaging may vary from image shown \n20 regular rolls of Scott 1000 Toilet Paper-packaging may vary from images shown. \nFor generations, you've trusted Scott-our septic-safe toilet paper uses clog-free technology, lasts longer and dissolves faster* and breaks down 10x faster**. \nAmerica's #1 long lasting brand and you always get 1000 sheets per roll for fewer roll changes. \nFree of perfumes or scents, so no need to worry about allergies or irritation. \nSustainably sourced from responsibly managed forests and manufactured with 100% Wind Powered Manufacturing (US Manufacturing off-setting 100% purchased electricity with power generated at US wind farms)\nScott 1000 Toilet Paper helps you spend time on what matters most with fewer roll changes and more value. With Scott 1000 Toilet Paper, you get 20 regular rolls of 1,000 sheets, so you have plenty of toilet paper for you and your loved ones. Plus, each roll of Scott 1000 bathroom tissue helps you get the job done with 1000 durable 1-layer sheets and lasts longer, dissolves faster* and breaks down 10x faster**. Scott 1000 1-ply toilet paper even dissolves quickly, so it's kinder to your plumbing, sewer-safe and septic-safe. We've been trusted for generations: Scott bathroom tissue is sustainably sourced from responsibly managed forests, features recyclable packaging and is a 100% biodegradable tissue. Keep life rolling by ordering Scott 1000 in bulk online! *vs the leading brand mega roll **vs the leading brand one plyMade in United States ©Kimberly-Clark Corporation",
    "productDimensions": "Product in inches (LxWxH): 9.3x 23.25x 8.2",
    "imageUrls": "https://pics.drugstore.com/prodimg/527055/900.jpg",
    "productUPC": "UPC: 05400015029",
    "sourceURL": "https://www.walgreens.com/store/c/scott-1000-toilet-paper,-regular-rolls,-1-ply/ID=prod6253223-product"
  }
]