[
  {
    "productBrand": "Nature's Bounty",
    "productName": "Calcium 1200 mg Plus Vitamin D3 Dietary Supplement Softgels Twinpack",
    "listPrice": "$1999",
    "description": "Promotes bone healthAlso promotes immune system healthVitamin D3 assists in calcium absorptionDietary SupplementTwin PackLiquid Filled | Absorbable1200mg Calcium Per ServingPromotes bone health* May reduce the risk of Osteoporosis*Rapid Release Liquid SoftgelCalcium is the primary mineral responsible for strong bones and may reduce the risk of osteoporosis.** Vitamin D3 assists in Calcium absorption and also promotes immune system health, breast health, and colon health.*No artificial flavor or sweetener; no preservatives, no sugar, no starch, no milk, no lactose, no gluten, no wheat, no yeast, no fish. Sodium free.*These statements have not been evaluated by the Food & Drug Administration.  This product is not intended to diagnose, treat, cure, or prevent any disease.**Adequate calcium throughout life, as a part of a well-balanced diet, may reduce the risk of osteoporosis. For adults, take two (2) softgels daily, preferably with meals. © 2011 Nature's Bounty, Inc.",
    "productDimensions": "Product in inches (LxWxH): 2.85x 5.65x 5.35",
    "imageUrls": "https://pics.drugstore.com/prodimg/446763/900.jpg",
    "productUPC": "UPC: 07431219961",
    "sourceURL": "https://www.walgreens.com/store/c/nature's-bounty-calcium-1200-mg-plus-vitamin-d3-dietary-supplement-softgels-twinpack/ID=prod6063871-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Vitamin D3 1000 IU (25 mcg) Softgels",
    "listPrice": "$1299",
    "description": "The body's preferred form of vitamin DFor teeth, bone, and immune healthNo artificial colors or flavorsSay hello to an easy and effective Vitamin D supplement to support muscle, bone, teeth, and immune health. While sunshine is a great source of Vitamin D, many people aren't making enough of this essential nutrient from the sun. Vitamin D can be found in food as well in two different forms (known as Vitamin D2 and Vitamin D3), however, Vitamin D3 is more effective at raising and maintaining adequate levels of Vitamin D throughout the body. Vitamin D is a common nutrient shortfall. In fact, 95% of the US population does not get enough Vitamin D from food alone, making supplementation that much more important.(1) Support your sunshine and Vitamin D dietary needs today, with Nature Made's Vitamin D 1000 IU (25 mcg) softgels. (1)NHANES 2005-2016 Nutrients 2020, 12, 1735. (2)Based on a survey of pharmacists who recommend branded vitamin and supplements\n\nVITAMIN D3 IS ESSENTIAL TO A HEALTHY IMMUNE RESPONSE & MORE: Vitamin D is an essential nutrient that helps support a healthy immune response, aids in calcium absorption to support strong bones and teeth and supports muscle function.\nTHE BODY'S PREFERRED FORM OF VITAMIN D: Vitamin D3 is more effective than Vitamin D2 at raising and maintaining adequate Vitamin D levels throughout the body.\nAdults take 1 softgel daily with water and a meal.\nHIGH QUALITY INGREDIENTS: Made from carefully selected ingredients under strict manufacturing practices and guaranteed to meet our high quality standards. No color added. No artificial flavors. Gluten free.\n#1 PHARMACIST RECOMMENDED VITAMIN & SUPPLEMENT BRAND(2): Nature Made is the #1 pharmacist recommended vitamin and supplement brand.\nThese statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Made in USA Adults, take 1 softgel daily with water and a meal. Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.44x 2.44x 4.38",
    "imageUrls": "https://pics.drugstore.com/prodimg/344274/900.jpg",
    "productUPC": "UPC: 03160402676",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-vitamin-d3-1000-iu-(25-mcg)-softgels/ID=prod6063885-product"
  },
  {
    "productBrand": "Emergen-C",
    "productName": "Daily Immune Support Drink with 1000 mg Vitamin C Super Orange",
    "listPrice": "$1099",
    "description": "Increases metabolic functionVitamin C & antioxidants boost healthB vitamins for natural energy & no crash\nIncludes 30 individual serving-size packets (0.32 oz. each) of Emergen-C Super Orange flavor fizzy drink mix   \nEach serving delivers 1,000 mg of Vitamin C - more than 10 oranges (1)   \nDaily dietary supplement is made with natural flavors and contains no artificial sweeteners   \nHelps support the immune system with Vitamin C and other antioxidants (2) with B Vitamins and electrolytes*   \nVitamin drink mix is a powder that dissolves quickly in water; it's fizzy, refreshing and caffeine-free \nWhy settle for a good day when you can have a super one? Emergen-C Vitamin C drink mix is a great way to help support your immune system with Vitamin C as part of your daily wellness routine. Emergen-C dietary supplement provides 1,000 mg of Vitamin C - more than 10 oranges (1) - and is packed with B Vitamins and other antioxidants (2) for immune system support, plus electrolytes to help replace any that are lost during your daily workout*. Emergen-C vitamin drink mixes are made with natural, real fruit flavors, plus they have no artificial sweeteners and are caffeine free. Just add to 4 to 6 ounces of water for a fizzy, citrus-y boost of goodness. With more than 20 tasty flavors plus a variety of special formulas, Emergen-C dietary supplements make it deliciously easy to support your wellness goals. Transform your day, every day, with Emergen-C. \n(1) Based on using the USDA.gov nutrient database value for a large, raw orange\n(2) Antioxidants include Vitamin C, Zinc and ManganeseMade in United States Ages 14 and up, one (1) packet daily. Empty contents into a glass, add 4-6 oz. of water, stir. For lighter flavor, mix with more water. Do not exceed suggested use. If you are pregnant, nursing, or taking medication, consult your doctor before use. Store at room temperature. Protect from moisture. ©© Alacer Corp.",
    "productDimensions": "Product in inches (LxWxH): 3.9x 5.5x 3.9",
    "imageUrls": "https://pics.drugstore.com/prodimg/222871/900.jpg",
    "productUPC": "UPC: 07631430203",
    "sourceURL": "https://www.walgreens.com/store/c/emergen-c-daily-immune-support-drink-with-1000-mg-vitamin-c-super-orange/ID=300397159-product?skuId=sku6000246"
  },
  {
    "productBrand": "Nature's Bounty",
    "productName": "Ultra Strength Probiotic 10",
    "listPrice": "$1999",
    "description": "Having a healthy immune system starts with a healthy gut. Backed by 20 years of clinical research, Nature’s Bounty Ultra Strength Probiotic 10 is now in a one per day formula with 20 billion live probiotic cultures. It contains 10 distinct probiotic strains to supplement the natural diversity of your digestive ecosystem. The GI microbiome is active in the digestion of food and absorption of nutrients and also supports tissues lining the immune system. The unique strains in Probiotic 10 help the body’s natural digestive process, contribute to immune health and even upper respiratory function. Nature’s Bounty Ultra Strength Probiotic 10 one-a-day probiotic for adults provides its health benefits at 20 billion CFU per day and is guaranteed through expiration. Whether you’re vegetarian or on a gluten-free diet, our probiotic is made for you. When wellness is everything, the vitamin experts at Nature’s Bounty have everything you need to get there.Made in United States For adults, take one (1) capsule daily, preferably with a meal. ",
    "productDimensions": "Product in inches (LxWxH): 3.0x 2.38x 3.31",
    "imageUrls": "https://pics.drugstore.com/prodimg/632671/900.jpg",
    "productUPC": "UPC: 07431200812",
    "sourceURL": "https://www.walgreens.com/store/c/nature's-bounty-ultra-strength-probiotic-10/ID=300411501-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Vitamin D3 2000 IU (50 mcg) Softgels",
    "listPrice": "$1299",
    "description": "Helps the body absorb calciumHas beneficial effect on healthy bonesAids in breast & colon healthSay hello to an easy and effective Vitamin D supplement to support muscle, bone, teeth, and immune health. While sunshine is a great source of Vitamin D, many people aren't making enough of this essential nutrient from the sun. Vitamin D can be found in food as well in two different forms (known as Vitamin D2 and Vitamin D3), however, Vitamin D3 is more effective at raising and maintaining adequate levels of Vitamin D throughout the body. Vitamin D is a common nutrient shortfall. In fact, 95% of the US population does not get enough Vitamin D from food alone, making supplementation that much more important.(1) Support your sunshine and Vitamin D dietary needs today, with Nature Mades Vitamin D 2000 IU (50 mcg) softgels. (1)NHANES 2005-2016 Nutrients 2020, 12, 1735. (2)Based on a survey of pharmacists who recommend branded vitamin and supplements\n\nVITAMIN D3 IS ESSENTIAL TO A HEALTHY IMMUNE RESPONSE & MORE: Vitamin D is an essential nutrient that helps support a healthy immune response, aids in calcium absorption to support strong bones and teeth and supports muscle function.\nTHE BODY'S PREFERRED FORM OF VITAMIN D: Vitamin D3 is more effective than Vitamin D2 at raising and maintaining adequate Vitamin D levels throughout the body.\nAdults take 1 softgel daily with water and a meal.\nHIGH QUALITY INGREDIENTS: Made from carefully selected ingredients under strict manufacturing practices and guaranteed to meet our high quality standards. No color added. No artificial flavors. Gluten free.\n#1 PHARMACIST RECOMMENDED VITAMIN & SUPPLEMENT BRAND(2): Nature Made is the #1 pharmacist recommended vitamin and supplement brand.\nThese statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Made in USA(with globally sourced ingredients) 100% satisfaction guaranteed Adults, take 1 softgel daily with water and a meal. Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.0x 2.0x 4.25",
    "imageUrls": "https://pics.drugstore.com/prodimg/226753/900.jpg",
    "productUPC": "UPC: 03160402585",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-vitamin-d3-2000-iu-(50-mcg)-softgels/ID=prod6063886-product"
  },
  {
    "productBrand": "Nature's Bounty",
    "productName": "Zinc 50 mg Caplets",
    "listPrice": "$679",
    "description": "Promotes immune system healthEssential for cell division & growthAssists in the formation of DNADietary SupplementPromotes Immune System Health*ChelatedZinc is essential for cell division and growth and assists in the formation of DNA, the cell's genetic material.*  Zinc is also important for supporting carbohydrate, protein, fat and energy metabolism, and for promoting immune system health.*No Artificial Flavors or Sweetener, No Preservatives, No Sugar, No Starch, No milk, No Lactose, No Gluten, No Wheat, No Yeast.*These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease. For adults, take one (1) caplet daily, preferably with a meal. ©2016 Nature's Bounty, Inc.",
    "productDimensions": "Product in inches (LxWxH): 1.98x 1.98x 4.29",
    "imageUrls": "https://pics.drugstore.com/prodimg/17690/900.jpg",
    "productUPC": "UPC: 07431202060",
    "sourceURL": "https://www.walgreens.com/store/c/nature's-bounty-zinc-50-mg-caplets/ID=prod6144791-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Vitamin D3 2000 IU (50 mcg) Tablets",
    "listPrice": "$2296",
    "description": "The body's preferred form of vitamin DSupports teeth, bone & musclesPromotes immune healthNature Made Vitamin D3 2000 IU Tablets (50 mcg) offer an easy way to add Vitamin D supplements to your daily routine to support bone, teeth and muscle health. Sourced from high quality ingredients, these Nature Made Vitamin D tablets are gluten free dietary supplements with no color added and no artificial flavors. Each Vitamin D3 2000 IU tablet supports a healthy immune response and aids in calcium absorption. Vitamin D is a common nutrient shortfall. D3 vitamin is the body's preferred form of Vitamin D to help maintain Vit D levels. These Nature Made Vitamin D3 supplements contain 50mcg (2000 IU) of Vit D3 per serving. Adults, take one Vitamin D3 Nature Made tablet daily with water and a meal. This Nature Made Vitamin D supplement is quality you can trust. USP has tested and verified ingredients, potency and manufacturing process. USP sets official standards for dietary supplements. Visit the USP verified website for more information. \n\nImmune, muscle, teeth and bone health support supplement: contains one 400 count bottle of Nature Made Vitamin D3 2000 IU (50 mcg) Tablets for a 400-day supply\nNature Made Vitamin D 2000 IU tablets support bone health, teeth health, muscle health, and provide immune support\nThese Vitamin D 2000IU tablets help improve calcium absorption and contain 50mcg of Vitamin D 3, the body's preferred form of Vitamin D\nSourced from high-quality ingredients, this Nature Made Vitamin D3 supplement is gluten free and has no color added and no artificial flavors\nUnited States Pharmacopeia (USP) Verified, #1 Pharmacist Recommended Vitamin & Supplement Brand*\nThese statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.\n*Based on a survey of pharmacists who recommend branded vitamins and supplements.Made in USA(with globally sourced ingredients) Adults, take 1 tablet daily with water and a meal. Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.63x 2.63x 5.13",
    "imageUrls": "https://pics.drugstore.com/prodimg/406340/900.jpg",
    "productUPC": "UPC: 03160402818",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-vitamin-d3-2000-iu-(50-mcg)-tablets/ID=prod6148394-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Vitamin C Gummies 250 mg Tangerine",
    "listPrice": "$1999",
    "description": "Helps support immune systemGreat tasting way to take your vitaminsAll natural flavorsNature Made Vitamin C 250 mg per serving gummies are Vitamin C supplements that help support immune health, provide antioxidant support, and aid in iron absorption. Sourced from high-quality ingredients, these delicious tangerine-flavored Vitamin C gummies for adults are dietary supplements that are made with pectin and have no artificial flavors, no synthetic dyes, no high fructose corn syrup, no artificial sweeteners, and are gluten free. Vitamin C is an antioxidant that helps support your immune system and is needed for collagen synthesis to support overall skin health. If you are not receiving enough Vitamin C from your daily diet or taking a Vitamin C supplement, then a Nature Made Vitamin C 250mg per serving antioxidant supplement can help. Nature Made's gummy Vitamin C for adults offers a delicious way to take your Vitamin C if you don't prefer tablets or softgels. Nature Made supplements are quality you can trust.\n\nImmune support supplement: contains one 150 count bottle of Nature Made Vitamin C 250 mg per serving Gummies for a 75-day supply\nNature Made Vitamin C 250mg gummy vitamins support immune health and offer antioxidant support\nThis 250 mg Vitamin C per serving immune system supplement provides Vitamin C, which is also necessary for the body to produce collagen to help support healthy skin\nAdults chew two tasty tangerine-flavored Nature Made Vitamin C gummies daily\n#1 Pharmacist Recommended Vitamin & Supplement Brand*\n*Based on a survey of pharmacists who recommend branded vitamins and supplements.\nThese statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Product of Spain and USA We're so sure you'll love the taste, we guarantee it. For more information on our Love Them or They're Free guarantee, visit naturemade.com/gummyguarantee. Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 3.25x 3.25x 6.25",
    "imageUrls": "https://pics.drugstore.com/prodimg/558265/900.jpg",
    "productUPC": "UPC: 03160402803",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-vitamin-c-gummies-250-mg-tangerine/ID=prod6294357-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Extra Strength Vitamin C 1000 mg Tablets",
    "listPrice": "$1899",
    "description": "Helps support the immune systemHelps neutralize free radicalsSupports iron absorption in the bodyNature Made Extra Strength Vitamin C 1000 mg is a dietary supplement that supports immune health, provides antioxidant support, and aids in iron absorption. Sourced from high-quality ingredients, these gluten free Vitamin C 1000mg tablets are antioxidant supplements that have no color added, no artificial flavors, and no added preservatives. Vitamin C is an antioxidant that helps support your immune system and is also needed for collagen synthesis to support overall skin health. If you are not receiving enough Vitamin C from your daily diet or taking a Vitamin C supplement, then these Nature Made 1000 mg Vitamin C tablets can help. Adults take one 1000mg Vitamin C tablet daily with water and a meal. Nature Made supplements are quality you can trust. USP has tested and verified ingredients, potency, and manufacturing process. USP sets official standards for dietary supplements. Visit the USP verified website for more information.\n\nImmune support supplement: contains one 100 count bottle of Nature Made Vitamin C 1000 mg Extra Strength Tablets for a 100-day supply\nThese Nature Made Vitamin C 1000mg tablets are Vitamin C supplements that help support immune health and provide antioxidant support\nVitamin C is necessary for the body to produce collagen, which helps support healthy skin\nAdults take one of these 1000mg Vitamin C tablets daily with water and a meal\nThis Vitamin C for adults antioxidant supplement has no color added, no artificial flavors, no added preservatives and is gluten free\nUnited States Pharmacopeia (USP) Verified, #1 Pharmacist Recommended Vitamin & Supplement Brand*\n\n*Based on a survey of pharmacists who recommend branded vitamins and supplements.These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Made in United States(with globally sourced ingredients) USP has tested and verified ingredients, potency and manufacturing process. USP sets official standards for dietary supplements. www.uspverified.org Adults, take 1 tablet daily with water and a meal. Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.44x 2.44x 4.44",
    "imageUrls": "https://pics.drugstore.com/prodimg/17761/900.jpg",
    "productUPC": "UPC: 03160401489",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-extra-strength-vitamin-c-1000-mg-tablets/ID=prod3540-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Vitamin C 500 Mg Tablets",
    "listPrice": "$1099",
    "description": "Helps boost the immune systemNeutralizes free radicalsAlso helps iron get absorbed in the bodyNature Made Vitamin C 500 mg is a dietary supplement that supports immune health, provides antioxidant support, and aids in iron absorption. Sourced from high-quality ingredients, this gluten free Vitamin C for adults antioxidant supplement has no color added, no artificial flavors, and no added preservatives. Vitamin C is not only an antioxidant that helps support your immune system, but it is also needed for collagen synthesis to support overall skin health. If you are not receiving enough Vitamin C from your daily diet, then this 500 mg Vitamin C supplement can help. Nature Made supplements are quality you can trust. *Based on a survey of pharmacists who recommend branded vitamins and supplements.\n\nImmune support supplement: contains one 100 count bottle of Nature Made Vitamin C 500 mg Tablets for a 100-day supply\nThese Vitamin C 500 mg tablets are Vitamin C supplements that support immune health and offer antioxidant support\nVitamin C is necessary for the body to produce collagen, which helps support healthy skin\nAdults take one of these Nature Made Vitamin C 500 mg tablets daily with water and a meal\nThese Nature Made Vitamin C tablets 500 mg are gluten free antioxidant supplements that have no color added, no artificial flavors, and no added preservatives\n#1 Pharmacist Recommended Vitamin & Supplement Brand*\n\nThese statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Made in United States(with globally sourced ingredients) Adults, take 1 caplet daily with water and a meal. Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.06x 2.06x 3.56",
    "imageUrls": "https://pics.drugstore.com/prodimg/17763/900.jpg",
    "productUPC": "UPC: 03160401485",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-vitamin-c-500-mg-tablets/ID=prod3511-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Zinc 30 mg Tablets",
    "listPrice": "$649",
    "description": "Supports the immune systemVital for normal growth & developmentNo artificial flavors or preservativesNature Made Zinc 30 mg Tablets are a dietary supplement that supports the body's natural immune defense system. Sourced from high-quality ingredients, this gluten free Nature Made Zinc supplement contains no color added, no artificial flavors and no preservatives. Zinc is an essential nutrient and antioxidant support that plays a role in numerous reactions in the body. This Nature Made Zinc 30 mg supplement supports a healthy immune system and helps support healthy skin. Adults take one of these 30 mg Zinc tablets daily with water and a meal. Nature Made supplements are quality you can trust. USP has tested and verified ingredients, potency and manufacturing process. USP sets official standards for dietary supplements. Visit the USP verified website for more information. *Based on a survey of pharmacists who recommend branded vitamins and supplements.\n\nImmune health and antioxidant support supplement: contains one 100 count bottle of Nature Made Zinc 30 mg Tablets for a 100-day supply\nThis Zinc 30 mg supplement supports the body's natural immune defense system\nThese Zinc supplement tablets provide an essential nutrient and antioxidant support\nAdults take one of these Zinc tablets daily with water and a meal\nThese gluten free Zinc supplements have no color added, no artificial flavors and no preservatives\nUnited States Pharmacopeia (USP) Verified, #1 Pharmacist Recommended Vitamin & Supplement Brand**These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Made in USA(with globally sourced ingredients) Adults, take 1 tablet daily with water and a meal. Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 1.75x 1.75x 4.25",
    "imageUrls": "https://pics.drugstore.com/prodimg/17783/900.jpg",
    "productUPC": "UPC: 03160401277",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-zinc-30-mg-tablets/ID=prod3533-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Extra Strength Vitamin D3 5000 IU (125 mcg) Softgels",
    "listPrice": "$2599",
    "description": "Supports teeth, bone, immune healthPharmacist recommendedNo artificial colors or flavorsNature Made Extra Strength Vitamin D3 5000 IU Softgels (125 mcg) offer an easy way to add Vitamin D supplements to your daily routine to support bone, teeth, muscle, and immune health. Sourced from high quality ingredients, these Nature Made Vitamin D softgels are gluten free dietary supplements with no color added and no artificial flavors. Each Vitamin D3 5000IU (125 mcg) softgel supports a healthy immune response and aids in calcium absorption. Vitamin D is a common nutrient shortfall. D3 vitamin is the body's preferred form of Vitamin D to help maintain Vit D levels. These extra strength Nature Made Vitamin D3 supplements are are for those with higher Vitamin D needs and/or deficiency, as determined by a healthcare professional (1). Adults, take one D3 Vitamin 5000 IU softgel daily with water and a meal. This Nature Made Vitamin D supplement is quality you can trust. USP has tested and verified ingredients, potency and manufacturing process. USP sets official standards for dietary supplements. Visit the USP verified website for more information. (1)Approximately 29% of the U.S. adults are Vitamin D deficient (<50 nmol/L)\n\nImmune, muscle, teeth and bone health support supplement: contains one 90 count bottle of Nature Made Extra Strength Vitamin D3 5000 IU (125 mcg) Softgels for a 90-day supply\nNature Made Vitamin D 5000 IU softgels help improve calcium absorption, support bone health, teeth health, muscle health, and provide immune support\nAdults, take one Vitamin D3 Nature Made softgel daily with water and a meal\nSourced from high-quality ingredients, this Nature Made Vit D3 supplement is gluten free and has no color added and no artificial flavors\nUnited States Pharmacopeia (USP) Verified, #1 Pharmacist Recommended Vitamin & Supplement Brand*\nThese statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.\n*Based on a survey of pharmacists who recommend branded vitamins and supplements.Made in United States(with globally sourced ingredients) This is a high dose vitamin D product for those with higher vitamin D needs and/or deficiency, as determined by a healthcare professional. Consult with your healthcare professional before use. Take one softgel daily with a meal. For easier swallowing, take with water before and during ingestion. Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.0x 2.0x 4.25",
    "imageUrls": "https://pics.drugstore.com/prodimg/253583/900.jpg",
    "productUPC": "UPC: 03160402621",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-extra-strength-vitamin-d3-5000-iu-(125-mcg)-softgels/ID=prod6031044-product"
  },
  {
    "productBrand": "Emergen-C",
    "productName": "Daily Immune Support Drink with 1000 mg Vitamin C, Antioxidants, & B Vitamins Raspberry",
    "listPrice": "$1099",
    "description": "Increases metabolic functionVitamin C & antioxidants boost healthB vitamins for natural energy & no crash\nIncludes 30 individual serving-size packets (0.32 oz. each) of Emergen-C Raspberry flavor fizzy drink mix    \nEach serving delivers 1,000 mg of Vitamin C - more than 10 oranges (1)    \nDaily dietary supplement is made with natural flavors and contains no artificial sweeteners    \nHelps support the immune system with Vitamin C and other antioxidants (2) with B Vitamins and electrolytes*    \nVitamin drink mix is a powder that dissolves quickly in water; it's fizzy, refreshing and caffeine-free \nWhy settle for a good day when you can have a super one? Emergen-C Vitamin C drink mix is a great way to help support your immune system with Vitamin C as part of your daily wellness routine. Emergen-C dietary supplement provides 1,000 mg of Vitamin C - more than 10 oranges (1) - and is packed with B Vitamins and other antioxidants (2) for immune system support, plus electrolytes to help replace any that are lost during your daily workout*. Emergen-C vitamin drink mixes are made with natural, real fruit flavors, plus they have no artificial sweeteners and are caffeine free. Just add to 4 to 6 ounces of water for a fizzy, citrus-y boost of goodness. With more than 20 tasty flavors plus a variety of special formulas, Emergen-C dietary supplements make it deliciously easy to support your wellness goals. Transform your day, every day, with Emergen-C. \n(1) Based on using the USDA.gov nutrient database value for a large, raw orange\n(2) Antioxidants include Vitamin C, Zinc and Manganese\n(3) Emergen-Zzzz is a dietary supplement for occasional sleeplessness* \nThese statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Made in UNITED STATES Ages 14 and up, one (1) packet daily. Empty contents into a glass, add 4-6 oz. of water, stir. For lighter flavor, mix with more water. Do not exceed suggested use. If you are pregnant, nursing, or taking medication, consult your doctor before use. Store at room temperature. Protect from moisture. ©© Pfizer Consumer Healthcare",
    "productDimensions": "Product in inches (LxWxH): 3.9x 5.5x 3.9",
    "imageUrls": "https://pics.drugstore.com/prodimg/222870/900.jpg",
    "productUPC": "UPC: 07631430201",
    "sourceURL": "https://www.walgreens.com/store/c/emergen-c-daily-immune-support-drink-with-1000-mg-vitamin-c,-antioxidants,-%26-b-vitamins-raspberry/ID=prod6397505-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Super C with Vitamin D3 and Zinc Tablets",
    "listPrice": "$1799",
    "description": "Nature Made Super C with Vitamin D3 & Zinc is a dietary supplement that supports immune health and offers antioxidant support. Sourced from high-quality ingredients, this Nature Made Super C Vitamin C with Zinc and D3 supplement has no artificial flavors. This Nature Made Vitamin C supplement is an excellent source of five key immune system support nutrients. Each Super C vitamin with Zinc and D3 tablet contains 900 mg of Vitamin C, 450 mcg of Vitamin A, 25 mcg of Vitamin D, 15 mg of Vitamin E, and 11 mg of Zinc to lend your immune system a helping hand. This Vitamin C and Zinc supplement is perfect for anyone looking to supplement their diet, especially if it is low in fruits and vegetables. Nature Made supplements are quality you can trust. USP has tested and verified ingredients, potency, and manufacturing process. USP sets official standards for dietary supplements. Visit the USP verified website for more information.\n\nImmune support supplement: contains one 60 count bottle of Nature Made Super C with Vitamin D3 and Zinc Tablets for a 60-day supply\nThis Vitamin C supplement supports immune health and offers antioxidant support\nThese Vitamin C supplements are an excellent source of five key immune support nutrients\nAdults, take one Nature Made Super C tablet daily with water and a meal\nMade in the USA with quality global ingredients, United States Pharmacopeia (USP) Verified, #1 Pharmacist Recommended Vitamin & Supplement Brand*\n*Based on a survey of pharmacists who recommend branded vitamins and supplements.\nThese statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Made in U.S.A. Adults, take 1 tablet daily with water and a meal. Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.0x 2.0x 4.25",
    "imageUrls": "https://pics.drugstore.com/prodimg/615039/900.jpg",
    "productUPC": "UPC: 03160403012",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-super-c-with-vitamin-d3-and-zinc-tablets/ID=400393910-product"
  },
  {
    "productBrand": "Emergen-C",
    "productName": "Enhanced Immune Support Drink Mix with 1000 mg Vitamin C, Vitamin D & Zinc, Super Orange",
    "listPrice": "$1199",
    "description": "\nIncludes 30 individual serving-size packets (0.32 oz. each) of Emergen-C Immune+ Super Orange flavor powder drink mix      \nEnhanced immune support formula delivers 1,000 IU (25 mcg) Vitamin D plus 1,000 mg Vitamin C*      \nImmune supplement is packed with key nutrients and antioxidants; it also has a proprietary complex with beta-glucans and arabinogalactans      \nDaily dietary supplement is made with natural flavors and contains no artificial sweeteners      \nVitamin drink mix dissolves quickly in water; it's fizzy, refreshing and caffeine-free\n\nMade in United States Ages 14 and up, one (1) packet daily. Empty contents into a glass, add 4-6 oz of water, stir. For lighter flavor, mix with more water.  ©Alacer Corp",
    "productDimensions": "Product in inches (LxWxH): 2.63x 5.38x 3.88",
    "imageUrls": "https://pics.drugstore.com/prodimg/532423/900.jpg",
    "productUPC": "UPC: 88589800042",
    "sourceURL": "https://www.walgreens.com/store/c/emergen-c-enhanced-immune-support-drink-mix-with-1000-mg-vitamin-c,-vitamin-d-%26-zinc/ID=prod6408750-product"
  },
  {
    "productBrand": "Walgreens",
    "productName": "Vitamin D3 5000 IU Softgels",
    "listPrice": "$1499",
    "description": "\nVitamin D3 125 mcg (5000 IU)\nMay support immune health**\nMay promote calcium absorption**\nMay support bone health**  \nVitamin D is an essential nutrient that may work with Calcium to support healthy bones and teeth.**\nThis high-potency Vitamin D supplement may assist in maintaining a healthy immune system.**  \nNO ARTIFICIAL COLORS OR FLAVORS, NO SUGAR, NO GLUTEN, NO LACTOSE, NO MILK OR MILK DERIVATIVES, NO WHEAT, NO YEAST, NO SODIUM (LESS THAN 5 MG PER SERVING).  Made in USA ©2021 Walgreen Co",
    "productDimensions": "Product in inches (LxWxH): 1.89x 1.89x 3.36",
    "imageUrls": "https://pics.drugstore.com/prodimg/647561/900.jpg",
    "productUPC": "UPC: 31191702191",
    "sourceURL": "https://www.walgreens.com/store/c/walgreens-vitamin-d3-5000-iu-softgels/ID=300425969-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Extra Strength Vitamin D3 5000 IU (125 mcg) per serving Gummies Strawberry, Peach, Mango",
    "listPrice": "$1999",
    "description": "Nature Made Extra Strength Vitamin D3 5000 IU Gummies (125 mcg) per serving offer an easy way to add Vitamin D supplements to your daily routine to support bone, teeth, muscle, and immune health. Sourced from high quality ingredients, these Nature Made Vitamin D gummies for adults are gluten free dietary supplements with no synthetic dyes-colors derived from natural sources, no high fructose corn syrup, and no artificial sweeteners. These Vitamin D3 5000 IU per serving gummy vitamins support a healthy immune response and aid in calcium absorption. Vitamin D is a common nutrient shortfall. D3 vitamin is the body's preferred form of Vitamin D to help maintain Vit D levels. Featuring strawberry, peach, and mango with other natural flavors, these Extra Strength Nature Made Vitamin D3 supplements contain 125 mcg (5000 IU) of Vit D3 per serving and are for those with higher Vitamin D needs and/or deficiency, as determined by a healthcare professional (1). Adults, chew two Vitamin D3 Nature Made gummies daily. This Nature Made Vitamin D supplement is quality you can trust. (1)Approximately 29% of U.S. adults are Vitamin D deficient (<50 nmol/L)\n\nImmune, muscle, teeth and bone health support supplement: contains one 80 count bottle of Nature Made Extra Strength Vitamin D3 5000 IU (125 mcg) per serving Gummies for a 40-day supply\nNature Made Extra Strength Vitamin D 5000 IU per two gummies supports bone health, teeth health, muscle health, and provides immune support\nThis high dose Vitamin D 3 product is for those with higher Vitamin D needs and/or deficiency, as determined by a healthcare professional (1)\nDelicious strawberry, peach and mango flavors with other natural flavors; Adults, chew two Nature Made Vitamin D3 gummies daily\nThis Nature Made Vitamin D3 supplement is gluten free and contains no synthetic dyes, no high fructose corn syrup, and no artificial sweeteners\n#1 Pharmacist Recommended Vitamin & Supplement Brand*\nThese statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.\n*Based on a survey of pharmacists who recommend branded vitamins and supplements.Made in Product of Spain. Packaged and quality tested in the USA. This is a high dose vitamin D product for those with higher vitamin D needs and/or deficiency, as determined by a healthcare professional. Consult your healthcare professional before use. Adults, chew 2 gummies daily. Store tightly closed, in a cool, dry place, out of reach of children. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.72x 2.72x 5.0",
    "imageUrls": "https://pics.drugstore.com/prodimg/620716/900.jpg",
    "productUPC": "UPC: 03160403192",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-extra-strength-vitamin-d3-5000-iu-(125-mcg)-per-serving-gummies-strawberry,-peach,-mango/ID=300399377-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Vitamin C 500 mg Softgels",
    "listPrice": "$1399",
    "description": "Helps maintain immune healthFormulated for easy absorptionMade without yeast, starch & glutenNature Made Vitamin C 500 mg is a dietary supplement that supports immune health, provides antioxidant support, and aids in iron absorption. Sourced from high-quality ingredients, these gluten free 500mg Vitamin C supplements contain no synthetic dyes, no artificial flavors, and no added preservatives. Vitamin C is not only an antioxidant that helps support your immune system, but it is also needed for collagen synthesis to support overall skin health. If you are not receiving enough Vitamin C from your daily diet, then these Nature Made Vitamin C 500mg softgels can help. Nature Made supplements are quality you can trust. USP has tested and verified ingredients, potency, and manufacturing process. USP sets official standards for dietary supplements. Visit the USP verified website for more information.\n\nImmune support supplement: contains one 60 count bottle of Nature Made Vitamin C 500 mg Softgels for a 60-day supply\nThis Vitamin C supplement supports immune health and offers antioxidant support\nVitamin C is necessary for the body to produce collagen, which helps support healthy skin\nAdults take one 500 mg Vitamin C softgel daily with water and a meal\nThis Vitamin C for adults antioxidant supplement contains no synthetic dyes, no artificial flavors, no added preservatives, and is gluten free\nUnited States Pharmacopeia (USP) Verified, #1 Pharmacist Recommended Vitamin & Supplement Brand*\n*Based on a survey of pharmacists who recommend branded vitamins and supplements.\nThese statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Made in United States(with globally sourced ingredients) Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.44x 2.44x 4.38",
    "imageUrls": "https://pics.drugstore.com/prodimg/204231/900.jpg",
    "productUPC": "UPC: 03160402509",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-vitamin-c-500-mg-softgels/ID=prod3935724-product"
  },
  {
    "productBrand": "Nature's Bounty",
    "productName": "Calcium Magnesium Zinc, Tablets",
    "listPrice": "$419",
    "description": "Promotes bone healthMay reduce the risk of osteoporosisFor muscle contractions & nerve impulses(Product received may temporarily differ from image shown due to packaging update. Image will be revised, shortly)\nDietary Supplement\nPromotes Bone Health*\nMay reduce the Risk of Osteoporosis**\n\nWith Over 100% DV of Vitamin D3 \nCoated For Easy Swallowing\nCalcium is the primary mineral responsible for strong bones and Magnesium plays an essential role in proper bone mineralization.*  Calcium and Magnesium are also involved in the muscle contraction and nerve impulses.* Zinc is involved in the synthesis of collagen in bone tissue while Vitamin D3 helps your body absorb Calcium from the diet.*  Because the body cannot produce these nutrients, a balanced diet, regular exercise, healthy lifestyle choices and adequate intake of Calcium, Magnesium, Zinc and Vitamin D can play a role in maintaining bone health.*\n**Adequate Calcium and Vitamin D throughout life, as part of a well balanced diet, may reduce the risk of osteoporosis.\nNo Artificial Color, Flavors or Sweetener, No Preservatives, No Sugar, No Starch, No Milk, No Lactose, No Gluten, No Wheat, No Yeast, No Fish. \n*These statements have not been evaluated by the Food and Drug Administration.  This product is not intended to diagnose, treat, cure or prevent any disease. For adults, take one (1) to three (3) caplets daily, preferably with a meal. © 2016 Nature's Bounty, Inc.1-800-433-2990 Mon.-Sat. 9 AM - 7 PM ET.",
    "productDimensions": "Product in inches (LxWxH): 1.98x 1.98x 4.23",
    "imageUrls": "https://pics.drugstore.com/prodimg/17587/900.jpg",
    "productUPC": "UPC: 07431204290",
    "sourceURL": "https://www.walgreens.com/store/c/nature's-bounty-calcium-magnesium-zinc,-tablets/ID=prod6144738-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Calcium 600 Mg With Vitamin D3 Tablets",
    "listPrice": "$1699",
    "description": "Helps build strong bonesWith vitamin D 400 IUImproves calcium absorptionNature Made Calcium 600 mg with Vitamin D3 Tablets are Calcium supplements formulated to help support bone strength. Sourced from high quality ingredients, these gluten free Nature Made Calcium 600 mg with Vitamin D3 supplements contain no color added and no artificial flavors. This Calcium bone supplement also provides Vitamin D3, which helps improve Calcium absorption. This Nature Made 600 mg Calcium Vitamin D3 supplement is perfect for adults who are low in Calcium or want an additional dietary supplement with their diet. Nature Made supplements are quality you can trust. USP has tested and verified ingredients, potency and manufacturing process. USP sets official standards for dietary supplements. Visit the USP verified website for more information.\n\n    Bone support Calcium supplement: contains one 120 count bottle of Nature Made Calcium 600 mg with Vitamin D3 Tablets\n    These Calcium tablets help support strong bones and have Vitamin D, which helps improve Calcium absorption and helps support bone health\n    Adequate Calcium and Vitamin D throughout life, as part of a well-balanced diet, may reduce the risk of osteoporosis\n    Adults take one Nature Made Calcium with Vitamin D3 tablet 1 to 2 times daily with water and a meal\n    Made in the USA with quality global ingredients, this gluten free Calcium supplement has no color added and no artificial flavors\n    United States Pharmacopeia (USP) VerifiedThese statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Made in United States ©Nature Made Nutritional Products Adults, take 1 tablet 1 to 2 times daily with water and a meal. Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.44x 2.44x 3.56",
    "imageUrls": "https://pics.drugstore.com/prodimg/412983/900.jpg",
    "productUPC": "UPC: 03160401237",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-calcium-600-mg-with-vitamin-d3-tablets/ID=prod3950626-product"
  },
  {
    "productBrand": "Nature's Bounty",
    "productName": "Vitamin C Time Release Capsules, 500 mg",
    "listPrice": "$899",
    "description": "Promotes immune system healthNeutralizes harmful free radicalsReleases over a prolonged period of timeNature's Bounty Vitamin C is one of the most well-known and widely used nutritional supplements on the planet! People reach for Nature's Bounty Vitamin C to help them get the essential benefits their body relies on every day!* The Vitamin C in this product has been designed to be released over a prolonged period of time using special time released capsules. Nature's Bounty Vitamin C 500 mg capsules are gluten-free and are free of artificial colors and flavors. *These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease.Made in United States(with select ingredients from around the world) For adults, take one (1) capsule daily, preferably with a meal. © 2016 Nature's Bounty, Inc.1-800-433-2990 Mon.-Sat. 9 AM - 7 PM ET.",
    "productDimensions": "Product in inches (LxWxH): 2.11x 2.11x 4.25",
    "imageUrls": "https://pics.drugstore.com/prodimg/17577/900.jpg",
    "productUPC": "UPC: 07431204750",
    "sourceURL": "https://www.walgreens.com/store/c/nature's-bounty-vitamin-c-time-release-capsules,-500-mg/ID=prod6110357-product"
  },
  {
    "productBrand": "Nature's Bounty",
    "productName": "Cranberry 4200 mg Plus Vitamin C Dietary Supplement Softgels",
    "listPrice": "$2699",
    "description": "Promotes urinary health in men & womenVitamin C supports immune functionNo artificial color, flavor or sweetenerHerbal SupplementPromotes Urinary Health*Fruit 4200 mg Equivalent per SoftgelPlus Vitamin CRapid Release Liquid Softgel Value SizeCranberries help support the integrity of bladder walls to promote urinary health in both men and women.*  This product also contains Vitamin C, an antioxidant that plays a role in supporting immune function.*Made from the finest cranberry concentrate available. This product is sealed in a soft gelatin capsule to assure freshness.No artificial colors, flavors or sweeteners, no preservatives, sugar, starch, milk, lactose, gluten, wheat or yeast, fish & sodium free.1-800-433-2990*These statements have not been evaluated by the Food and Drug Administration.  This product is not intended to diagnose, treat, cure or prevent any disease. For adults, take two (2) softgels three times daily, preferably after meals. © 2016 Nature's Bounty, Inc.1-800-433-2990 Mon.-Sat. 9 AM - 7 PM ET.",
    "productDimensions": "Product in inches (LxWxH): 2.71x 2.71x 4.86",
    "imageUrls": "https://pics.drugstore.com/prodimg/232843/900.jpg",
    "productUPC": "UPC: 07431204363",
    "sourceURL": "https://www.walgreens.com/store/c/nature's-bounty-cranberry-4200-mg-plus-vitamin-c-dietary-supplement-softgels/ID=prod6000613-product"
  },
  {
    "productBrand": "Emergen-C Immune+",
    "productName": "Drink Mix with 1000 mg Vitamin C Plus Vitamin D & Zinc, Super Orange",
    "listPrice": "$659",
    "description": "Regulates immune system functionMaintains a healthy antioxidant responseUnique blendEmergen-C Immune+ features an enhanced immune support formula thats packed with key nutrients to fortify your natural defenses.* One serving provides 1,000 IU (25 mg) Vitamin D and 1,000 mg Vitamin C more than 10 oranges (1). Emergen-C Immune+ also contains a proprietary complex with beta-glucans and arabinogalactans, plus B Vitamins and electrolytes. Emergen-C Immune+ powder drink mix is caffeine-free and made with natural, real fruit flavors with no artificial sweeteners. Mix with 4 to 6 ounces of water for a fizzy, fruity boost of goodness. Also try Emergen-C Immune+ Gummies, Emergen-C Chewables or Emergen-C Original Formula Powder. Emerge Your Best with Emergen-C. (1) Based on using the USDA.gov nutrient database value for a large, raw orange (2) Zinc and Manganese * These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Made in UNITED STATES Ages 14 and up, one (1) packet daily. Empty contents into a glass, add 46 oz. of water, stir. For lighter flavor, mix with more water. Do not exceed suggested use. ©GSK group of companies or its licensor",
    "productDimensions": "Product in inches (LxWxH): 3.95x 2.7x 3.95",
    "imageUrls": "https://pics.drugstore.com/prodimg/532425/900.jpg",
    "productUPC": "UPC: 88589800041",
    "sourceURL": "https://www.walgreens.com/store/c/emergen-c-immune--drink-mix-with-1000-mg-vitamin-c-plus-vitamin-d-%26-zinc/ID=prod6409550-product"
  },
  {
    "productBrand": "Airborne",
    "productName": "Immune Support Gummies with Vitamin C, E, Zinc, Echinacea and Ginger Very Berry",
    "listPrice": "$749",
    "description": "Contains antioxidants1000 mg vitamin C per servingWith vitamins, minerals, & herbsAirborne Immune Support Gummies provide immune support in a delicious, and easy-to-take gummy form. Each serving (3 gummies) delivers a blast of 1000 mg of Vitamin C and 9 other vitamins, minerals, and herbs, including Echinacea and Ginger.* Adults and Children 14 years & older, chew 3 gummies thoroughly before swallowing. Repeat as necessary up to 3X per day, no more than 9 gummies per day. Children 12 to 13 years of age, take 3 gummies. Chew thoroughly before swallowing. Repeat as necessary up to 2X per day, no more than 6 gummies per day.\n\nDelicious immune support chewable gummies\n1000 mg of Vitamin C per serving (3 gummies) to support your immune system\nHigh in antioxidants (Vitamins C & E) and excellent source of Selenium\nProprietary Herbal Blend including Echinacea & Ginger\nGluten Free with no artificial coloring*These Statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease.Made in United States Adults and children 14 years and older take 3 gummies. Chew thoroughly before swallowing. Repeat as necessary up to 3 times per day, no more than 9 gummies per day.\nChildren 12 to 13 years of age take 3 gummies. Chew thoroughly before swallowing. Repeat as necessary up to 2 times per day, no more than 6 gummies per day. Not for younger children due to the risk of choking. © 2014 Reckitt Benckiser",
    "productDimensions": "Product in inches (LxWxH): 2.87x 2.87x 5.37",
    "imageUrls": "https://pics.drugstore.com/prodimg/534267/900.jpg",
    "productUPC": "UPC: 64786590846",
    "sourceURL": "https://www.walgreens.com/store/c/airborne-immune-support-gummies-with-vitamin-c,-e,-zinc,-echinacea-and-ginger-very-berry/ID=prod6244434-product"
  },
  {
    "productBrand": "Zarbee's",
    "productName": "Children's Elderberry Immune Support Gummies Berry",
    "listPrice": "$879",
    "description": "Concentrated burst of zinc & vitamin CFueled by real elderberry extractFor ages 2+ years\nFeatures vitamins A, C, D, E & Zinc for immune support\nSafe for kids, this formula contains real elderberry\nDelicious gummies are naturally sweetened\nZarbee's Naturals are formulated without any drugs, alcohol, or artificial flavors\nPowerful ingredients like dark honey, elderberry & agave are the backbone of Zarbee's products\nZarbee's Naturals Immune Support Gummies provide your child with vitamins A, C, D, E & Zinc for additional immune support. They're made with real elderberry extract, an antioxidant that gives them their delicious taste. We'll BEE there! Check out our whole line of products made of handpicked wholesome ingredients. *These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Made in United States1-877-528-0420 Suggestions for Use: For children ages 2-3 years, take one (1) gummy per day. For children ages 4+ years, take two (2) gummies per day. Instruct child to chew each gummy thoroughly before swallowing. Store in a cool, dry place. ©Zarbee's",
    "productDimensions": "Product in inches (LxWxH): 2.4x 2.4x 4.4",
    "imageUrls": "https://pics.drugstore.com/prodimg/534073/900.jpg",
    "productUPC": "UPC: 89811500273",
    "sourceURL": "https://www.walgreens.com/store/c/zarbee's-children's-elderberry-immune-support-gummies-berry/ID=prod6243029-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Vitamin D3 2000 IU (50 mcg) Tablets",
    "listPrice": "$1499",
    "description": "Supports teeth, bone & immune healthThe body's preferred form of vitamin DContains no preservativesSay hello to an easy and effective Vitamin D supplement to support muscle, bone, teeth, and immune health. While sunshine is a great source of Vitamin D, many people aren't making enough of this essential nutrient from the sun. Vitamin D can be found in food as well in two different forms (known as Vitamin D2 and Vitamin D3), however, Vitamin D3 is more effective at raising and maintaining adequate levels of Vitamin D throughout the body. Vitamin D is a common nutrient shortfall. In fact, 95% of the US population does not get enough Vitamin D from food alone, making supplementation that much more important.(1) Support your sunshine and Vitamin D dietary needs today, with Nature Made's Vitamin D 2000 IU (50 mcg) tablets. (1)NHANES 2005-2016 Nutrients 2020, 12, 1735. (2)Based on a survey of pharmacists who recommend branded vitamin and supplements\n\nVITAMIN D3 IS ESSENTIAL TO A HEALTHY IMMUNE RESPONSE & MORE: Vitamin D is an essential nutrient that helps support a healthy immune response, aids in calcium absorption to support strong bones and teeth and supports muscle function.\nTHE BODY'S PREFERRED FORM OF VITAMIN D: Vitamin D3 is more effective than Vitamin D2 at raising and maintaining adequate Vitamin D levels throughout the body.\nAdults take 1 tablet daily with water and a meal.\nHIGH QUALITY INGREDIENTS: Made from carefully selected ingredients under strict manufacturing practices and guaranteed to meet our high quality standards. No color added. No artificial flavors. Gluten free.\n#1 PHARMACIST RECOMMENDED VITAMIN & SUPPLEMENT BRAND & USP VERIFIED(2): Because Nature Made is committed to quality and purity, this Vitamin D supplement is also USP Verified, an independent organization that tests for quality and purity.\nThese statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Made in United States(with globally sourced ingredients) Adults, take 1 tablet daily with water and a meal. Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.0x 2.0x 4.25",
    "imageUrls": "https://pics.drugstore.com/prodimg/338900/900.jpg",
    "productUPC": "UPC: 03160402673",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-vitamin-d3-2000-iu-(50-mcg)-tablets/ID=prod6087403-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "L-Lysine 1000 mg Tablets",
    "listPrice": "$1199",
    "description": "Necessary for production of antibodiesOne of the nine essential amino acidsSupport for manufacturing body proteinsNature Made L-Lysine 1000 mg tablets are dietary supplements that help the body synthesize protein with just one convenient dose per day. Sourced from high-quality ingredients, these gluten free L-Lysine supplements have no color added, no artificial flavors, and no preservatives. This L-Lysine dietary supplement provides 1000 mg of one of the nine essential amino acids. Adults take one L Lysine 1000 mg tablet daily with water and a meal. Nature Made supplements are quality you can trust. *Based on a survey of pharmacists who recommend branded vitamins and supplements.\n\nProtein synthesis support supplement: Contains one 60 count bottle of Nature Made L-Lysine 1000 mg Tablets for a 60-day supply \nL-Lysine is an essential amino acid that supports protein synthesis \nThis L-Lysine supplement provides 1000 mg of Lysine in just one daily tablet\nThis Lysine supplement has no color added, no artificial flavors, no preservatives, and is gluten free \n#1 Pharmacist Recommended Vitamin & Supplement Brand*\nThese statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Made in United States L-Lysine tablets are made to Nature Made's guaranteed purity and potency standards. Adults, take 1 tablet daily with water and a meal. Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.25x 2.25x 4.0",
    "imageUrls": "https://pics.drugstore.com/prodimg/17725/900.jpg",
    "productUPC": "UPC: 03160401347",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-l-lysine-1000-mg-tablets/ID=prod3545-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Extra Strength Vitamin C Gummies 500 mg",
    "listPrice": "$1449",
    "description": "Nature Made Vitamin C 500 mg per serving extra strength dosage gummies are Vitamin C supplements that help support immune health, provide antioxidant support, and aid in iron absorption. Sourced from high-quality ingredients, these delicious tangerine-flavored Vitamin C gummies for adults are made with pectin not gelatin and have no artificial flavors, no synthetic dyes, no high fructose corn syrup, no artificial sweeteners, and are gluten free. \nVitamin C is an antioxidant that helps support your immune system and is needed for collagen synthesis to support overall skin health. If you're not receiving enough Vitamin C from your daily diet or taking a Vitamin C supplement, an antioxidant supplement like Nature Made Vitamin C 500mg per serving gummy vitamins can help. Nature Made's gummy Vitamin C for adults offers a delicious way to take your Vitamin C if you don't prefer tablets or softgels. \nNature Made supplements are quality you can trust. USP has tested and verified ingredients, potency, and manufacturing process. USP sets official standards for dietary supplements. Visit the USP verified website for more information. \n\nUnited States Pharmacopeia (USP) Verified, #1 Pharmacist Recommended Vitamin & Supplement Brand*\n*Based on a survey of pharmacists who recommend branded vitamins and supplements.These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Made in U.S.A. (with globally sourced ingredients) Adults, chew 2 gummies daily. Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.88x 2.88x 5.25",
    "imageUrls": "https://pics.drugstore.com/prodimg/626657/900.jpg",
    "productUPC": "UPC: 03160404030",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-extra-strength-vitamin-c-gummies-500-mg/ID=300405351-product"
  },
  {
    "productBrand": "Emergen-C",
    "productName": "Daily Immune Support Drink with 1000 mg Vitamin C, Antioxidants & B Vitamins Tangerine",
    "listPrice": "$1099",
    "description": "Increases metabolic functionVitamin C & antioxidants boost healthB vitamins for natural energy & no crash\nIncludes 30 individual serving-size packets (0.33 oz. each) of Emergen-C fizzy drink mix  \nEach serving delivers 1,000 mg of Vitamin C - more than 10 oranges (1)  \nDaily dietary supplement is made with natural flavors and contains no artificial sweeteners  \nHelps support the immune system with Vitamin C and other antioxidants (2) with B Vitamins and electrolytes*  \nVitamin drink mix is a powder that dissolves quickly in water; it's fizzy, refreshing and caffeine-free \nWhy settle for a good day when you can have a super one? Emergen-C Vitamin C drink mix is a great way to help support your immune system with Vitamin C as part of your daily wellness routine. Emergen-C dietary supplement provides 1,000 mg of Vitamin C - more than 10 oranges (1) - and is packed with B Vitamins and other antioxidants (2) for immune system support, plus electrolytes to help replace any that are lost during your daily workout*. Emergen-C vitamin drink mixes are made with natural, real fruit flavors, plus they have no artificial sweeteners and are caffeine free. Just add to 4 to 6 ounces of water for a fizzy, citrus-y boost of goodness. With more than 20 tasty flavors plus a variety of special formulas, Emergen-C dietary supplements make it deliciously easy to support your wellness goals. Transform your day, every day, with Emergen-C.(1) Based on using the USDA.gov nutrient database value for a large, raw orange(2) Antioxidants include Vitamin C, Zinc and Manganese(3) Emergen-Zzzz is a dietary supplement for occasional sleeplessness* These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.\nMade in UNITED STATES Ages 14 and up, one (1) packet daily. Empty contents into a glass, add 4-6 oz. of water, stir. For lighter flavor, mix with more water. Do not exceed suggested use. If you are pregnant, nursing, or taking medication, consult your doctor before use. Store at room temperature. Protect from moisture. © Pfizer Consumer Healthcare",
    "productDimensions": "Product in inches (LxWxH): 2.63x 5.38x 3.88",
    "imageUrls": "https://pics.drugstore.com/prodimg/222872/900.jpg",
    "productUPC": "UPC: 07631430202",
    "sourceURL": "https://www.walgreens.com/store/c/emergen-c-daily-immune-support-drink-with-1000-mg-vitamin-c,-antioxidants-%26-b-vitamins-tangerine/ID=300391652-product"
  },
  {
    "productBrand": "Nature's Bounty",
    "productName": "Immune Jelly Beans Orange",
    "listPrice": "$1499",
    "description": "Introducing NEW Nature's Bounty Immune Jelly Beans, a juicy and delicious way to support your immune system.* Packed with Vitamin C, Vitamin D, and Zinc each serving provides antioxidants plus support for immune and overall wellness.* Bursting with delicious orange flavor, Nature's Bounty Immune Jelly Beans are gelatin-free making them suitable for vegetarians. For added benefits, they are NON-GMO, contain naturally sourced colors plus free of artificial flavors and sweeteners. Supporting your immune system has never tasted so great!* *These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Product of Switzerland For adults, take two (4) Jelly Beans daily, preferably with a meal. Chew thoroughly before swallowing. ",
    "productDimensions": "Product in inches (LxWxH): 2.44x 2.44x 5.56",
    "imageUrls": "https://pics.drugstore.com/prodimg/645626/900.jpg",
    "productUPC": "UPC: 07431201012",
    "sourceURL": "https://www.walgreens.com/store/c/nature's-bounty-immune-jelly-beans-orange/ID=300424087-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Vitamin D3 + K2 Softgels",
    "listPrice": "$1899",
    "description": "Nature Made Vitamin D3 + K2 Softgels offer an easy way to add Vit K2 and Vitamin D3 supplements to your daily routine. Vitamin D supports bone, teeth, muscle, and immune health. These Vitamin D3 K2 softgels are gluten free dietary supplements with no synthetic dyes-color derived from natural sources, and no artificial flavors. Each Vit D3 with K2 vitamin softgel provides Vitamin D3 to support a healthy immune response. Vitamin K2 with D3 helps direct calcium to bones. Vitamin D3 with K2 works better for bone health when taken together than Vitamin D 3 alone, and Vit D3 K2 together make activated proteins that support healthy vascular function. This K2 D3 vitamin supplement is designed for those with higher Vitamin D needs and/or deficiency, as determined by a healthcare professional(1). D3 vitamin is the body's preferred form of Vitamin D to help maintain Vit D levels. Adults, take one Vitamin D K2 supplement daily with water. Nature Made Vitamin D with K2 supplements are quality you can trust. (1)Approximately 29% of U.S. adults are Vitamin D deficient(<50 nmol/L)\n\nStrong bone support supplement: contains one 30 count bottle of Nature Made Vitamin D3 K2 Softgels for a 30-day supply\nNature Made Vitamin D3 and K2 softgels provide 5000 IU (125 mcg) of Vitamin D for immune support and to support bone health, teeth health and muscle health\nProvides 100 mcg of Vitamin K2 to support healthy artery function; Adding K2 to D3 helps direct calcium to bones\nThese gluten free Vitamin K2 D3 softgels contain no synthetic dyes and no artificial flavors\n#1 Pharmacist Recommended Vitamin & Supplement Brand*\nThese statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.\n*Based on a survey of pharmacists who recommend branded vitamins and supplements.Made in United States This product is designed for those with higher vitamin D needs and/or deficiency, as determined by a healthcare professional. Adults, take one softgel daily with water. Store tightly closed, in a cool, dry place, out of reach of children. Do not use if seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.0x 2.0x 4.25",
    "imageUrls": "https://pics.drugstore.com/prodimg/647097/900.jpg",
    "productUPC": "UPC: 03160404345",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-vitamin-d3---k2-softgels/ID=300425544-product"
  },
  {
    "productBrand": "Nature's Bounty",
    "productName": "Natural Vitamin E-Oil Dietary Supplement",
    "listPrice": "$1449",
    "description": "Promotes immune functionHelps support cardiovascular healthSuitable for vegetariansDietary SupplementPure Enough to Take Orally30,000 IU per bottleVegetarian FormulaNature's Bounty's Natural E-Oil is so pure it can be taken orally.Each five (5) drops contain 100 International Units (IU) of Vitamin E (dl-Alpha Tocopheryl Acetate) in a natural base of wheat germ and vegetable oils.No Artificial Color, Flavor or Sweetener. No Preservatives, No Sugar, No Starch, No Milk, No Lactose, No Yeast, No Fish. Sodium Free.Guaranteed Quality - Laboratory Tested1-800-433-2990 Mon.-Sat. 9 AM-7 PM Et*These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease.Made in USA Guaranteed Quality. For adults, take five (5) drops (0.25 mL) daily, preferably with a meal. May be taken orally or put in water, juice or food. As a moisturizer, apply directly to your skin. ©2016 Nature's Bounty, Inc.",
    "productDimensions": "Product in inches (LxWxH): 1.59x 1.59x 4.16",
    "imageUrls": "https://pics.drugstore.com/prodimg/16981/900.jpg",
    "productUPC": "UPC: 07431200810",
    "sourceURL": "https://www.walgreens.com/store/c/nature's-bounty-natural-vitamin-e-oil-dietary-supplement/ID=prod393895-product"
  },
  {
    "productBrand": "Walgreens",
    "productName": "650 mg Calcium Soft Chews with Vitamin D + K, Caramel (Packaging May Vary)",
    "listPrice": "$849",
    "description": "\n650mg Calcium / Vitamins D & K  \n12.5 mcg Vitamin D (500 IU Vitamin D)  \nNutritional Support For Women  \nCompare to Viactiv Calcium Soft Chews.tt\nCaramel flavored natural & artificial flavors.\nGluten free.\nBone health.**\nWalgreens Pharmacist recommended.t\nUL Verified - Verified Dietary Ingredients.verify.UL.com.\nwalgreens.com.how2recycle.info.\ntOur pharmacists recommend the Walgreens brand. We invite you to compare to national brands.ttThis product is not manufactured or distributed by Viactiv Lifestyle LLC, owner of the registered trademark Viactiv, or by any of its affiliates.\n**These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease.Made in United States 100% satisfaction guaranteed Suggested Use: Adults and children 10 years of age and older, take one chew twice daily with food or as directed by your physician. Do not exceed more than 2 chews in one day.\nKeep in a cool dry place. © 2021 Walgreen Co.",
    "productDimensions": "Product in inches (LxWxH): 3.25x 4.5x 5.0",
    "imageUrls": "https://pics.drugstore.com/prodimg/626426/900.jpg",
    "productUPC": "UPC: 31191720055",
    "sourceURL": "https://www.walgreens.com/store/c/walgreens-650-mg-calcium-soft-chews-with-vitamin-d---k/ID=300405080-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Vitamin C Gummies 250 mg Tangerine",
    "listPrice": "$1499",
    "description": "For immune system supportNatural fruit flavors adults preferGreat tasting way to take vitaminsNature Made Vitamin C 250 mg per serving gummies are Vitamin C supplements that help support immune health, provide antioxidant support, and aid in iron absorption. Sourced from high-quality ingredients, these delicious tangerine-flavored Vitamin C gummies for adults are dietary supplements that are made with pectin and have no artificial flavors, no synthetic dyes, no high fructose corn syrup, no artificial sweeteners, and are gluten free. Vitamin C is an antioxidant that helps support your immune system and is needed for collagen synthesis to support overall skin health. If you are not receiving enough Vitamin C from your daily diet or taking a Vitamin C supplement, then a Nature Made Vitamin C 250mg per serving antioxidant supplement can help. Nature Made's gummy Vitamin C for adults offers a delicious way to take your Vitamin C if you don't prefer tablets or softgels. Nature Made supplements are quality you can trust.\n\nImmune support supplement: contains one 80 count bottle of Nature Made Vitamin C 250 mg per serving Gummies for a 40-day supply\nNature Made Vitamin C 250mg gummy vitamins support immune health and offer antioxidant support\nThis 250 mg Vitamin C per serving immune system supplement provides Vitamin C, which is also necessary for the body to produce collagen to help support healthy skin\nAdults chew two tasty tangerine-flavored Nature Made Vitamin C gummies daily\n#1 Pharmacist Recommended Vitamin & Supplement Brand*\n*Based on a survey of pharmacists who recommend branded vitamins and supplements.\nThese statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Product of Spain and USA Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.88x 2.88x 5.14",
    "imageUrls": "https://pics.drugstore.com/prodimg/410602/900.jpg",
    "productUPC": "UPC: 03160402843",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-vitamin-c-gummies-250-mg-tangerine/ID=prod6121521-product"
  },
  {
    "productBrand": "Nature's Bounty",
    "productName": "B-Complex plus Vitamin C Dietary Supplement Tablets",
    "listPrice": "$1599",
    "description": "Essential for healthy nervous tissueFor energy metabolismProvides gradual release of vitaminsVitamin SupplementHigh PotencyTime Released With Biotin Coated for Easy SwallowingThe B-Complex is essential for the maintenance of healthy nervous tissue and energy metabolism.*  This formula also contains Vitamin C for immune system and antioxidant health.*  Specially formulated to provide a gradual release of Vitamins over a prolonged period of time.No Artificial Color or Flavor, No Preservatives, No Sugar, No Milk, No Lactose, No Soy, No Gluten, No Wheat, No Yeast, No Fish.  Sodium Free.Laboratory TestedSuitable for Vegetarians1-800-433-2990*These statements have not been evaluated by the Food and Drug Administration.  This product is not intended to diagnose, treat, cure or prevent any disease. For adults, take one (1) tablet daily, preferably with a meal. © 2015 Nature's Bounty, Inc.1-800-433-2990 Mon.-Sat. 9 AM-7 PM ET",
    "productDimensions": "Product in inches (LxWxH): 1.98x 1.98x 4.23",
    "imageUrls": "https://pics.drugstore.com/prodimg/17549/900.jpg",
    "productUPC": "UPC: 07431200530",
    "sourceURL": "https://www.walgreens.com/store/c/nature's-bounty-b-complex-plus-vitamin-c-dietary-supplement-tablets/ID=prod6079100-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Vitamin D3 2000 IU (50 mcg) Softgels",
    "listPrice": "$2799",
    "description": "The body's preferred form of vitamin DSupports teeth, bone & immune healthNo artificial flavors or preservativesNature Made Vitamin D3 2000 IU Softgels (50 mcg) offer an easy way to add Vitamin D supplements to your daily routine to support bone, teeth and muscle health. Sourced from high quality ingredients, these Nature Made Vitamin D softgels are gluten free dietary supplements with no color added and no artificial flavors. Each Vitamin D3 2000IU softgel supports a healthy immune response and aids in calcium absorption. Vitamin D is a common nutrient shortfall. D3 vitamin is the body's preferred form of Vitamin D to help maintain Vit D levels. These Nature Made Vitamin D3 supplements contain 50mcg (2000 IU) of Vit D3 per serving. Adults, take one Vitamin D3 Nature Made softgel daily with water and a meal. This Nature Made Vitamin D supplement is quality you can trust.\n\nImmune, muscle, teeth and bone health support supplement: contains one 250 count bottle of Nature Made Vitamin D3 2000 IU (50 mcg) Softgels for a 250-day supply\nNature Made Vitamin D 2000 IU softgels support bone health, teeth health, muscle health, and provide immune support\nThese Vitamin D 2000IU softgels help improve calcium absorption and contain 50mcg of Vitamin D 3, the body's preferred form of Vitamin D\nAdults, take one Vitamin D3 softgel daily with water and a meal\n#1 Pharmacist Recommended Vitamin & Supplement Brand*\nThese statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.\n*Based on a survey of pharmacists who recommend branded vitamins and supplements.Made in USA Adults, take 1 softgel daily with water and a meal. Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.44x 2.44x 4.38",
    "imageUrls": "https://pics.drugstore.com/prodimg/338905/900.jpg",
    "productUPC": "UPC: 03160402678",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-vitamin-d3-2000-iu-(50-mcg)-softgels/ID=prod6087401-product"
  },
  {
    "productBrand": "Nature's Bounty",
    "productName": "Pure Vitamin C Tablets",
    "listPrice": "$699",
    "description": "Vitamin C Tablets by Nature's Bounty is one of our leading vitamins for immune support.* Vitamin C is an important nutrient for the functioning of white blood cells, which are vital components of the immune system.* Vitamin C Tablets from the trusted vitamin experts at Nature's Bounty provide a sufficient dose of Vitamin C without the ingredients you may not want. They also are one of the best antioxidants for fighting free radicals.* Free radicals can cause oxidative stress that may lead to premature aging of the cells. Nature's Bounty Vitamin C Tablets combine science, nature and 50 years of expertise and innovation to provide the easiest way to increase your daily intake of this important nutrient for immune support and antioxidant health.* Nature's Bounty is committed to safety and purity in all our supplements. Our Vitamin C Tablets are non-GMO, gluten- and sugar-free, and contain no artificial colors, or sweeteners.Made in United States For adults, take one (1) tablet up to four times daily. preferably with meals ©2015 Nature's Bounty, Inc.",
    "productDimensions": "Product in inches (LxWxH): 1.85x 1.85x 3.51",
    "imageUrls": "https://pics.drugstore.com/prodimg/588530/900.jpg",
    "productUPC": "UPC: 07431201510",
    "sourceURL": "https://www.walgreens.com/store/c/nature's-bounty-pure-vitamin-c-tablets/ID=prod6338555-product"
  },
  {
    "productBrand": "Walgreens",
    "productName": "Chewable Vitamin C 500 mg (Packaging May Vary)",
    "listPrice": "$799",
    "description": "Chewable Vitamin C 500 mg per serving\nVitamin C, an antioxidant, may support the immune system. It is important for the structure of bones, muscles, and blood vessels, as well as the health of teeth and gums.*\nNO ARTIFICIAL FLAVORS, NO GLUTEN, NO LACTOSE \nTablet color may vary.Made in China ©2021 Walgreen Co.",
    "productDimensions": "Product in inches (LxWxH): 2.37x 2.37x 3.97",
    "imageUrls": "https://pics.drugstore.com/prodimg/649971/900.jpg",
    "productUPC": "UPC: 31191702208",
    "sourceURL": "https://www.walgreens.com/store/c/walgreens-chewable-vitamin-c-500-mg/ID=300428293-product"
  },
  {
    "productBrand": "Nature's Bounty",
    "productName": "Super Strength Vitamin D3 2000 IU Dietary Supplement Softgels",
    "listPrice": "$1599",
    "description": "For strong bones and teethSupports breast healthPromotes immune and colon healthVitamin Supplement\nPromotes: \n\nBone Health* \nImmune Health* \nBreast Health* \nColon Health*\n-Super Strength-Rapid Release Liquid Softgel\nVitamin D is an essential nutrient that works with Calcium to help develop strong bones and teeth.* This high-potency Vitamin D supplement also assists in maintaining breast health and a healthy immune system.* An analysis of 5 studies concluded that increasing Vitamin D intake up to 2000 IU per day could promote colon health.* Recent evidence also indicates that increasing Vitamin D intake can support the health of the pancreas.* Supplementing with Super Strength D-2000 IU is an easy and convenient way to increase your daily Vitamin D intake.\nNo Artificial Color, Flavor or Sweetener, No Preservatives, No Sugar, No Starch, No Milk, No Lactose, No Gluten, No Wheat, No Yeast, No Fish. Sodium Free.\n*These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease. 100% Satisfaction Guaranteed. For adults, take one (1) softgel daily, preferably with a meal.\nStore in a cool, dry place. ©Nature's Bounty, Inc.",
    "productDimensions": "Product in inches (LxWxH): 2.0x 2.1x 4.3",
    "imageUrls": "https://pics.drugstore.com/prodimg/216149/900.jpg",
    "productUPC": "UPC: 07431217621",
    "sourceURL": "https://www.walgreens.com/store/c/nature's-bounty-super-strength-vitamin-d3-2000-iu-dietary-supplement-softgels/ID=prod3430766-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Vitamin D3 1000 IU (25 mcg) Tablets",
    "listPrice": "$1249",
    "description": "Supports teeth, bone & immune health#1 pharmacist recommendedFormulated for easy absorptionSay hello to an easy and effective Vitamin D supplement to support muscle, bone, teeth, and immune health. While sunshine is a great source of Vitamin D, many people aren't making enough of this essential nutrient from the sun. Vitamin D can be found in food as well in two different forms (known as Vitamin D2 and Vitamin D3), however, Vitamin D3 is more effective at raising and maintaining adequate levels of Vitamin D throughout the body. Vitamin D is a common nutrient shortfall. In fact, 95% of the US population does not get enough Vitamin D from food alone, making supplementation that much more important.(1) Support your sunshine and Vitamin D dietary needs today, with Nature Made's Vitamin D 1000 IU (25 mcg) tablets. (1)NHANES 2005-2016 Nutrients 2020, 12, 1735. (2)Based on a survey of pharmacists who recommend branded vitamin and supplements\n\nVITAMIN D3 IS ESSENTIAL TO A HEALTHY IMMUNE RESPONSE & MORE: Vitamin D is an essential nutrient that helps support a healthy immune response, aids in calcium absorption to support strong bones and teeth and supports muscle function. \nTHE BODY'S PREFERRED FORM OF VITAMIN D: Vitamin D3 is more effective than Vitamin D2 at raising and maintaining adequate Vitamin D levels throughout the body. \nAdults take 1 tablet daily with water and a meal. \nHIGH QUALITY INGREDIENTS: Made from carefully selected ingredients under strict manufacturing practices and guaranteed to meet our high quality standards. No color added. No artificial flavors. Gluten free. \n#1 PHARMACIST RECOMMENDED VITAMIN & SUPPLEMENT BRAND & USP VERIFIED(2): Because Nature Made is committed to quality and purity, this Vitamin D supplement is also USP Verified, an independent organization that tests for quality and purity.\nThese statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Made in USA(with globally sourced ingredients) Adults, take 1 tablet daily with water and a meal.Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.0x 2.0x 4.25",
    "imageUrls": "https://pics.drugstore.com/prodimg/149037/900.jpg",
    "productUPC": "UPC: 03160401870",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-vitamin-d3-1000-iu-(25-mcg)-tablets/ID=prod2303851-product"
  },
  {
    "productBrand": "Emergen-C Immune+",
    "productName": "Gummies with 500 mg Vitamin C Plus Vitamin D & Zinc Raspberry",
    "listPrice": "$1199",
    "description": "\nIncludes one bottle with 45 Emergen-C Immune+ Vitamin Gummies in Raspberry favor. \nYummy, gummy vitamin form with Vitamin D plus 500 mg Vitamin C per serving. \nGummy vitamin supplement is made with natural fruit flavors and sweeteners. \nEmergen-C gummies for adults are gluten-free and caffeine-free. \nWho says taking vitamins can't be fun? Just bite into a yummy Emergen-C Immune+ gummy and you'll look forward to taking your vitamins every single day. Of course, Emergen-C Immune+ Gummies for adults are way more than great-tasting. They're great for you, too. With 500 mg of Vitamin C in every serving, plus Vitamin D and Zinc, Emergen-C Gummies help support your immune system with every bite*. These Emergen-C supplements are made with natural fruit flavors and sweeteners, and they're caffeine-free and gluten-free. Plus, they're available in two delicious varieties - Super Orange and Raspberry. Emerge fortified and Feel the Good with Emergen-C Immune+ Gummies. \n(2) Antioxidants include Vitamin C, Zinc and Manganese* These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease. Made in United States Adults take three (3) gummies daily. ©Alacer Corp",
    "productDimensions": "Product in inches (LxWxH): 2.8x 2.8x 5.3",
    "imageUrls": "https://pics.drugstore.com/prodimg/609022/900.jpg",
    "productUPC": "UPC: 88589810047",
    "sourceURL": "https://www.walgreens.com/store/c/emergen-c-immune--gummies-with-500-mg-vitamin-c-plus-vitamin-d-%26-zinc-raspberry/ID=prod6388387-product"
  },
  {
    "productBrand": "Nature's Bounty",
    "productName": "Super B Complex Tablets With Folic Acid",
    "listPrice": "$1599",
    "description": "With folic acid, vitamin C & biotinCoated for easy swallowingSupports nervous system healthThe B Vitamin Complex is made up of several vitamins that work synergistically to support nervous system health. Nature's Bounty Super B Complex with Folic Acid plus Vitamin C Vitamin Supplement is combined with vitamin C to support heart health and also features 100% of the daily value for folic acid to support healthy homocysteine levels already within normal range.Made in United States For adults, take one (1) tablet daily, preferably with a meal. © 2015 Nature's Bounty, Inc.1-800-433-2990 Mon-Sat 9 AM-7 PM ET",
    "productDimensions": "Product in inches (LxWxH): 1.98x 1.98x 4.17",
    "imageUrls": "https://pics.drugstore.com/prodimg/186207/900.jpg",
    "productUPC": "UPC: 07431213168",
    "sourceURL": "https://www.walgreens.com/store/c/nature's-bounty-super-b-complex-tablets-with-folic-acid/ID=prod6142906-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Elderberry with Vitamin C and Zinc Gummies Raspberry",
    "listPrice": "$2999",
    "description": "Nature Made Black Elderberry with Vitamin C and Zinc Gummies are a great-tasting dietary supplement that offers a convenient way to get immune health support with Vitamin C and Zinc. Sourced from high quality ingredients, these raspberry-flavored Elderberry Vitamin C Zinc supplements are gluten free and contain no artificial flavors, no color added, no high fructose corn syrup and no artificial sweeteners. Like other berries, fresh Elderberries contain anthocyanins, which are known to have antioxidant properties (1). This Elderberry supplement also contains Vitamin C, a well-known antioxidant and immune support vitamin. These dietary supplements also contain Zinc, another key immune support nutrient. Containing 100mg of Black Elderberry extract, 90mg of Vitamin C and 7.5mg of Zinc per serving, these Nature Made Elderberry gummies for adults make it easy to take immune support nutrients. These Black Elderberry gummies for adults are a good option for anyone looking to supplement their diet, especially if its low in fruits and vegetables. Adults, chew two Nature Made Elderberry gummies with Zinc and Vitamin C daily. \n\n#1 Pharmacist Recommended Vitamin & Supplement Brand*\n(1) Clifford, M. Review Anthocyanins Nature, Occurrence and Dietary Burden. J Sci Food Agric 80:10631072 (2000). \n*Based on a survey of pharmacists who recommend branded vitamins and supplements.These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Made in United States Adults, chew 2 gummies daily. Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.5x 2.5x 4.5",
    "imageUrls": "https://pics.drugstore.com/prodimg/620715/900.jpg",
    "productUPC": "UPC: 03160403194",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-elderberry-with-vitamin-c-and-zinc-gummies-raspberry/ID=300399376-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Extra Strength Dosage Chewable Vitamin C 1000 mg Tablets",
    "listPrice": "$1799",
    "description": "Nature Made Extra Strength Dosage Chewable Vitamin C 1000mg per serving offers an extra strength dosage of Vitamin C for immune health and antioxidant support. Sourced from high-quality ingredients, this delicious chewable Vitamin C tablet has no color added and no artificial flavors. Vitamin C is an antioxidant that helps support your immune system and is also needed for collagen synthesis to support overall skin health. This Vitamin C 1000mg per serving Vitamin C chewable supplement is designed for those who are not receiving enough Vitamin C from diet alone or taking Vitamin C supplements. Now back in their original orange flavor, these Nature Made chewable Vitamin C tablets are a tasty way to take your antioxidant supplements. \nNature Made Vitamin C 1000 mg per serving tablets are quality you can trust. USP has tested and verified ingredients, potency, and manufacturing process. USP sets official standards for dietary supplements. Visit the USP verified website for more information. \n\nMade in the USA with quality global ingredients, United States Pharmacopeia (USP) Verified, #1 Pharmacist Recommended Vitamin & Supplement Brand*\n*Based on a survey of pharmacists who recommend branded vitamins and supplements.These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Made in USA (with globally sourced ingredients) Adults, chew 2 tablets daily with a meal. Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.94x 2.94x 5.38",
    "imageUrls": "https://pics.drugstore.com/prodimg/626658/900.jpg",
    "productUPC": "UPC: 03160404022",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-extra-strength-dosage-chewable-vitamin-c-1000-mg-tablets/ID=300405352-product"
  },
  {
    "productBrand": "Nature's Bounty",
    "productName": "Vitamin D3 Softgels 125 mcg, 5000 IU",
    "listPrice": "$2279",
    "description": "Maximum strength vitamin D3 5000IUSupports neuromuscular & immune healthHelp develop strong bones & teethNature's Bounty Vitamin D - the \"Sunshine Vitamin\" is an essential nutrient that the body creates by converting cholesterol in the body via sunshine. However, today's culture of cubicles, sunscreen, and near-round-the-clock indoor living minimizes our exposure to natural sunlight for the needed period of time for sufficient Vitamin D to form. Supplementing with Nature's Bounty Vitamin D3 is an easy way to increase your daily intake of this important nutrient.Made in United States For adults, take one (1)  softgel daily, preferably with a meal. ©Nature's Bounty",
    "productDimensions": "Product in inches (LxWxH): 2.31x 2.31x 4.35",
    "imageUrls": "https://pics.drugstore.com/prodimg/488224/900.jpg",
    "productUPC": "UPC: 07431229176",
    "sourceURL": "https://www.walgreens.com/store/c/nature's-bounty-vitamin-d3-softgels-125-mcg,-5000-iu/ID=prod6202863-product"
  },
  {
    "productBrand": "Airborne",
    "productName": "Gummies with Vitamin C, Zinc and Immune Support Supplement Elderberry",
    "listPrice": "$1849",
    "description": "Airborne Elderberry Gummies provides immune support in a great-tasting and easy-to-take form. Each serving (2) gummies delivers a delicious blast of Elderberry flavor and immune supporting Vitamin C. It is also high in antioxidant Vitamin E and is a good source of Zinc. Airborne Elderberry Gummies help support your immune system.* Airborne is the #1 Immune Support Gummy, Effervescent & Chewable Brand. *These Statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease. Based on unit sales L52W through 4/3/2021Made in United States Adults and Children 4 years and older. Chew thoroughly before swallowing. Not for children under 4 years of age due to risk of choking. ©AIRBORNE",
    "productDimensions": "Product in inches (LxWxH): 2.88x 2.88x 5.41",
    "imageUrls": "https://pics.drugstore.com/prodimg/638595/900.jpg",
    "productUPC": "UPC: 64786590403",
    "sourceURL": "https://www.walgreens.com/store/c/airborne-gummies-with-vitamin-c,-zinc-and-immune-support-supplement-elderberry/ID=300417569-product"
  },
  {
    "productBrand": "Vitafusion",
    "productName": "Power C Gummy Vitamins Orange",
    "listPrice": "$1599",
    "description": "Excellent source of vitamin CLaboratory tested to ensure qualityContains no gluten, milk or soyTwo delicious vitafusion Power C gummies provide an excellent source of vitamin C -- as much as 10 tangerines! You'll love the natural tangy orange flavor of vitafusion Power C and feel good knowing that these gummy vitamins are helping to support your immune system[1]. [1]These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease. [4] For Vitamin CMade in United States(with US & international ingredients)1-888-334-5389 Suggested use: As a dietary supplement, take two (2) gummy vitamins per day. Chew thoroughly before swallowing. ©2019 Church & Dwight Co., Inc.",
    "productDimensions": "Product in inches (LxWxH): 3.19x 3.19x 6.31",
    "imageUrls": "https://pics.drugstore.com/prodimg/240294/900.jpg",
    "productUPC": "UPC: 02791701920",
    "sourceURL": "https://www.walgreens.com/store/c/vitafusion-power-c-gummy-vitamins-orange/ID=prod6038667-product"
  },
  {
    "productBrand": "ChildLife",
    "productName": "Liquid Vitamin C Orange",
    "listPrice": "$649",
    "description": "Dietary SupplementNutrition for Kids!®Great TasteImmune System Support*Tasty, Natural Orange FlavorHeath Tip:For immune support and environmental protection, use ChildLife Vitamin C daily as a vital antioxidant.  When needed, use with ChildLife First Defense and ChildLife Echinacea.*ChildLife's Vitamin C is a great tasting liquid Vitamin C.  The liquid form and natural orange flavor ensure ease of use for children of all ages.ChildLife uses only the highest quality ingredients.  Contains no dairy, gluten, soy, eggs, yeast, wheat, corn, or alcohol.  No artificial colorings.  No artificial sweeteners.(800) 993-0332*This information has not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease. For infants 6 mo. to 1 yr: 1/4 teaspoon daily.  For children 1-4 yrs: 1/2-1 teaspoon daily.  For children 5-12 yrs: 1-2 teaspoons daily.  Can be mixed with juice or your child's favorite drink.  Shake well before using.  Store in a cool dry place. ©ChildLife",
    "productDimensions": "Product in inches (LxWxH): 1.85x 1.85x 4.55",
    "imageUrls": "https://pics.drugstore.com/prodimg/232121/900.jpg",
    "productUPC": "UPC: 60827410200",
    "sourceURL": "https://www.walgreens.com/store/c/childlife-liquid-vitamin-c-orange/ID=prod6142520-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Chewable Vitamin C 500 mg Tablets Orange",
    "listPrice": "$2699",
    "description": "Helps support the immune systemNeutralizes free radicalsImproves iron absorption by the bodyNature Made Chewable Vitamin C 500 mg is a dietary supplement that helps support immune health, provides antioxidant support, and aids in iron absorption. Sourced from high-quality ingredients, this Vitamin C supplement has delicious orange-flavored Vitamin C chewable tablets with no color added and no artificial flavors. This is an antioxidant supplement with 500mg Vitamin C for adults. One Vitamin C tablet provides Vitamin C 500mg to support collagen synthesis and overall skin health. Adults, chew one Nature Made 500 mg Vitamin C tablet daily with a meal. Nature Made Vitamin C chewable supplements are quality you can trust. USP has tested and verified ingredients, potency, and manufacturing process. Made in the USA with quality global ingredients. USP sets official standards for dietary supplements. Visit the USP verified website for more information.\n\nImmune support supplement: contains one 150 count bottle of Nature Made Chewable Vitamin C 500 mg Tablets for a 150-day supply\nThese Chewable Vitamin C 500mg tablets are Vitamin C supplements that support immune health and offer antioxidant support\nVitamin C is necessary for the body to produce collagen, which helps support healthy skin\nBack in original orange flavor; adults chew one of these Nature Made Vitamin C 500mg chewable tablets daily with a meal\nThese Nature Made chewable Vitamin C tablets have no color added and no artificial flavors\nMade in the USA with quality global ingredients, United States Pharmacopeia (USP) Verified, #1 Pharmacist Recommended Vitamin & Supplement Brand*\n*Based on a survey of pharmacists who recommend branded vitamins and supplements.\nThese statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Made in USA(with globally sourced ingredients) USP has tested and verified ingredients, potency and manufacturing process. USP sets official standards for dietary supplements. www.uspverified.org Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 3.25x 3.25x 6.25",
    "imageUrls": "https://pics.drugstore.com/prodimg/93285/900.jpg",
    "productUPC": "UPC: 03160401717",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-chewable-vitamin-c-500-mg-tablets-orange/ID=prod987243-product"
  },
  {
    "productBrand": "Walgreens",
    "productName": "Calcium 600 mg + D3 400 IU Tablets (Packaging May Vary)",
    "listPrice": "$1299",
    "description": "For bone healthVitamin D3 assists in absorptionMay reduce risk of osteoporosisAdequate calcium and vitamin D throughout life, as a part of a well-balanced diet, may reduce the risk of osteoporosis. Each tablet provides 600 mg of elemental calcium.\n\nBone health.\nVitamin D3 to assist in the absorption of calcium.*\nNo gluten. No milk. No soy. No wheat.\nWalgreens pharmacist recommended.t\nUL verified dietary ingredients.\nwalgreens.com.how2recycle.info.\n*These statement have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease.\ntOur pharmacists recommend the Walgreens brand. We invite you to compare to national brands.Made in United States 100% satisfaction guaranteed For adults, take one (1) tablet up to two times daily with food or as directed by your physician. Take with a full glass of water. Not formulated for use in children.\nStore at room temperature in a dry place. © 2021 Walgreen Co.",
    "productDimensions": "Product in inches (LxWxH): 2.9x 2.9x 5.2",
    "imageUrls": "https://pics.drugstore.com/prodimg/607302/900.jpg",
    "productUPC": "UPC: 31191719911",
    "sourceURL": "https://www.walgreens.com/store/c/walgreens-calcium-600-mg---d3-400-iu-tablets/ID=prod6253494-product?skuId=sku6315631"
  },
  {
    "productBrand": "Nature's Bounty",
    "productName": "Pure Vitamin C 1000mg Caplets",
    "listPrice": "$1699",
    "description": "Promotes immune system healthNeutralizes cell-damaging free radicalsNo artificial color, flavor or sweetener(Product received may temporarily differ from image shown due to packaging update. Image will be revised shortly)\nVitamin Supplement\nPromotes Immune System Health*\nVitamin C plays an important role in supporting immune function.* As an antioxidant, Vitamin C helps neutralize cell-damaging free radicals in the body.*\nNo Artificial Color, Flavor or Sweetener, No Preservatives, No Sugar, No Starch, No Milk, No Lactose, No Soy, No Gluten, No Wheat, No Yeast, No Fish. Sodium Free.\nSuitable for Vegetarians\n*These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent and disease. For adults, take one (1) caplet daily, preferably with a meal. © 2016 Nature's Bounty, Inc.1-800-433-2990 Mon.-Sat. 9 AM-7 PM ET",
    "productDimensions": "Product in inches (LxWxH): 2.74x 2.74x 4.91",
    "imageUrls": "https://pics.drugstore.com/prodimg/186221/900.jpg",
    "productUPC": "UPC: 07431201707",
    "sourceURL": "https://www.walgreens.com/store/c/nature's-bounty-pure-vitamin-c-1000mg-caplets/ID=prod835506-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Vitamin D3 2000 IU (50 mcg) Tablets",
    "listPrice": "$2499",
    "description": "The body's preferred form of vitamin DSupports teeth, bone & musclesPromotes immune healthSay hello to an easy and effective Vitamin D supplement to support muscle, bone, teeth, and immune health. While sunshine is a great source of Vitamin D, many people aren't making enough of this essential nutrient from the sun. Vitamin D can be found in food as well in two different forms (known as Vitamin D2 and Vitamin D3), however, Vitamin D3 is more effective at raising and maintaining adequate levels of Vitamin D throughout the body. Vitamin D is a common nutrient shortfall. In fact, 95% of the US population does not get enough Vitamin D from food alone, making supplementation that much more important.(1) Support your sunshine and Vitamin D dietary needs today, with Nature Made's Vitamin D 2000 IU (50 mcg) tablets. (1)NHANES 2005-2016 Nutrients 2020, 12, 1735. (2)Based on a survey of pharmacists who recommend branded vitamin and supplements\n\nVITAMIN D3 IS ESSENTIAL TO A HEALTHY IMMUNE RESPONSE & MORE: Vitamin D is an essential nutrient that helps support a healthy immune response, aids in calcium absorption to support strong bones and teeth and supports muscle function.\nTHE BODY'S PREFERRED FORM OF VITAMIN D: Vitamin D3 is more effective than Vitamin D2 at raising and maintaining adequate Vitamin D levels throughout the body.\nAdults take 1 tablet daily with water and a meal.\nHIGH QUALITY INGREDIENTS: Made from carefully selected ingredients under strict manufacturing practices and guaranteed to meet our high quality standards. No color added. No artificial flavors. Gluten free.\n#1 PHARMACIST RECOMMENDED VITAMIN & SUPPLEMENT BRAND & USP VERIFIED(2): Because Nature Made is committed to quality and purity, this Vitamin D supplement is also USP Verified, an independent organization that tests for quality and purity.\nThese statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Made in USA Adults, take 1 tablet daily with water and a meal. Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.44x 2.44x 4.38",
    "imageUrls": "https://pics.drugstore.com/prodimg/344277/900.jpg",
    "productUPC": "UPC: 03160402674",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-vitamin-d3-2000-iu-(50-mcg)-tablets/ID=prod6063887-product"
  },
  {
    "productBrand": "L'il Critters",
    "productName": "Immune C Plus Zinc Gummy Vitamin Natural Fruit Flavors",
    "listPrice": "$1899",
    "description": "ChefsBest award for best tasteNatural colors & flavorsNo wheat, milk, eggs, peanuts or soy#1 Kids Gummy Vitamin Brand [1]One serving of L'il Critters Immune C Plus Zinc & Echinacea provides kids with 126 mg of Vitamin C for immune support, 3 mg of Zinc for cellular support, and 25 mg of Echinacea. [2]L'il Critters Immune C does not use FD&C Red #40, Blue #1, or Yellow #6. A two-gummy serving provides: An excellent source of Vitamin C (126 mg), 3 mg of Zinc, 25 mg of Echinacea [1] Based on 52 weeks Unit Sales, Nielsen All Outlet Data, through March 2018. [2] These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease. The Chef's Best Excellence Award is awarded to brands that surpass quality standards established by independent professional chefs.Made in United States Suggested use:  As a dietary supplement, parents may give each child, four years old or older, up to two (2) gummy bears per day.  Instruct child to chew each gummy bear carefully and thoroughly. ©2019 Church & Dwight Co., Inc.",
    "productDimensions": "Product in inches (LxWxH): 3.19x 3.19x 6.31",
    "imageUrls": "https://pics.drugstore.com/prodimg/265168/900.jpg",
    "productUPC": "UPC: 02791701945",
    "sourceURL": "https://www.walgreens.com/store/c/l'il-critters-immune-c-plus-zinc-gummy-vitamin-natural-fruit-flavors/ID=prod6038662-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Vitamin E 267 mg (400 IU) d-Alpha Softgels (Actual Item May Vary)",
    "listPrice": "$1899",
    "description": "Helps maintain a healthy heartHelps boost the immune systemHelps maintain red blood cellsNature Made Vitamin E 400 IU (267 mg) is an antioxidant supplement that provides Vitamin E, an essential nutrient that helps neutralize free radicals in the body. This Vitamin E supplement also supports immune health. Sourced from high-quality ingredients, these Nature Made Vitamin E 400 IU softgels are gluten free and contain no color added, no artificial flavors and no added preservatives. This Vitamin E Nature Made dietary supplement is the d-Alpha form of Vitamin E, which is the most bioavailable form. Nature Made supplements are quality you can trust. USP has tested and verified ingredients, potency and manufacturing process. USP sets official standards for dietary supplements. Visit the USP verified website for more information.\n\nAntioxidant support supplement: contains one 100 count bottle of Nature Made Vitamin E 267 mg (400 IU) Softgels for a 100-day supply \nProvides 267 mg of Vitamin E, which is an essential nutrient that helps neutralize free radicals in the body and supports a healthy immune system \nThis antioxidant supplement is the d-Alpha form of Vitamin E, which is the most bioavailable form \nAdults, take one Vitamin E supplement softgel daily with water and a meal \nSourced from high-quality ingredients, these Nature Made Vitamin E softgels are gluten free and contain no color added, no artificial flavors and no added preservatives \nUnited States Pharmacopeia (USP) Verified, #1 Pharmacist Recommended Vitamin & Supplement Brand*\n*Based on a survey of pharmacists who recommend branded vitamins and supplements.\nThese statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Made in United States(with globally sourced ingredients) Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.06x 2.06x 3.56",
    "imageUrls": "https://pics.drugstore.com/prodimg/17733/900.jpg",
    "productUPC": "UPC: 03160401224",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-vitamin-e-267-mg-(400-iu)-d-alpha-softgels/ID=prod3507-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Extra Strength Vitamin D3 5000 IU (125 mcg) Softgels",
    "listPrice": "$3199",
    "description": "Supports teeth, bone & immune healthWith the body's preferred vitamin D formRequires only one softgel dailyNature Made Extra Strength Vitamin D3 5000 IU Softgels are specially formulated high dose Vitamin D3 supplements that help raise Vitamin D levels for those with higher Vitamin D needs or deficiency, as determined by a healthcare professional. Sourced from high-quality ingredients, these gluten free Extra Strength Vitamin D3 supplements have no color added and no artificial flavors. Vitamin D3 is an essential nutrient that helps support a healthy immune response, helps support muscle health, and helps improve calcium absorption to support strong bones and teeth. Adults take one of these Extra Strength Vitamin D3 softgels daily with a meal. For easier swallowing, take this Vitamin D3 supplement with water before and during ingestion. Nature Made supplements are quality you can trust. USP has tested and verified ingredients, potency and manufacturing process. USP sets official standards for dietary supplements. Visit the USP verified website for more information. *Based on a survey of pharmacists who recommend branded vitamins and supplements.\n\nImmune support supplement: contains one 180 count bottle of Nature Made Extra Strength Vitamin D3 5000 IU (125 mcg) Softgels for a 180-day supply\nNature Made Vitamin D3 5000 IU softgels help support immune health, aid in calcium absorption to support bone health and teeth health, and help support muscle function\nThis immune support dietary supplement helps raise Vitamin D levels for those with higher Vitamin D needs or deficiency, as determined by a healthcare professional\nAdults take one of these Vitamin D3 softgels daily with a meal, but for easier swallowing, take with water before and during ingestion\nGluten free dietary supplements made with high-quality ingredients, these Vitamin D3 supplements have no added color or artificial flavors\nUnited States Pharmacopeia (USP) Verified, #1 Pharmacist Recommended Brand*These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Made in USA(with globally sourced ingredients) This is a high dose vitamin D product for those with higher vitamin D needs and/or deficiency, as determined by a healthcare professional. Consult with your healthcare professional before use. Take one softgel daily with a meal. For easier swallowing, take with water before and during ingestion. Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.0x 2.0x 4.13",
    "imageUrls": "https://pics.drugstore.com/prodimg/406341/900.jpg",
    "productUPC": "UPC: 03160402778",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-extra-strength-vitamin-d3-5000-iu-(125-mcg)-softgels/ID=prod6148395-product"
  },
  {
    "productBrand": "Schiff",
    "productName": "Glucosamine With Vitamin D3 And Hyaluronic Acid",
    "listPrice": "$1999",
    "description": "2000 mg glucosamine per servingPlus vitamin DHelps to lubricate & protect jointsSchiff Glucosamine Plus Vitamin D3 helps lubricate and protect joints by helping you maintain healthy structure and function of cartilage in your joints.* It contains Glucosamine Hydrochloride (HCl) which has a high potency of active Glucosamine. Glucosamine HCl is about 83% Glucosamine while some brands use Glucosamine Sulfate that is only about 65% Glucosamine. The recommended serving size is 2 softgels daily to get your daily dose of 2000mg of Glucosamine. Schiff guaranteed for purity, freshness and labeled potency. *These statements have not been evaluated by the food and drug administration. This product is not intended to diagnose, treat, cure or prevent any disease.Made in United States Adults take two (2) tablets daily with a meal OR one (1) tablet twice daily with meals. ©SCHIFF",
    "productDimensions": "Product in inches (LxWxH): 2.88x 2.88x 5.35",
    "imageUrls": "https://pics.drugstore.com/prodimg/298202/900.jpg",
    "productUPC": "UPC: 02052512187",
    "sourceURL": "https://www.walgreens.com/store/c/schiff-glucosamine-with-vitamin-d3-and-hyaluronic-acid/ID=prod6109121-product"
  },
  {
    "productBrand": "Finest Nutrition",
    "productName": "Vitamin C 1000 mg (Packaging May Vary)",
    "listPrice": "$2699",
    "description": "Protects from potential oxidative damageEnhances the immune systemRose hips are source of vitamin CVitamin C, an antioxidant, may help protect the body's cells from potential damage and may support the immune system. It is important for the structure of bones, muscles, and blood vessels, as well as the health of teeth and gums  100% satisfaction guaranteed Suggested Use: Adults One tablet daily with food as a dietary supplement. ©Walgreens Co.",
    "productDimensions": "Product in inches (LxWxH): 3.17x 3.17x 6.21",
    "imageUrls": "https://pics.drugstore.com/prodimg/452464/900.jpg",
    "productUPC": "UPC: 31191713987",
    "sourceURL": "https://www.walgreens.com/store/c/finest-nutrition-vitamin-c-1000-mg/ID=prod6109073-product"
  },
  {
    "productBrand": "Ddrops",
    "productName": "Baby Vitamin D Drops 400 IU",
    "listPrice": "$1699",
    "description": "Baby vitamin D dropsContains no preservativesDesigned for breast-fed babiesVitamin D is important for healthy growth and development in infancy and childhood especially for normal bone growth and muscle strength.* The American Academy of Pediatrics recommends that infants who are breast-fed or partially breast-fed should be supplemented with 400 IU of vitamin D daily.\nDoes not contain corn, casein, dairy, egg, fish, gluten, lactose, peanuts, shellfish, soy, starch, sugar, sulphites, wheat, yeast, preservatives, coloring or artificial flavors.\nSpecifically designed for breast fed babies. Made in Canada Infants less than 2 years old:  Place 1 drop daily onto mother's nipple, or a pacifier, and allow baby to suck for at least 30 seconds.  Or mix 1 drop daily with formula, juice or other food.  Children over 2 years or age:  Take 1 drop daily.  May be put on food or taken from a clean surface such as a spoon or the back of a washed hand. ©The D Drops Company Inc.",
    "productDimensions": "Product in inches (LxWxH): 4.45x 2.7x 4.45",
    "imageUrls": "https://pics.drugstore.com/prodimg/378610/900.jpg",
    "productUPC": "UPC: 85122800006",
    "sourceURL": "https://www.walgreens.com/store/c/ddrops-baby-vitamin-d-drops-400-iu/ID=prod6243703-product"
  },
  {
    "productBrand": "Nature's Bounty",
    "productName": "Super Strength D3 - 2000iu",
    "listPrice": "$2599",
    "description": "Helps develop strong bones & teethSupports a healthy immune systemNo artificial color or flavorSupports strong bones & immune health*Your sunshine vitamin. Laboratory tested. Non-GMO. No artificial color, artificial flavor, artificial sweetener, preservatives, sugar, starch, milk, lactose, gluten, wheat, yeast. fish. Sodium free.Made in USA1-800-433-2990*These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease. For adults, take one (1) softgel daily, preferably with a meal. ©2016 Nature's Bounty, Inc.",
    "productDimensions": "Product in inches (LxWxH): 2.3x 2.3x 4.45",
    "imageUrls": "https://pics.drugstore.com/prodimg/485096/900.jpg",
    "productUPC": "UPC: 07431252807",
    "sourceURL": "https://www.walgreens.com/store/c/nature's-bounty-super-strength-d3---2000iu/ID=prod6191674-product"
  },
  {
    "productBrand": "Ddrops",
    "productName": "Liquid Vitamin D3 600 IU Drops",
    "listPrice": "$1340",
    "description": "Vitamin D liquid dropsMaintenance of good healthContains 600 IU per dropDietary Supplement.\nThe Sunshine Vitamin in Just One Drop.\n\n600 IU per drop. \nA factor in the maintenance of good health. \nVitamin D is necessary for healthy bones and muscle function.* \nVitamin D is made in the skin when exposed to summer sunshine (UVB) and is present in only a few foods.*\nVitamin D can be measured with a blood test for 25-Hydroxyvitamin D. The institute of Medicine (IOM) recommends this level should be higher than 20 ng/mL. A vitamin D supplement may be required to raise 25-Hydroxyvitamin D to healthy levels.*\nThe Mom's Choice Awards Honoring Excellence logo is a trademark of the Mom's Choice Awards.\nDoes not contain corn, casein, dairy, egg, fish, gluten, lactose, peanuts, shellfish, soy, starch, sugar, sulphites, wheat, yeast preservatives, artificial coloring or artificial flavors.\nFor sale in USA only.\n1-866-761-9333\n*These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease.Product of Canada For adults and children over 1 year: Take one drop daily or as directed by a health care practitioner. May be put on food, added to a drink or licked from a clean surface such as a spoon or the back of a washed hand. Store upright and between 60 degrees F & 85 degrees F. ©Ddrops Company",
    "productDimensions": "Product in inches (LxWxH): 4.5x 2.2x 4.5",
    "imageUrls": "https://pics.drugstore.com/prodimg/405349/900.jpg",
    "productUPC": "UPC: 85122800011",
    "sourceURL": "https://www.walgreens.com/store/c/ddrops-liquid-vitamin-d3-600-iu-drops/ID=prod6170471-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Vitamin D3 2000 IU (50 mcg) Gummies Strawberry, Peach & Mango",
    "listPrice": "$1599",
    "description": "Nature Made Vitamin D3 2000 IU (50 mcg) Gummies are packed with Vitamin D3, the body's preferred form of Vitamin D. Sourced from high-quality ingredients, these gluten free Vitamin D3 supplements have no artificial flavors, no synthetic dyes, no high fructose corn syrup, and no artificial sweeteners. These Vitamin D3 gummies provide an essential nutrient that helps support muscle health and a healthy immune response, and aids in calcium absorption to support bone health and teeth health. These Vitamin D3 gummy dietary supplements are made with delicious strawberry, peach, and mango flavors. Adults chew two of these Vitamin D gummies daily. Nature Made supplements are quality you can trust. *Based on a survey of pharmacists who recommend branded vitamins and supplements.\n\nImmune support supplement: contains one 90-count bottle of Nature Made Vitamin D3 2000 IU (50 mcg) Gummies for a 45-day supply\nThese Vitamin D3 gummies for adults help support bone, teeth, muscle, and immune health\nThis 2000 IU Vitamin D3 supplement may help raise and maintain healthy Vitamin D levels\nAdults chew two of these dietary supplement gummies daily\nPackaged and quality tested in the USA, this gluten free supplement has no artificial flavors, no synthetic dyes, no high fructose corn syrup, no artificial sweeteners\n#1 Pharmacist Recommended Brand*These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Product of Spain and USA We're so sure you'll love the taste, we guarantee it. For more information on our Love Them or They're Free guarantee, visit our website. Adults, chew 2 gummies daily. Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.75x 2.75x 4.75",
    "imageUrls": "https://pics.drugstore.com/prodimg/410603/900.jpg",
    "productUPC": "UPC: 03160402844",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-vitamin-d3-2000-iu-(50-mcg)-gummies-strawberry,-peach-%26-mango/ID=prod6121517-product"
  },
  {
    "productBrand": "Nature's Bounty",
    "productName": "Triple Strength Natural Cranberry Softgels",
    "listPrice": "$1899",
    "description": "Helps maintain healthy urinary tractSupports immune functionNo artificial color, flavor or sweetenerDietary SupplementHelps Maintain a Healthy Urinary Tract*Triple StrengthFruit Concentrate With Immune Supporting Vitamin C*#1 Selling Cranberry BrandsRapid Release Liquid SoftgelTriple Strength Cranberry Concentrate contains the equivalent of 25,200 mg per serving of our unique Cranberry Blend, so two softgels daily is all you need!Cranberries are known for their ability to help maintain a healthy urinary tract.*  This product also contains Vitamin C, an antioxidant that plays a role in supporting immune function, plus Vitamin E, an essential nutrient crucial for good health.*No Artificial Color, Flavors or Sweetener, No Preservatives, No Sugar, No Starch, No Milk, No Lactose, No Gluten, No Wheat, No Yeast, No Fish. Sodium Free.* These statements have not been evaluated by the Food and Drug Administration.  This product is not intended to diagnose, treat, cure or prevent any disease. For adults, take two (2) softgels daily, preferably with meals. © 2016 Nature's Bounty, Inc.1-800-433-2990 Mon.-Sat. 9 AM - 7 PM ET",
    "productDimensions": "Product in inches (LxWxH): 2.4x 2.4x 4.71",
    "imageUrls": "https://pics.drugstore.com/prodimg/149763/900.jpg",
    "productUPC": "UPC: 07431213794",
    "sourceURL": "https://www.walgreens.com/store/c/nature's-bounty-triple-strength-natural-cranberry-softgels/ID=prod1462544-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Vitamin D3 1000 IU (25 mcg) Softgels",
    "listPrice": "$1999",
    "description": "Supports teeth, bone & immune healthThe body's preferred form of vitamin DNo artificial colors or flavorsSay hello to an easy and effective Vitamin D supplement to support muscle, bone, teeth, and immune health. While sunshine is a great source of Vitamin D, many people aren't making enough of this essential nutrient from the sun. Vitamin D can be found in food as well in two different forms (known as Vitamin D2 and Vitamin D3), however, Vitamin D3 is more effective at raising and maintaining adequate levels of Vitamin D throughout the body. Vitamin D is a common nutrient shortfall. In fact, 95% of the US population does not get enough Vitamin D from food alone, making supplementation that much more important.(1) Support your sunshine and Vitamin D dietary needs today, with Nature Made's Vitamin D 1000 IU (25 mcg) softgels. (1)NHANES 2005-2016 Nutrients 2020, 12, 1735. (2)Based on a survey of pharmacists who recommend branded vitamin and supplements\n\nVITAMIN D3 IS ESSENTIAL TO A HEALTHY IMMUNE RESPONSE & MORE: Vitamin D is an essential nutrient that helps support a healthy immune response, aids in calcium absorption to support strong bones and teeth and supports muscle function.\nTHE BODY'S PREFERRED FORM OF VITAMIN D: Vitamin D3 is more effective than Vitamin D2 at raising and maintaining adequate Vitamin D levels throughout the body.\nAdults take 1 softgel daily with water and a meal.\nHIGH QUALITY INGREDIENTS: Made from carefully selected ingredients under strict manufacturing practices and guaranteed to meet our high quality standards. No color added. No artificial flavors. Gluten free.\n#1 PHARMACIST RECOMMENDED VITAMIN & SUPPLEMENT BRAND(2): Nature Made is the #1 pharmacist recommended vitamin and supplement brand.\nThese statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Made in USA Adults, take 1 softgel daily with water and a meal. Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.63x 2.63x 5.13",
    "imageUrls": "https://pics.drugstore.com/prodimg/344275/900.jpg",
    "productUPC": "UPC: 03160402677",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-vitamin-d3-1000-iu-(25-mcg)-softgels/ID=prod6106323-product"
  },
  {
    "productBrand": "Emergen-C",
    "productName": "Immune Support Chewable Tablet with 1000 mg Vitamin C & B Vitamins Orange Blast",
    "listPrice": "$1299",
    "description": "Orange Blast flavored chewableswith B vitamins & antioxidantsWith other natural flavorsEmergen-C Immune+ Chewables are a quick and tasty way to help support your immune system as part of your daily wellness routine.* Just two Emergen-C chewable tablets deliver 1,000 mg of Vitamin C more than 10 oranges (1). Thats two times more Vitamin C per chew than the leading immune support chewable (2). Emergen-C chewables also provide Vitamin D, plus Vitamin E, Vitamin B6 and Zinc for additional immune system support.* Emergen-C Chewables will give taste buds a tangy burst of goodness with natural, real fruit flavor no water needed! Emergen-C Immune+ Orange Blast chewable makes it deliciously easy to support wellness goals. Transform every day with the support of Emergen-C. (1) Based on using the USDA.gov nutrient database value for a large, raw orange (2) Per chewable tablet. Compared to leading immune support chewable *These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.Made in United States Ages 14 and up, take two (2) chewable tablets daily. Do not exceed suggested use. Not formulated for use in children. As with any supplement, if you are pregnant, nursing or taking medication, consult your doctor before use. ©GSK group of companies or its licensor",
    "productDimensions": "Product in inches (LxWxH): 2.63x 2.63x 4.47",
    "imageUrls": "https://pics.drugstore.com/prodimg/555179/900.jpg",
    "productUPC": "UPC: 07631432450",
    "sourceURL": "https://www.walgreens.com/store/c/emergen-c-immune-support-chewable-tablet-with-1000-mg-vitamin-c-%26-b-vitamins-orange-blast/ID=prod6298705-product"
  },
  {
    "productBrand": "Nature's Bounty",
    "productName": "D3-5000 IU Vitamin Supplement Softgels",
    "listPrice": "$2199",
    "description": "Helps develop strong bones & teethMaintains breast & immune system healthCould support colon & pancreas healthVitamin D is an essential nutrient that works with Calcium to help develop strong bones & teeth.*  This high-potency Vitamin D supplement also assists in maintaining breast health & a healthy immune system.*  An analysis of 5 studies concluded that increasing Vitamin D intake up to 5000 IU per day could promote colon health.* Recent evidence also indicates that increasing Vitamin D intake can support the health of the pancreas.*  Supplementing with Super Strength D-5000 IU is an easy & convenient way to increase your daily Vitamin D intake. \n\nNo Artificial Color, Flavor or Sweetener, No Preservatives, No Sugar, No Starch, No Milk, No Lactose, No Gluten, No Wheat, No Yeast, No Fish. Sodium Free.\nHealthy You . Healthy Earth\nLaboratory Tested . Guaranteed Quality \nQuestions Call: 1-888-433-2990\n*These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease.Made in United States  Guaranteed freshness Laboratory tested For adults, take one (1) softgel daily, preferably with a meal. ©2016 Nature's Bounty",
    "productDimensions": "Product in inches (LxWxH): 4.3x 1.95x 4.3",
    "imageUrls": "https://pics.drugstore.com/prodimg/232798/900.jpg",
    "productUPC": "UPC: 07431219377",
    "sourceURL": "https://www.walgreens.com/store/c/nature's-bounty-d3-5000-iu-vitamin-supplement-softgels/ID=prod6003958-product"
  },
  {
    "productBrand": "Airborne",
    "productName": "Gummies with Vitamin C, Minerals & Herbs Immune Support Assorted Fruit",
    "listPrice": "$1699",
    "description": "Helps support your immune system1000 mg vitamin C per servingWith vitamins, minerals, & herbsAirborne Immune Support Gummies provide immune support in a delicious, and easy-to-take gummy form. Each serving (3 gummies) delivers a blast of 750 mg of Vitamin C and 9 other vitamins, minerals, and herbs, including Echinacea and ginger.* Adults and Children 14 years and older, chew 3 gummies thoroughly before swallowing. Repeat as necessary up to 3X per day, no more than 9 gummies per day. Children 12 to 13 years of age, take 3 gummies. Chew thoroughly before swallowing. Repeat as necessary up to 2X per day, no more than 6 gummies per day. *These Statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease.  Delicious Zesty Orange, Very Berry, and Grapefruit flavored immune support chewable gummies  750 mg of Vitamin C per serving (3 gummies) to support your immune system  High in antioxidants (Vitamins C & E) and excellent source of Selenium  Proprietary Herbal Blend including Echinacea & Ginger  Gluten Free with no artificial coloringMade in United States Children 14 years and older take 3 gummies. Chew thoroughly before swallowing. Repeat as necessary up to 3 times per day, no more than 9 gummies per day. Children 12 to 13 years of age take 3 gummies. Chew thoroughly before swallowing. Repeat as necessary up to 2 times per day, no more than 6 gummies per day. Not for younger children due to the risk of choking.\nAdults and children 12 years and older: chew 3 gummies per day. Chew thoroughly. Do not exceed daily serving size. ©AIRBORNE",
    "productDimensions": "Product in inches (LxWxH): 2.87x 2.87x 5.37",
    "imageUrls": "https://pics.drugstore.com/prodimg/499471/900.jpg",
    "productUPC": "UPC: 64786518573",
    "sourceURL": "https://www.walgreens.com/store/c/airborne-gummies-with-vitamin-c,-minerals-%26-herbs-immune-support-assorted-fruit/ID=prod6187540-product"
  },
  {
    "productBrand": "Nature Made",
    "productName": "Calcium 600 Mg With Vitamin D3 Tablets",
    "listPrice": "$2799",
    "description": "Helps build strong bonesVitamin D improves calcium absorptionNo artificial colors or flavorsNature Made Calcium 600 mg with Vitamin D3 Tablets are Calcium supplements formulated to help support bone strength.\n    Sourced from high quality ingredients, these gluten free Nature Made Calcium 600mg with Vitamin D3 supplements\n    contain no color added and no artificial flavors. This Calcium bone supplement also provides Vitamin D3, which helps\n    improve Calcium absorption. This Nature Made 600 mg Calcium Vitamin D3 supplement is perfect for adults who are low\n    in Calcium or want an additional dietary supplement with their diet. Nature Made supplements are quality you can\n    trust. USP has tested and verified ingredients, potency and manufacturing process. USP sets official standards for\n    dietary supplements. Visit the USP verified website for more information.\n    \n    Bone support Calcium supplement: contains one 220 count bottle of Nature Made Calcium 600 mg with Vitamin D3\n        Tablets\n    These Calcium tablets help support strong bones and have Vitamin D, which helps improve Calcium absorption and\n        helps support bone health\n    Adequate Calcium and Vitamin D throughout life, as part of a well-balanced diet, may reduce the risk of\n        osteoporosis\n    Adults take one Nature Made Calcium with Vitamin D3 tablet 1 to 2 times daily with water and a meal\n    Made in the USA with quality global ingredients, this gluten free Calcium supplement has no color added and no\n        artificial flavors\n    United States Pharmacopeia (USP) VerifiedThese statements have not been evaluated by the Food and\n        Drug Administration. This product is not intended to diagnose, treat, cure, or prevent any disease.\n    \nMade in United States   Adults, take 1 tablet 1 to 2 times daily with water and a meal. Store tightly closed, in a cool, dry place, out of reach of children. Do not use if imprinted seal under cap is broken or missing. ©Nature Made",
    "productDimensions": "Product in inches (LxWxH): 2.94x 2.94x 5.31",
    "imageUrls": "https://pics.drugstore.com/prodimg/412953/900.jpg",
    "productUPC": "UPC: 03160401212",
    "sourceURL": "https://www.walgreens.com/store/c/nature-made-calcium-600-mg-with-vitamin-d3-tablets/ID=prod4214543-product"
  }
]